#pragma once
//-------------------------------------------------------------------------------------------------------------
//	インクルード
//-------------------------------------------------------------------------------------------------------------
#include <stdbool.h>
#include "ccadical.h"
#include "./read.h"

//-------------------------------------------------------------------------------------------------------------
//	プロトタイプ宣言
//-------------------------------------------------------------------------------------------------------------
/** 正常回路節（グローバル）をソルバに読み込む */
void LoadModelToSolver(CCaDiCaL *solver);

/** テストパタン生成モデルを構築する */
bool WriteTPGModel(
	CCaDiCaL *solver,
	FNODE* target			  /**< 対象故障 */
);

/** テストパタン生成モデルを作成する */
bool CreateTPGmodel(
	CCaDiCaL* solver,
	FNODE* target			  /**< 対象故障 */
);








