//------------------------------------------------------------------------
//File name : SAF_Forward_Implication.c
//Date : 2013/7/29
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/netlist.h"
#include	"../../Lib/bit_tp.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"../Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	SAF_0_Forward_Implication	(NLIST*, int);
void	SAF_1_Forward_Implication	(NLIST*, int);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//
	//#define		FIMPL_DEBUG
//------------------------------------------------------------------------
//  静的変数
//------------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : SAF_0_Forward_Implication
//  機  能 : t_netの入力値が0からの前方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(前方含意判定信号線), tp_id(テストパターンの何番目か)
//----------------------------------------------
void	SAF_0_Forward_Implication(NLIST* t_net, int tp_id){

	int		i;

	switch(t_net->type){
		//********************************************************************
		case BUF:
		case FOUT:
		case AND:
			//-----------------------------------------------------------
			// 入力=0 → 出力=0に前方含意可能
			//-----------------------------------------------------------
			//        |＼                   ＿＿                    ______ 0
			//        |  ＼             0 --|   ＼                 |
			//   0 ---|BUF >--- 0       ? --| AND│--- 0      0 ---|
			//        |  ／             ? --|   ／                 |______ 
			//        |／                   ‾‾                           0

			//出力信号線を0固定
			Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
			printf("前方含意0固定:%s\n", t_net->name);
#endif
			//さらに出力信号線を前方含意判定
			for(i=0; i<t_net->n_out; i++){
				//出力信号線がドントケア
				if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
					SAF_0_Forward_Implication(t_net->out[i], tp_id);
				}
			}

		break;
		//********************************************************************
		case INV:
		case NAND:
			//-----------------------------------------------------------
			// 入力=0 → 出力=1に前方含意可能
			//-----------------------------------------------------------
			//        |＼                   ＿＿
			//        |  ＼             0 --|   ＼
			//   0 ---|INV >○-- 1      ? --|NAND│○-- 1
			//        |  ／             ? --|   ／
			//        |／                   ‾‾   
			 
			//出力信号線を1固定
			Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
			printf("前方含意1固定:%s\n", t_net->name);
#endif
			//さらに出力信号線を前方含意判定
			for(i=0; i<t_net->n_out; i++){
				//出力信号線がドントケア
				if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
					SAF_1_Forward_Implication(t_net->out[i], tp_id);
				}
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------
			// 入力=0 (全入力=0なら出力=0に含意可能)
			//-----------------------------------------------------------
			//         ＿＿
			// 【0】---＼   ＼
			//   0-------) OR >--- 0(t_net)
			//   0-----／   ／
			//         ‾‾      ※全入力信号線=0 (非制御値)

			//入力信号線の非制御値(0)数を確認
			for(i=0; i<t_net->n_in; i++){
				//0以外があったらbreak
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) != 0){
					break;
				}
			}

			//全て非制御値(0)の場合
			if(i == t_net->n_in){
				//出力信号線を0固定
				Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定:%s\n", t_net->name);
#endif
				//さらに出力信号線を前方含意判定
				for(i=0; i<t_net->n_out; i++){
					//出力信号線がドントケア
					if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
						SAF_0_Forward_Implication(t_net->out[i], tp_id);
					}
				}
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------
			// 入力=0 (全入力=0なら出力=1に含意可能)
			//-----------------------------------------------------------
			//         ＿＿
			// 【0】---＼   ＼
			//   0 ------)NOR >○-- 1(t_net)
			//   0 ----／   ／
			//         ‾‾

			//入力信号線の非制御値(0)数を確認
			for(i=0; i<t_net->n_in; i++){
				//0以外があったらbreak
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) != 0){
					break;
				}
			}

			//全て非制御値(0)の場合
			if(i == t_net->n_in){
				//出力信号線を1固定
				Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定:%s\n", t_net->name);
#endif
				//さらに出力信号線を前方含意判定
				for(i=0; i<t_net->n_out; i++){
					//出力信号線がドントケア
					if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
						SAF_1_Forward_Implication(t_net->out[i], tp_id);
					}
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//-----------------------------------------------------------
			// 入力=0 (全入力がケアビットなら前方含意可能)
			//-----------------------------------------------------------
			//         ＿＿＿                           ＿＿＿
			// 【0】---＼    ＼                 【0】---＼    ＼
			//           ))EXOR>--- 0(t_net)              ))EXOR>--- 1(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ‾‾‾                           ‾‾‾  
	
			//-----------------------------------------------------------
			// 入力=0 (全入力がケアビットなら前方含意可能)
			//-----------------------------------------------------------
			//         ＿＿＿                           ＿＿＿
			// 【0】---＼    ＼                 【0】---＼    ＼
			//          ))EXNOR>○-- 1(t_net)            ))EXNOR>○-- 0(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ‾‾‾                           ‾‾‾  
			
			//入力信号線のケアビット数を確認
			for(i=0; i<t_net->n_in; i++){
				//Xがあったらbreak
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
					break;
				}
			}

			//全てケアビットの場合
			if(i == t_net->n_in){
				//-----------------------------------------
				// 2値の場合
				//-----------------------------------------
				if(n_before_x == 0){
					//------------------------
					//出力値=0
					//------------------------
					if(Get_NBit_Xbuf(t_net->nval, tp_id) == 0){
						//出力信号線を0固定
						Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意0固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_0_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
					
					//------------------------
					//出力値=1
					//------------------------
					else{
						//出力信号線を1固定
						Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意1固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_1_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
				}
				
				//-----------------------------------------
				// 3値の場合
				//-----------------------------------------
				else{
					//------------------------
					//出力値=0
					//------------------------
					if(Get_NBit(t_net->nval, tp_id) == 0){
					//出力信号線を0固定
						Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意0固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_0_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
					
					//------------------------
					//出力値=1 (全入力がケアビットなので問題ないはず…)
					//------------------------
					else{
						//出力信号線を1固定
						Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意1固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_1_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
				}
			}
		break;		
		//********************************************************************
	}
}

	
//----------------------------------------------
//  関数名 : SAF_1_Forward_Implication
//  機  能 : t_netの入力値が1からの前方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(前方含意判定信号線), tp_id(テストパターンの何番目か), xid_flag(現在のケアビット固定フラグ)
//----------------------------------------------
void	SAF_1_Forward_Implication(NLIST* t_net, int tp_id){

	int		i;

	switch(t_net->type){
		//********************************************************************
		case BUF:
		case FOUT:
		case OR:
			//-----------------------------------------------------------
			// 入力=0 → 出力=0に前方含意可能
			//-----------------------------------------------------------
			//        |＼                   ＿＿                    ______ 1
			//        |  ＼             1 --＼   ＼                |
			//   1 ---|BUF >--- 1       ? ----) OR >--- 1     1 ---|
			//        |  ／             ? --／   ／                |______ 
			//        |／                   ‾‾                           1

			//出力信号線を1固定
			Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
			printf("前方含意1固定:%s\n", t_net->name);
#endif
			//さらに出力信号線を前方含意判定
			for(i=0; i<t_net->n_out; i++){
				//出力信号線がドントケア
				if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
					SAF_1_Forward_Implication(t_net->out[i], tp_id);
				}
			}

		break;
		//********************************************************************
		case INV:
		case NOR:
			//-----------------------------------------------------------
			// 入力=1 (出力=0に含意可能)
			//-----------------------------------------------------------
			//        |＼                   ＿＿
			//        |  ＼             1 --＼   ＼
			//   1 ---|INV >○-- 0      ? ----)NOR >○-- 0
			//        |  ／             ? --／   ／
			//        |／                   ‾‾   
			 
			//出力信号線を0固定
			Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
			printf("前方含意0固定:%s\n", t_net->name);
#endif
			//さらに出力信号線を前方含意判定
			for(i=0; i<t_net->n_out; i++){
				//出力信号線がドントケア
				if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
					SAF_0_Forward_Implication(t_net->out[i], tp_id);
				}
			}

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------
			// 入力=1 (全入力=1なら出力=1に含意可能)
			//-----------------------------------------------------------
			//         ＿＿  
			// 【1】---|   ＼
			//   1 ----| AND│--- 1(t_net)  
			//   1 ----|   ／
			//         ‾‾

			//入力信号線の非制御値(1)数を確認
			for(i=0; i<t_net->n_in; i++){
				//1以外があったらbreak
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) != 1){
					break;
				}
			}

			//全て非制御値(1)の場合
			if(i == t_net->n_in){
				//出力信号線を1固定
				Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定:%s\n", t_net->name);
#endif
				//さらに出力信号線を前方含意判定
				for(i=0; i<t_net->n_out; i++){
					//出力信号線がドントケア
					if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
						SAF_1_Forward_Implication(t_net->out[i], tp_id);
					}
				}
			}

		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------
			// 入力=1 (全入力=1なら出力=0に含意可能)
			//-----------------------------------------------------------
			//         ＿＿  
			// 【1】---|   ＼
			//   1 ----|NAND│○-- 0(t_net)  
			//   1 ----|   ／
			//         ‾‾
			
			//入力信号線の非制御値(1)数を確認
			for(i=0; i<t_net->n_in; i++){
				//1以外があったらbreak
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) != 1){
					break;
				}
			}

			//全て非制御値(1)の場合
			if(i == t_net->n_in){
				//出力信号線を0固定
				Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定:%s\n", t_net->name);
#endif
				//さらに出力信号線を前方含意判定
				for(i=0; i<t_net->n_out; i++){
					//出力信号線がドントケア
					if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
						SAF_0_Forward_Implication(t_net->out[i], tp_id);
					}
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//-----------------------------------------------------------
			// 入力=1 (全入力がケアビットなら前方含意可能)
			//-----------------------------------------------------------
			//         ＿＿＿                           ＿＿＿
			// 【1】---＼    ＼                 【1】---＼    ＼
			//           ))EXOR>--- 1(t_net)              ))EXOR>--- 0(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ‾‾‾                           ‾‾‾  
	
			//-----------------------------------------------------------
			// 入力=1 (全入力がケアビットなら前方含意可能)
			//-----------------------------------------------------------
			//         ＿＿＿                           ＿＿＿
			// 【1】---＼    ＼                 【1】---＼    ＼
			//          ))EXNOR>○-- 0(t_net)            ))EXNOR>○-- 1(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ‾‾‾                           ‾‾‾  
			
			//入力信号線のケアビット数を確認
			for(i=0; i<t_net->n_in; i++){
				//Xがあったらbreak
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
					break;
				}
			}

			//全てケアビットの場合
			if(i == t_net->n_in){
				//-----------------------------------------
				// 2値の場合
				//-----------------------------------------
				if(n_before_x == 0){
					//------------------------
					//出力値=0
					//------------------------
					if(Get_NBit_Xbuf(t_net->nval, tp_id) == 0){
						//出力信号線を0固定
						Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意0固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_0_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
					
					//------------------------
					//出力値=1
					//------------------------
					else{
						//出力信号線を1固定
						Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意1固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_1_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
				}
				
				//-----------------------------------------
				// 3値の場合
				//-----------------------------------------
				else{
					//------------------------
					//出力値=0
					//------------------------
					if(Get_NBit(t_net->nval, tp_id) == 0){
					//出力信号線を0固定
						Set_NBit_Zero(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意0固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_0_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
					
					//------------------------
					//出力値=1 (全入力がケアビットなので問題ないはず…)
					//------------------------
					else{
						//出力信号線を1固定
						Set_NBit_One(t_net->xid_nval, tp_id);
#ifdef FIMPL_DEBUG
						printf("前方含意1固定:%s\n", t_net->name);
#endif
						//さらに出力信号線を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval, tp_id) == 3){
								SAF_1_Forward_Implication(t_net->out[i], tp_id);
							}
						}
					}
				}
			}
		break;		
		//********************************************************************
	}
}