//------------------------------------------------------------------------
//File name : SAF_3v_CPT_Ndrop.c
//Date : 2012/1/16
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../../Netlist/netlist.h"
#include	"../../../Lib/bit_tp.h"
#include	"../../../Lib/bit_int.h"
#include	"../../../StandardHead.h"
#include	"../../../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void SAF_3v_CPT0_Ndrop	(int , unsigned int , NLIST *);
void SAF_3v_CPT1_Ndrop	(int , unsigned int , NLIST *);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//------------------------------------------------------------------------------------
//  関数名 : SAF_3v_CPT0_Ndrop
//  機  能 : 3値縮退故障クリティカルパストレーシング
//  戻り値 : なし
//  引  数 : ffr_id(FFR番号), tp_id(テストパターンの何番目か), t_net(CPTを始める信号線[=FFRの先頭])
//------------------------------------------------------------------------------------
void	SAF_3v_CPT0_Ndrop(int ffr_id, unsigned int tp_id, NLIST *t_net){

	int i;
	int	n_contorolling=0;	//入力の制御値の本数
	int	n_xbit=0;			//入力のXbitの本数
	int	in;					//t_netのi番目(制御値の場所を格納)
	int	nval;				//正常値の一時保存変数

	switch(t_net->type){
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------
			// 出力=0(入力の1縮退故障が検出可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|BUF >--- 0
			//        |  ／
			//        |／

			//検出回数がopt.n_drop回以下なら検出回数等を保存
			if(t_net->in[0]->det_sf1<opt.n_drop && t_net->in[0]->test_sf1==YES){
				//FFR内の検出故障数更新
				ffr[ffr_id].n_detect++;
	
				//対象信号線の1縮退故障の検出回数更新
				t_net->in[0]->det_sf1++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_sa1[tp_id], t_net->in[0]->n);
			}

			//さらに入力信号線をCPT
			SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------
			// 出力=0(入力の0縮退故障が検出可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|INV >○-- 0
			//        |  ／
			//        |／

			//検出回数がopt.n_drop回以下なら検出回数等を保存
			if(t_net->in[0]->det_sf0<opt.n_drop && t_net->in[0]->test_sf0==YES){
				//FFR内の検出故障数更新
				ffr[ffr_id].n_detect++;
	
				//対象信号線の0縮退故障の検出回数更新
				t_net->in[0]->det_sf0++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_sa0[tp_id], t_net->in[0]->n);
			}

			//さらに入力信号線をCPT
			SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------
			// 出力=0(入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   X --| AND│--- 0
			//   1 --|   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->nval, tp_id);

				//入力信号線が制御値:0
				if(nval == 0){
					n_contorolling++;
					in = i;
			
					//入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------
			// 入力信号線の『制御値が1本』かつ『Xbitが存在しない』なら故障検出可能
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --| AND│--- 0
			//   1 --|   ／
			//       ‾‾
			if(n_contorolling==1 && n_xbit==0){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[in]->det_sf1<opt.n_drop && t_net->in[in]->test_sf1==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の1縮退故障の検出回数更新
					t_net->in[in]->det_sf1++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa1[tp_id], t_net->in[in]->n);
				}

				//入力信号線のさらに入力信号線をCPT
				SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------
			// 出力=0(入力信号線は全て非制御値⇒入力の0縮退故障が検出可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --|NAND│○-- 0
			//   1 --|   ／
			//       ‾‾      ※全入力信号線=1 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[i]->det_sf0<opt.n_drop && t_net->in[i]->test_sf0==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の0縮退故障の検出回数更新
					t_net->in[i]->det_sf0++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa0[tp_id], t_net->in[i]->n);
				}

				//さらに入力信号線をCPT
				SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------
			// 出力=0(入力信号線は全て非制御値⇒入力の1縮退故障が検出可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----) OR >--- 0
			//   0 --／   ／
			//       ‾‾      ※全入力信号線=0 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[i]->det_sf1<opt.n_drop && t_net->in[i]->test_sf1==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の1縮退故障の検出回数更新
					t_net->in[i]->det_sf1++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa1[tp_id], t_net->in[i]->n);
				}

				//さらに入力信号線をCPT
				SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------
			// 出力=0(入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----)NOR >○-- 0
			//   X --／   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->nval, tp_id);

				//入力信号線が制御値:1
				if(nval == 1){
					n_contorolling++;
					in = i;
			
					//入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------
			// 入力信号線の『制御値が1本』かつ『Xbitが存在しない』なら故障検出可能
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----)NOR >○-- 0
			//   0 --／   ／
			//       ‾‾
			if(n_contorolling==1 && n_xbit==0){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[in]->det_sf0<opt.n_drop && t_net->in[in]->test_sf0==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の0縮退故障の検出回数更新
					t_net->in[in]->det_sf0++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa0[tp_id], t_net->in[in]->n);
				}

				//入力信号線のさらに入力信号線をCPT
				SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case EXOR:
			//-----------------------------------------------------------
			// 出力=0 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//         ))EXOR>--- 0               ))EXOR>--- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 入力信号線=0 (1縮退故障が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->nval, tp_id)==0 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf1<opt.n_drop && t_net->in[i]->test_sf1==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の1縮退故障の検出回数更新
						t_net->in[i]->det_sf1++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa1[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 入力信号線=1 (0縮退故障が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->nval, tp_id)==1 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf0<opt.n_drop && t_net->in[i]->test_sf0==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の0縮退故障の検出回数更新
						t_net->in[i]->det_sf0++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa0[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
		case EXNOR:
			//-----------------------------------------------------------
			// 出力=0 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//        ))EXNOR>○-- 0             ))EXNOR>○-- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 入力信号線=0 (1縮退故障が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->nval, tp_id)==0 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf1<opt.n_drop && t_net->in[i]->test_sf1==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の1縮退故障の検出回数更新
						t_net->in[i]->det_sf1++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa1[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 入力信号線=1 (0縮退故障が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->nval, tp_id)==1 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf0<opt.n_drop && t_net->in[i]->test_sf0==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の0縮退故障の検出回数更新
						t_net->in[i]->det_sf0++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa0[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
	}

}//END

//------------------------------------------------------------------------------------
//  関数名 : SAF_3v_CPT1_Ndrop
//  機  能 : 3値縮退故障クリティカルパストレーシング
//  戻り値 : なし
//  引  数 : ffr_id(FFR番号), tp_id(テストパターンの何番目か), t_net(CPTを始める信号線[=FFRの先頭])
//------------------------------------------------------------------------------------
void	SAF_3v_CPT1_Ndrop(int ffr_id, unsigned int tp_id, NLIST *t_net){
	
	int i;
	int	n_contorolling=0;	//入力の制御値の本数
	int	n_xbit=0;			//入力のXbitの本数
	int	in;					//t_netのi番目(制御値の場所を格納)
	int	nval;				//入力信号線の正常値を一時保存

	switch(t_net->type){
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------
			// 出力=1(入力の0縮退故障が検出可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|BUF >--- 1
			//        |  ／
			//        |／

			//検出回数がopt.n_drop回以下なら検出回数等を保存
			if(t_net->in[0]->det_sf0<opt.n_drop && t_net->in[0]->test_sf0==YES){
				//FFR内の検出故障数更新
				ffr[ffr_id].n_detect++;
	
				//対象信号線の0縮退故障の検出回数更新
				t_net->in[0]->det_sf0++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_sa0[tp_id], t_net->in[0]->n);
			}

			//さらに入力信号線をCPT
			SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------
			// 出力=0(入力の0縮退故障が検出可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|INV >○-- 1
			//        |  ／
			//        |／

			//検出回数がopt.n_drop回以下なら検出回数等を保存
			if(t_net->in[0]->det_sf1<opt.n_drop && t_net->in[0]->test_sf1==YES){
				//FFR内の検出故障数更新
				ffr[ffr_id].n_detect++;
	
				//対象信号線の1縮退故障の検出回数更新
				t_net->in[0]->det_sf1++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_sa1[tp_id], t_net->in[0]->n);
			}

			//さらに入力信号線をCPT
			SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------
			// 出力=1(入力信号線は全て非制御値⇒入力の0縮退故障が検出可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --| AND│--- 1
			//   1 --|   ／
			//       ‾‾      ※全入力信号線=1 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[i]->det_sf0<opt.n_drop && t_net->in[i]->test_sf0==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の0縮退故障の検出回数更新
					t_net->in[i]->det_sf0++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa0[tp_id], t_net->in[i]->n);
				}

				//さらに入力信号線をCPT
				SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------
			// 出力=1(入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   X --|NAND│○-- 1
			//   1 --|   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){

				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->nval, tp_id);

				//入力信号線が制御値:0
				if(nval == 0){
					n_contorolling++;
					in = i;
			
					//入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------
			// 入力信号線の『制御値が1本』かつ『Xbitが存在しない』なら故障検出可能
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --|NAND│○-- 1
			//   1 --|   ／
			//       ‾‾
			if(n_contorolling==1 && n_xbit==0){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[in]->det_sf1<opt.n_drop && t_net->in[in]->test_sf1==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の1縮退故障の検出回数更新
					t_net->in[in]->det_sf1++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa1[tp_id], t_net->in[in]->n);
				}

				//入力信号線のさらに入力信号線をCPT
				SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------
			// 出力=0(入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   X --／   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->nval, tp_id);

				//入力信号線が制御値:1
				if(nval == 1){
					n_contorolling++;
					in = i;
			
					//入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------
			// 入力信号線の『制御値が1本』かつ『Xbitが存在しない』なら故障検出可能
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   0 --／   ／
			//       ‾‾
			if(n_contorolling==1 && n_xbit==0){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[in]->det_sf0<opt.n_drop && t_net->in[in]->test_sf0==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の0縮退故障の検出回数更新
					t_net->in[in]->det_sf0++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa0[tp_id], t_net->in[in]->n);
				}

				//入力信号線のさらに入力信号線をCPT
				SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------
			// 出力=0(入力信号線は全て非制御値⇒入力の1縮退故障が検出可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----)NOR >○-- 1
			//   0 --／   ／
			//       ‾‾      ※全入力信号線=0 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//検出回数がopt.n_drop回以下なら検出回数等を保存
				if(t_net->in[i]->det_sf1<opt.n_drop && t_net->in[i]->test_sf1==YES){
					//FFR内の検出故障数更新
					ffr[ffr_id].n_detect++;
	
					//対象信号線の1縮退故障の検出回数更新
					t_net->in[i]->det_sf1++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_sa1[tp_id], t_net->in[i]->n);
				}

				//さらに入力信号線をCPT
				SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case EXOR:
			//-----------------------------------------------------------
			// 出力=1 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//         ))EXOR>--- 1               ))EXOR>--- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 入力信号線=0 (1縮退故障が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->nval, tp_id)==0 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf1<opt.n_drop && t_net->in[i]->test_sf1==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の1縮退故障の検出回数更新
						t_net->in[i]->det_sf1++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa1[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 入力信号線=1 (0縮退故障が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->nval, tp_id)==1 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf0<opt.n_drop && t_net->in[i]->test_sf0==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の0縮退故障の検出回数更新
						t_net->in[i]->det_sf0++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa0[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
		case EXNOR:
			//-----------------------------------------------------------
			// 出力=1 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//        ))EXNOR>○-- 1             ))EXNOR>○-- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 入力信号線=0 (1縮退故障が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->nval, tp_id)==0 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf1<opt.n_drop && t_net->in[i]->test_sf1==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の1縮退故障の検出回数更新
						t_net->in[i]->det_sf1++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa1[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT0_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 入力信号線=1 (0縮退故障が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->nval, tp_id)==1 ){

					//検出回数がopt.n_drop回以下なら検出回数等を保存
					if(t_net->in[i]->det_sf0<opt.n_drop && t_net->in[i]->test_sf0==YES){
						//FFR内の検出故障数更新
						ffr[ffr_id].n_detect++;
	
						//対象信号線の0縮退故障の検出回数更新
						t_net->in[i]->det_sf0++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_sa0[tp_id], t_net->in[i]->n);
					}

					//入力信号線のさらに入力信号線をCPT
					SAF_3v_CPT1_Ndrop(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
	}

}//END