//------------------------------------------------------------------------
//File name : FPointer_SAF_Justification.c
//Date : 2013/1/27
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/netlist.h"
#include	"../../Lib/bit_tp.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"../Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	dtob								(unsigned int, int);

//限定正当化
void	SAF_XID_jus_and_nand				(NLIST*, int, unsigned int);
void	SAF_XID_jus_or_nor					(NLIST*, int, unsigned int);

//後方含意
void	SAF_0_Backward_Implication			(NLIST*, int);
void	SAF_1_Backward_Implication			(NLIST*, int);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//
//  xid_flag		: ケアビットに固定したフラグ(故障伝搬経路or正当化経路)
//

	//#define	JUS_DEBUG

//------------------------------------------------------------------------
//  静的変数
//------------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : FPointer_SAF_Justification
//  機  能 : 【関数ポインタ作成】SAF用の正当化(限定含意・限定正当化)の関数ポインタ作成
//  戻り値 : なし
//  引  数 : なし
//----------------------------------------------
void	FPointer_SAF_Justification(){

	//======================================================================================
	// 関数ポインタ作成 (限定正当化なので多入力ゲートのみ ※EXORは後方含意するため排除)
	//======================================================================================
	//限定正当化
	func_jus[AND]	= SAF_XID_jus_and_nand;		//ANDとNANDは同じ処理
	func_jus[NAND]	= SAF_XID_jus_and_nand;		//ANDとNANDは同じ処理
	func_jus[OR]	= SAF_XID_jus_or_nor;		//ORとNORは同じ処理
	func_jus[NOR]	= SAF_XID_jus_or_nor;		//ORとNORは同じ処理
}

//******************************************************************************************************
// 関数ポインタさんの中身
//******************************************************************************************************
//★限定正当化★
//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_jus_and_nand
//  機  能 : 【AND・NAND】2値・3値限定正当化
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), xid_flag(現在のケアビット固定フラグ値)
//------------------------------------------------------------------------------------
void	SAF_XID_jus_and_nand(NLIST *t_net, int tp_id, unsigned int xid_flag){

	int				i;
	int				in_id;					//入力信号線の最小レベルの入力ID
	int				in_lev = max_level+1;	//入力信号線のレベル⇒最小レベルに更新
	int				buff_nval;				//正常値の一時取得
		

	//=================================================================
	// 制御値(0)を保持している信号探索
	//=================================================================
	//-----------------------------------
	// 初期テスト集合が2値
	//-----------------------------------
	if(n_before_x == 0){
		for(i=0; i<t_net->n_in; i++){

			//入力[i]の信号線が正常値で制御値0
			if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0){

				//X抽出後値(xid_nval)を確認
				buff_nval = Get_NBit(t_net->in[i]->xid_nval, tp_id);

				//xid_nvalが『0』の場合(他故障で固定済みだった)
				if(buff_nval == 0){
					in_lev = -1;			//正当化しなくてもOKなのでbreak
					break;
				}

				//xid_nvalが『X』の場合
				else if(buff_nval == 3){
					if(in_lev > t_net->in[i]->level){
						in_lev = t_net->in[i]->level;	//一番レベルが低い信号線を更新
						in_id = i;						//入力IDを保存
					}
				}
			}
		}
	}
	
	//-----------------------------------
	// 初期テスト集合が3値
	//-----------------------------------
	else{
		for(i=0; i<t_net->n_in; i++){

			//入力[i]の信号線が正常値で制御値0
			if(Get_NBit(t_net->in[i]->nval, tp_id) == 0){

				//X抽出後値(xid_nval)を確認
				buff_nval = Get_NBit(t_net->in[i]->xid_nval, tp_id);

				//xid_nvalが『0』の場合(他故障で固定済みだった)
				if(buff_nval == 0){
					in_lev = -1;			//正当化しなくてもOKなのでbreak
					break;
				}

				//xid_nvalが『X』の場合
				else if(buff_nval == 3){
					if(in_lev > t_net->in[i]->level){
						in_lev = t_net->in[i]->level;	//一番レベルが低い信号線を更新
						in_id = i;						//入力IDを保存
					}
				}
			}
		}
	}
	
	//=================================================================
	// ケアビット0固定 & 後方含意
	//=================================================================
	if(in_lev != -1){
			
		//---------------------------------------------
		// 0固定
		//---------------------------------------------
		Set_NBit_Zero(t_net->in[in_id]->xid_nval, tp_id);
#ifdef JUS_DEBUG
		printf("【限定正当化】%s : 0固定 xid_flag:%d ed_flag:%d\n", t_net->in[in_id]->name, t_net->in[in_id]->xid_flag, t_net->in[in_id]->flag);
#endif
	
		//---------------------------------------------
		//t_net->in[in_id]信号線がPIの場合ケアビット保持数情報を更新
		//---------------------------------------------
		if(t_net->in[in_id]->type == IN){
			//テストパターンに対するケアビット情報
			tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
			tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

			//PIに対するケアビット情報
			pi_bit[t_net->in[in_id]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
			pi_bit[t_net->in[in_id]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
		}

		//---------------------------------------------
		//後方含意
		//---------------------------------------------
		else{
#ifdef JUS_DEBUG
			printf("後方含意: %s\n", t_net->in[in_id]->name);
#endif
			SAF_0_Backward_Implication(t_net->in[in_id], tp_id);
		}
	}

}


//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_jus_or_nor
//  機  能 : 【OR・NOR】2値・3値限定正当化
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), xid_flag(現在のケアビット固定フラグ値)
//------------------------------------------------------------------------------------
void	SAF_XID_jus_or_nor(NLIST *t_net, int tp_id, unsigned int xid_flag){

	int				i;
	int				in_id;					//入力信号線の最小レベルの入力ID
	int				in_lev = max_level+1;	//入力信号線のレベル⇒最小レベルに更新
	int				buff_nval;				//正常値の一時取得
		

	//================================================
	// 制御値(1)を保持している信号探索
	//================================================
	//-----------------------------------
	// 初期テスト集合が2値
	//-----------------------------------
	if(n_before_x == 0){
		for(i=0; i<t_net->n_in; i++){

			//入力[i]の信号線が正常値で制御値0
			if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 1){

				//X抽出後値(xid_nval)を確認
				buff_nval = Get_NBit(t_net->in[i]->xid_nval, tp_id);

				//xid_nvalが『1』の場合(他故障で固定済みだった)
				if(buff_nval == 1){
					in_lev = -1;			//正当化しなくてもOKなのでbreak
					break;
				}

				//xid_nvalが『X』の場合
				else if(buff_nval == 3){
					if(in_lev > t_net->in[i]->level){
						in_lev = t_net->in[i]->level;	//一番レベルが低い信号線を更新
						in_id = i;						//入力IDを保存
					}
				}
			}
		}
	}
	
	//-----------------------------------
	// 初期テスト集合が3値
	//-----------------------------------
	else{
		for(i=0; i<t_net->n_in; i++){

			//入力[i]の信号線が正常値で制御値1
			if(Get_NBit(t_net->in[i]->nval, tp_id) == 1){

				//X抽出後値(xid_nval)を確認
				buff_nval = Get_NBit(t_net->in[i]->xid_nval, tp_id);

				//xid_nvalが『1』の場合(他故障で固定済みだった)
				if(buff_nval == 1){
					in_lev = -1;			//正当化しなくてもOKなのでbreak
					break;
				}

				//xid_nvalが『X』の場合
				else if(buff_nval == 3){
					if(in_lev > t_net->in[i]->level){
						in_lev = t_net->in[i]->level;	//一番レベルが低い信号線を更新
						in_id = i;						//入力IDを保存
					}
				}
			}
		}
	}
	
	//=================================================================
	// ケアビット1固定 & 後方含意
	//=================================================================
	if(in_lev != -1){
			
		//---------------------------------------------
		// 1固定
		//---------------------------------------------
		Set_NBit_One(t_net->in[in_id]->xid_nval, tp_id);
#ifdef JUS_DEBUG
		printf("【限定正当化】%s : 1固定 xid_flag:%d ed_flag:%d\n", t_net->in[in_id]->name, t_net->in[in_id]->xid_flag, t_net->in[in_id]->flag);
#endif
	
		//---------------------------------------------
		//t_net->in[in_id]信号線がPIの場合ケアビット保持数情報を更新
		//---------------------------------------------
		if(t_net->in[in_id]->type == IN){
			//テストパターンに対するケアビット情報
			tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
			tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

			//PIに対するケアビット情報
			pi_bit[t_net->in[in_id]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
			pi_bit[t_net->in[in_id]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
		}

		
		//---------------------------------------------
		//後方含意
		//---------------------------------------------
		else{
#ifdef JUS_DEBUG
			printf("後方含意: %s\n", t_net->in[in_id]->name);
#endif
			SAF_1_Backward_Implication(t_net->in[in_id], tp_id);
		}
	}

}