//------------------------------------------------------------------------
//File name : SAF_Backward_Implication.c
//Date : 2013/7/30
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/netlist.h"
#include	"../../Lib/bit_tp.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"../Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	SAF_0_Backward_Implication	(NLIST*, int);
void	SAF_1_Backward_Implication	(NLIST*, int);
void	SAF_0_Forward_Implication	(NLIST*, int);
void	SAF_1_Forward_Implication	(NLIST*, int);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//
	//#define		BIMPL_DEBUG
//------------------------------------------------------------------------
//  静的変数
//------------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : SAF_0_Backward_Implication
//  機  能 : t_netの出力値が0からの後方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(後方含意判定信号線の出力信号線), tp_id(テストパターンの何番目か)
//----------------------------------------------
void	SAF_0_Backward_Implication(NLIST* t_net, int tp_id){

	int			i, in;
	char		n_contorolling=0;	//制御値信号線の本数

	switch(t_net->type){
		//********************************************************************
		case FOUT:
			//-----------------------------------------------------------
			// 入力=0に後方含意可能 ← 出力=0
			//-----------------------------------------------------------
			//         ______ 0(t_net)
			//        |
			//   0 ---|
			//        |______ 
			//                X(前方含意発生)

			//X抽出後正常値がX(ドントケア)の場合
			if(Get_NBit(t_net->in[0]->xid_nval, tp_id) == 3){
			
				//------------------------------------------------
				//入力信号線を0固定
				//------------------------------------------------
				Set_NBit_Zero(t_net->in[0]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
				printf("後方含意0固定:%s\n", t_net->in[0]->name);
#endif
				//------------------------------------------------
				//入力信号線がPIの場合ケアビット保持数情報を更新
				//------------------------------------------------
				if(t_net->in[0]->type == IN){
					//テストパターンに対するケアビット情報
					tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
					tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

					//PIに対するケアビット情報
					pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
					pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
				}
				//------------------------------------------------
				//違う場合はさらに後方含意判定
				//------------------------------------------------
				else{
					SAF_0_Backward_Implication(t_net->in[0], tp_id);
				}
				
				//------------------------------------------------
				// ★前方含意★
				//------------------------------------------------
				for(i=0; i<t_net->in[0]->n_out; i++){
					if(Get_NBit(t_net->in[0]->out[i]->xid_nval, tp_id) == 3){
						//入力(STEM)値0からの前方含意
						SAF_0_Forward_Implication(t_net->in[0]->out[i], tp_id);
					}
				}
			}		
		break;
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------
			// 出力=0(入力=0に後方含意可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|BUF >--- 0(t_net)
			//        |  ／
			//        |／

			//X抽出後正常値がX(ドントケア)の場合
			if(Get_NBit(t_net->in[0]->xid_nval, tp_id) == 3){
			
				//------------------------------------------------
				//入力信号線を0固定
				//------------------------------------------------
				Set_NBit_Zero(t_net->in[0]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
				printf("後方含意0固定:%s\n", t_net->in[0]->name);
#endif
				//------------------------------------------------
				//入力信号線がPIの場合ケアビット保持数情報を更新
				//------------------------------------------------
				if(t_net->in[0]->type == IN){
					//テストパターンに対するケアビット情報
					tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
					tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

					//PIに対するケアビット情報
					pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
					pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
				}
				//------------------------------------------------
				//違う場合はさらに後方含意判定
				//------------------------------------------------
				else{
					SAF_0_Backward_Implication(t_net->in[0], tp_id);
				}
			}

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------
			// 出力=0(入力=1に後方含意可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|INV >○-- 0(t_net)
			//        |  ／
			//        |／

			
			//X抽出後正常値がX(ドントケア)の場合
			if(Get_NBit(t_net->in[0]->xid_nval, tp_id) == 3){
			
				//------------------------------------------------
				//入力信号線を1固定
				//------------------------------------------------
				Set_NBit_One(t_net->in[0]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
				printf("後方含意1固定:%s\n", t_net->in[0]->name);
#endif
				//------------------------------------------------
				//入力信号線がPIの場合ケアビット保持数情報を更新
				//------------------------------------------------
				if(t_net->in[0]->type == IN){
					//テストパターンに対するケアビット情報
					tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
					tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

					//PIに対するケアビット情報
					pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
					pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
				}
				//------------------------------------------------
				//違う場合はさらに後方含意判定
				//------------------------------------------------
				else{
					SAF_1_Backward_Implication(t_net->in[0], tp_id);
				}
			}

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------
			// 出力=0(入力の制御値0が1本なら後方含意可能，2本以上なら限定含意操作)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --| AND│--- 0(t_net)
			//   1 --|   ／
			//       ‾‾
			
			//-----------------------------------------------------------
			// 入力信号線の制御値0の本数を計算
			//-----------------------------------------------------------
			//2値
			if(n_before_x == 0){
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:0
					if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}
			//3値
			else{
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:0
					if(Get_NBit(t_net->in[i]->nval, tp_id) == 0 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}

			//-----------------------------------------------------------
			// 制御値が1本→後方含意
			//-----------------------------------------------------------
			if(n_contorolling == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[in]->xid_nval, tp_id) == 3){

					//入力信号線を0固定
					Set_NBit_Zero(t_net->in[in]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定:%s\n", t_net->in[in]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[in]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[in]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_0_Backward_Implication(t_net->in[in], tp_id);
					}
				}

			}
			//-----------------------------------------------------------
			// 制御値が複数本→限定正当化
			//-----------------------------------------------------------
			else{
				//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
				if(t_net->n_in > 0){
					enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
					printf("限定正当化エンキュー: %s (ed_flag:%d xid_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag);
#endif
				}
			}
			
		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------
			// 出力=0(全入力が1に後方含意可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --|NAND│○-- 0(t_net)
			//   1 --|   ／
			//       ‾‾      ※全入力信号線=1 (非制御値)
			
			//-----------------------------------------------------------
			// 全入力を後方含意
			//-----------------------------------------------------------
			for(i=0; i<t_net->n_in; i++){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){

					//入力信号線を1固定
					Set_NBit_One(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定:%s\n", t_net->in[i]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[i]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}

			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------
			// 出力=0(全入力が0に後方含意可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----) OR >--- 0
			//   0 --／   ／
			//       ‾‾      ※全入力信号線=0 (非制御値)

			//-----------------------------------------------------------
			// 全入力を後方含意
			//-----------------------------------------------------------
			for(i=0; i<t_net->n_in; i++){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){

					//入力信号線を0固定
					Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定:%s\n", t_net->in[i]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[i]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------
			// 出力=0(入力の制御値1が1本なら後方含意可能，2本以上なら限定含意操作)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----)NOR >○-- 0
			//   0 --／   ／
			//       ‾‾

			//-----------------------------------------------------------
			// 入力信号線の制御値1の本数を計算
			//-----------------------------------------------------------
			//2値
			if(n_before_x == 0){
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:1
					if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 1 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}
			//3値
			else{
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:1
					if(Get_NBit(t_net->in[i]->nval, tp_id) == 1 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}

			//-----------------------------------------------------------
			// 制御値が1本→後方含意
			//-----------------------------------------------------------
			if(n_contorolling == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[in]->xid_nval, tp_id) == 3){

					//入力信号線を1固定
					Set_NBit_One(t_net->in[in]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定:%s\n", t_net->in[in]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[in]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[in]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_1_Backward_Implication(t_net->in[in], tp_id);
					}
				}

			}
			//-----------------------------------------------------------
			// 制御値が複数本→限定正当化
			//-----------------------------------------------------------
			else{
				//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
				if(t_net->n_in > 0){
					enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
					printf("限定正当化エンキュー: %s (ed_flag:%d xid_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag);
#endif
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//-----------------------------------------------------------
			// 出力=0 (※制御値が無いため2入力とも遡る(後方含意))
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//         ))EXOR>--- 0               ))EXOR>--- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			//-----------------------------------------------------------
			// 出力=1 (※制御値が無いため2入力とも遡る(後方含意))
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//        ))EXNOR>○-- 0             ))EXNOR>○-- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			
			for(i=0; i<t_net->n_in; i++){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){

					//---------------------------------------
					// 2値の場合
					//---------------------------------------
					if(n_before_x == 0){
						//■0固定
						if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0){
							//入力信号線を0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意0固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_0_Backward_Implication(t_net->in[i], tp_id);
							}
						}
						//■1固定
						else{
							//入力信号線を1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意1固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_1_Backward_Implication(t_net->in[i], tp_id);
							}
						}
					}
					
					//---------------------------------------
					// 3値の場合
					//---------------------------------------
					else{
						//■0固定
						if(Get_NBit(t_net->in[i]->nval, tp_id) == 0){
							//入力信号線を0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意0固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_0_Backward_Implication(t_net->in[i], tp_id);
							}
						}
						//■1固定
						else{
							//入力信号線を1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意1固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_1_Backward_Implication(t_net->in[i], tp_id);
							}
						}
					}
				}
			}
		break;
		//********************************************************************
	}
}



//----------------------------------------------
//  関数名 : SAF_1_Backward_Implication
//  機  能 : t_netの入力値が1からの後方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(後方含意判定信号線), tp_id(テストパターンの何番目か)
//----------------------------------------------
void	SAF_1_Backward_Implication(NLIST* t_net, int tp_id){

	int			i, in;
	char		n_contorolling=0;	//制御値信号線の本数

	switch(t_net->type){
		//********************************************************************
		case FOUT:
			//-----------------------------------------------------------
			// 出力=1(入力=1に後方含意可能)
			//-----------------------------------------------------------
			//         ______ 1
			//        |
			//   1 ---|
			//        |______ 
			//                X(前方含意発生)

			//X抽出後正常値がX(ドントケア)の場合
			if(Get_NBit(t_net->in[0]->xid_nval, tp_id) == 3){
			
				//------------------------------------------------
				//入力信号線を1固定
				//------------------------------------------------
				Set_NBit_One(t_net->in[0]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
				printf("後方含意1固定:%s\n", t_net->in[0]->name);
#endif
				//------------------------------------------------
				//入力信号線がPIの場合ケアビット保持数情報を更新
				//------------------------------------------------
				if(t_net->in[0]->type == IN){
					//テストパターンに対するケアビット情報
					tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
					tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

					//PIに対するケアビット情報
					pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
					pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
				}
				//------------------------------------------------
				//違う場合はさらに後方含意判定
				//------------------------------------------------
				else{
					SAF_1_Backward_Implication(t_net->in[0], tp_id);
				}
				
				//------------------------------------------------
				// ★前方含意★
				//------------------------------------------------
				for(i=0; i<t_net->in[0]->n_out; i++){
					if(Get_NBit(t_net->in[0]->out[i]->xid_nval, tp_id) == 3){
						//入力(STEM)値0からの前方含意
						SAF_1_Forward_Implication(t_net->in[0]->out[i], tp_id);
					}
				}
			}		
		break;
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------
			// 出力=1(入力=1に後方含意可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|BUF >--- 1
			//        |  ／
			//        |／

			//X抽出後正常値がX(ドントケア)の場合
			if(Get_NBit(t_net->in[0]->xid_nval, tp_id) == 3){
			
				//------------------------------------------------
				//入力信号線を1固定
				//------------------------------------------------
				Set_NBit_One(t_net->in[0]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
				printf("後方含意1固定:%s\n", t_net->in[0]->name);
#endif
				//------------------------------------------------
				//入力信号線がPIの場合ケアビット保持数情報を更新
				//------------------------------------------------
				if(t_net->in[0]->type == IN){
					//テストパターンに対するケアビット情報
					tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
					tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

					//PIに対するケアビット情報
					pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
					pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
				}
				//------------------------------------------------
				//違う場合はさらに後方含意判定
				//------------------------------------------------
				else{
					SAF_1_Backward_Implication(t_net->in[0], tp_id);
				}
			}

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------
			// 出力=1(入力=0に後方含意可能)
			//-----------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|INV >○-- 1
			//        |  ／
			//        |／

			
			//X抽出後正常値がX(ドントケア)の場合
			if(Get_NBit(t_net->in[0]->xid_nval, tp_id) == 3){
			
				//------------------------------------------------
				//入力信号線を0固定
				//------------------------------------------------
				Set_NBit_Zero(t_net->in[0]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
				printf("後方含意0固定:%s\n", t_net->in[0]->name);
#endif
				//------------------------------------------------
				//入力信号線がPIの場合ケアビット保持数情報を更新
				//------------------------------------------------
				if(t_net->in[0]->type == IN){
					//テストパターンに対するケアビット情報
					tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
					tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

					//PIに対するケアビット情報
					pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
					pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
				}
				//------------------------------------------------
				//違う場合はさらに後方含意判定
				//------------------------------------------------
				else{
					SAF_0_Backward_Implication(t_net->in[0], tp_id);
				}
			}

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------
			// 出力=1(全入力が1に後方含意可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --| AND│--- 1
			//   1 --|   ／
			//       ‾‾
			//-----------------------------------------------------------
			// 全入力を後方含意
			//-----------------------------------------------------------
			for(i=0; i<t_net->n_in; i++){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){

					//入力信号線を1固定
					Set_NBit_One(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定:%s\n", t_net->in[i]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[i]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}

			}
		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------
			// 出力=1(入力の制御値0が1本なら後方含意可能，2本以上なら限定含意操作)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --|NAND│○-- 1
			//   1 --|   ／
			//       ‾‾
			
			//-----------------------------------------------------------
			// 入力信号線の制御値0の本数を計算
			//-----------------------------------------------------------
			//2値
			if(n_before_x == 0){
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:0
					if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}
			//3値
			else{
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:0
					if(Get_NBit(t_net->in[i]->nval, tp_id) == 0 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}

			//-----------------------------------------------------------
			// 制御値が1本→後方含意
			//-----------------------------------------------------------
			if(n_contorolling == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[in]->xid_nval, tp_id) == 3){

					//入力信号線を0固定
					Set_NBit_Zero(t_net->in[in]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定:%s\n", t_net->in[in]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[in]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[in]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_0_Backward_Implication(t_net->in[in], tp_id);
					}
				}

			}
			//-----------------------------------------------------------
			// 制御値が複数本→限定正当化
			//-----------------------------------------------------------
			else{
				//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
				if(t_net->n_in > 0){
					enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
					printf("限定正当化エンキュー: %s (ed_flag:%d xid_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag);
#endif
				}
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------
			// 出力=1(入力の制御値1が1本なら後方含意可能，2本以上なら限定含意操作)
			//-----------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   0 --／   ／
			//       ‾‾   

			//-----------------------------------------------------------
			// 入力信号線の制御値1の本数を計算
			//-----------------------------------------------------------
			//2値
			if(n_before_x == 0){
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:1
					if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 1 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}
			//3値
			else{
				for(i=0; i<t_net->n_in; i++){		
					//入力信号線が制御値:1
					if(Get_NBit(t_net->in[i]->nval, tp_id) == 1 ){
						n_contorolling++;
						in = i;
			
						//入力信号線に制御値が2個以上存在
						if(n_contorolling >= 2){
							break;
						}
					}
				}
			}

			//-----------------------------------------------------------
			// 制御値が1本→後方含意
			//-----------------------------------------------------------
			if(n_contorolling == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[in]->xid_nval, tp_id) == 3){

					//入力信号線を1固定
					Set_NBit_One(t_net->in[in]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定:%s\n", t_net->in[in]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[in]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[in]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_1_Backward_Implication(t_net->in[in], tp_id);
					}
				}

			}
			//-----------------------------------------------------------
			// 制御値が複数本→限定正当化
			//-----------------------------------------------------------
			else{
				//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
				if(t_net->n_in > 0){
					enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
					printf("限定正当化エンキュー: %s (ed_flag:%d xid_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag);
#endif
				}
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------
			// 出力=1(全入力が0に後方含意可能)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----)NOR >○-- 1
			//   0 --／   ／
			//       ‾‾

			//-----------------------------------------------------------
			// 全入力を後方含意
			//-----------------------------------------------------------
			for(i=0; i<t_net->n_in; i++){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){

					//入力信号線を0固定
					Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定:%s\n", t_net->in[i]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[i]->type == IN){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						//さらに入力信号線を後方含意判定
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//-----------------------------------------------------------
			// 出力=1 (※制御値が無いため2入力とも遡る(後方含意))
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//         ))EXOR>--- 1               ))EXOR>--- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			//-----------------------------------------------------------
			// 出力=1 (※制御値が無いため2入力とも遡る(後方含意))
			//-----------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//        ))EXNOR>○-- 1             ))EXNOR>○-- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			
			for(i=0; i<t_net->n_in; i++){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){

					//---------------------------------------
					// 2値の場合
					//---------------------------------------
					if(n_before_x == 0){
						//■0固定
						if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0){
							//入力信号線を0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意0固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_0_Backward_Implication(t_net->in[i], tp_id);
							}
						}
						//■1固定
						else{
							//入力信号線を1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意1固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_1_Backward_Implication(t_net->in[i], tp_id);
							}
						}
					}
					
					//---------------------------------------
					// 3値の場合
					//---------------------------------------
					else{
						//■0固定
						if(Get_NBit(t_net->in[i]->nval, tp_id) == 0){
							//入力信号線を0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意0固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_0_Backward_Implication(t_net->in[i], tp_id);
							}
						}
						//■1固定
						else{
							//入力信号線を1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);
#ifdef BIMPL_DEBUG
							printf("後方含意1固定:%s\n", t_net->in[i]->name);
#endif
							//------------------------------------------------
							//入力信号線がPIの場合ケアビット保持数情報を更新
							//------------------------------------------------
							if(t_net->in[i]->type == IN){
								//テストパターンに対するケアビット情報
								tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
								tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

								//PIに対するケアビット情報
								pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
								pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
							}
							//------------------------------------------------
							//違う場合はさらに後方含意判定
							//------------------------------------------------
							else{
								//さらに入力信号線を後方含意判定
								SAF_1_Backward_Implication(t_net->in[i], tp_id);
							}
						}
					}
				}
			}
		break;
		//********************************************************************
	}
}