//------------------------------------------------------------------------
//File name : SAF_search_influence_corn.c
//Date : 2012/2/18
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/netlist.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"../../Lib/alloc.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
int		comp_n_corn_pi		(const void *,const void *);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define DEBUG
	//#define SORT_DEBUG

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : SAF_search_influence_corn
//  機  能 : 各POの影響範囲内PI数をカウント
//  戻り値 : なし
//  引  数 : なし
//----------------------------------------------
void	SAF_search_influence_corn(){

	int					i,j;
	unsigned int		count=0;			//計算済み信号線フラグ値(1〜2^32まで使用)
	FFR					*t_ffr;				//デキューしたFFRポインタを格納
	
	
	//=================================================
	// フラグ初期化
	//=================================================
	for(i=0; i<n_ffr; i++)ffr[i].flag = 0;


	//=================================================
	// 入力側へコーン探索
	//=================================================
	for(i=0; i<n_po; i++){
		
		//-------------------------------------
		// フラグ値更新
		//-------------------------------------
		count += 2;

		//-------------------------------------
		// 判定対象FFRをエンキュー
		//-------------------------------------
		ffr[i].flag = count;	//対象FFRにフラグ値セット
		enqueue(nl_queue, &ffr[i]);		//エンキュー
		
		//-------------------------------------
		// 再収斂探索
		//-------------------------------------
		while( (t_ffr = (FFR*)dequeue(nl_queue) ) != NULL){

			//デキューしたFFRが保持するPI数を足す
			ffr[i].FoutStem->n_corn_pi += t_ffr->n_pi;

			//デキューしたFFRの入力FFRにフラグ値設定しつつエンキュー
			for(j=0; j<t_ffr->n_in; j++){
				
				if(t_ffr->in[j]->flag != count){	//入力がフラグ未設置の場合
					t_ffr->in[j]->flag = count;		//フラグ設置
					enqueue(nl_queue, t_ffr->in[j]);			//エンキュー
				}
			}
		}

		//-------------------------------------
		// キュー再初期化
		//-------------------------------------
		reset_queue(nl_queue);

	}

#ifdef DEBUG
	printf("\n//------------------------------\n");
	printf("// DEBUG: インフルエンスコーン解析【組合せ回路】\n");
	printf("//------------------------------\n");
	for(i=0; i<n_po; i++){
		printf("%s[ffr:%d] 影響PI:%d\n", ffr[i].FoutStem->name, ffr[i].ffr_id, ffr[i].FoutStem->n_corn_pi);
	}
	printf("\n");
#endif	


	//=================================================
	// コーン探索の結果に基づいてpropa_poをソート
	//=================================================
	//メモリ確保
	sort_propa_po = (XID_PROPA_PO**)malloc(sizeof(XID_PROPA_PO*) * n_po);	//PO数分メモリ確保

	//初期アドレス代入
	for(i=0; i<n_po; i++){
		sort_propa_po[i] = &propa_po[i];			//アドレス代入
		propa_po[i].n_corn_pi = po[i]->n_corn_pi;	//コーン内PI数情報代入
	}

	//n_corn_piの昇順でソート
	qsort((void*)sort_propa_po, n_po, sizeof(XID_PROPA_PO*), comp_n_corn_pi);

	
#ifdef SORT_DEBUG
	printf("\n//------------------------------\n");
	printf("// DEBUG: POソート【組合せ回路】\n");
	printf("//------------------------------\n");
	for(i=0; i<n_po; i++){
		printf("sort_propa_po[%d] n_corn_pi:%d\n", i, sort_propa_po[i]->n_corn_pi);
	}
	printf("\n");
#endif	

	
}

//----------------------------------------------
//  関数名 : comp_n_corn_pi
//  機  能 : qsort用の比較関数
//  戻り値 : 比較結果
//  引  数 : 要素1, 要素2
//----------------------------------------------
int	comp_n_corn_pi(const void  *c0, const void  *c1){
	return( (*((XID_PROPA_PO **)c0))->n_corn_pi - (*((XID_PROPA_PO **)c1))->n_corn_pi );
}