//------------------------------------------------------------------------------------
//File name : TDF_2v_CPT.c
//Date : 2013/9/16
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/netlist.h"
#include	"../../Lib/bit_tp.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"

//---------------------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------------------
void TDF_2v_CPT0(int , unsigned int , S_NLIST *);
void TDF_2v_CPT1(int , unsigned int , S_NLIST *);

//---------------------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------------------
//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

	//#define DEBUG

//------------------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------
//  関数名 : TDF_2v_CPT0
//  機  能 : 2値遷移故障クリティカルパストレーシング
//  戻り値 : なし
//  引  数 : ffr_id(FFR番号), tp_id(テストパターンの何番目か), t_net(CPTを始める信号線[=FFRの先頭])
//------------------------------------------------------------------------------------------------
void	TDF_2v_CPT0(int ffr_id, unsigned int tp_id, S_NLIST *t_net){

	int i;
	int	n_contorolling=0;	//入力の制御値の本数
	int	in;					//t_netのi番目(制御値の場所を格納)

	switch(t_net->type){
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(2時刻目入力=0) && 1時刻目入力=1 (入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|BUF >--- 0
			//        |  ／
			//        |／
			
			//---------------------------
			//1時刻目入力値==1
			//---------------------------
			if(Get_NBit_Xbuf(t_net->in[0]->nval_t1, tp_id) == 1){
				//FFR内の検出故障数更新
				sffr[ffr_id].n_detect++;
	
				//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
				t_net->in[0]->det_stf++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_stf[tp_id], t_net->in[0]->n);
#ifdef DEBUG
				printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[0]->name);
#endif
			}
			
			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_2v_CPT0(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(2時刻目入力=1) && 1時刻目入力=0 (入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|INV >○-- 0
			//        |  ／
			//        |／

			//---------------------------
			//1時刻目入力値==0
			//---------------------------
			if(Get_NBit_Xbuf(t_net->in[0]->nval_t1, tp_id) == 0){
				//FFR内の検出故障数更新
				sffr[ffr_id].n_detect++;
	
				//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
				t_net->in[0]->det_str++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_str[tp_id], t_net->in[0]->n);
#ifdef DEBUG
				printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[0]->name);
#endif
			}
			
			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_2v_CPT1(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(2時刻目入力の『制御値0の本数』を確認)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --| AND│--- 0
			//   1 --|   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){
		
				//2時刻目入力信号線が制御値:0
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==0 ){
					n_contorolling++;
					in = i;
			
					//2時刻目入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
			}

			//-----------------------------------------------------------------------
			// 2時刻目入力信号線の『制御値が1本』&& 『1時刻目入力値=1』なら故障検出可能
			//-----------------------------------------------------------------------
			if(n_contorolling==1){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[in]->nval_t1, tp_id) == 1){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
					t_net->in[in]->det_stf++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_stf[tp_id], t_net->in[in]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[in]->name);
#endif
				}
				
				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_2v_CPT0(ffr_id, tp_id, t_net->in[in]);
			}
			
		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(入力信号線は全て非制御値⇒入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --|NAND│○-- 0
			//   1 --|   ／
			//       ‾‾      ※全入力信号線=1 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 0){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
					t_net->in[i]->det_str++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_str[tp_id], t_net->in[i]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
				}

				//---------------------------
				//さらに2時刻目入力信号線をCPT
				//---------------------------
				TDF_2v_CPT1(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------------------
			// 出力=0(入力信号線は全て非制御値⇒入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----) OR >--- 0
			//   0 --／   ／
			//       ‾‾      ※全入力信号線=0 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 1){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
					t_net->in[i]->det_stf++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_stf[tp_id], t_net->in[i]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
				}

				//---------------------------
				//さらに2時刻目入力信号線をCPT
				//---------------------------
				TDF_2v_CPT0(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------------------
			// 出力=0(入力の『制御値0の本数』を確認)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----)NOR >○-- 0
			//   0 --／   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線が制御値:1
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==1 ){
					n_contorolling++;
					in = i;
			
					//入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
			}

			//-----------------------------------------------------------------------
			// 入力信号線の『制御値が1本』なら故障検出可能
			//-----------------------------------------------------------------------
			if(n_contorolling==1){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[in]->nval_t1, tp_id) == 0){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
					t_net->in[in]->det_str++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_str[tp_id], t_net->in[in]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[in]->name);
#endif
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_2v_CPT1(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case EXOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//         ))EXOR>--- 0               ))EXOR>--- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==0 ){
					
					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==1){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
						t_net->in[i]->det_stf++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_stf[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==1 ){
					
					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==0){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
						t_net->in[i]->det_str++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_str[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
		case EXNOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//        ))EXNOR>○-- 0             ))EXNOR>○-- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==0 ){

					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==1){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
						t_net->in[i]->det_stf++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_stf[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==1 ){

					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==0){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
						t_net->in[i]->det_str++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_str[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}
		break;
		//********************************************************************
	}


}//END

//******************************************************************************
//******************************************************************************
//******************************************************************************
//------------------------------------------------------------------------------------------------
//  関数名 : TDF_2v_CPT1
//  機  能 : 2値遷移故障クリティカルパストレーシング
//  戻り値 : なし
//  引  数 : ffr_id(FFR番号), tp_id(テストパターンの何番目か), t_net(CPTを始める信号線[=FFRの先頭])
//------------------------------------------------------------------------------------------------
void	TDF_2v_CPT1(int ffr_id, unsigned int tp_id, S_NLIST *t_net){

	int i;
	int	n_contorolling=0;	//入力の制御値の本数
	int	in;					//t_netのi番目(制御値の場所を格納)

	switch(t_net->type){
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1(2時刻目入力=1) && 1時刻目入力=0 (入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|BUF >--- 1
			//        |  ／
			//        |／

			//---------------------------
			//1時刻目入力値==0
			//---------------------------
			if(Get_NBit_Xbuf(t_net->in[0]->nval_t1, tp_id) == 0){
				//FFR内の検出故障数更新
				sffr[ffr_id].n_detect++;
	
				//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
				t_net->in[0]->det_str++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_str[tp_id], t_net->in[0]->n);
#ifdef DEBUG
				printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[0]->name);
#endif
			}

			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_2v_CPT1(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1(2時刻目入力=0) && 1時刻目入力=1 (入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|INV >○-- 1
			//        |  ／
			//        |／

			//---------------------------
			//1時刻目入力値==1
			//---------------------------
			if(Get_NBit_Xbuf(t_net->in[0]->nval_t1, tp_id) == 1){
				//FFR内の検出故障数更新
				sffr[ffr_id].n_detect++;
	
				//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
				t_net->in[0]->det_stf++;

				//故障辞書にフラグ立て
				Set_NINT_One(fdic_stf[tp_id], t_net->in[0]->n);
#ifdef DEBUG
				printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[0]->name);
#endif
			}

			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_2v_CPT0(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1(入力信号線は全て非制御値⇒入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --| AND│--- 1
			//   1 --|   ／
			//       ‾‾      ※全入力信号線=1 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 0){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
					t_net->in[i]->det_str++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_str[tp_id], t_net->in[i]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
				}

				//---------------------------
				//さらに2時刻目入力信号線をCPT
				//---------------------------
				TDF_2v_CPT1(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1(入力の『制御値0の本数』を確認)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --|NAND│○-- 1
			//   1 --|   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){
		
				//2時刻目入力信号線が制御値:0
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==0 ){
					n_contorolling++;
					in = i;
			
					//2時刻目入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
			}

			//-----------------------------------------------------------------------
			// 2時刻目入力信号線の『制御値が1本』&& 『1時刻目入力値=1』なら故障検出可能
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --|NAND│○-- 1
			//   1 --|   ／
			//       ‾‾
			if(n_contorolling==1){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[in]->nval_t1, tp_id) == 1){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
					t_net->in[in]->det_stf++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_stf[tp_id], t_net->in[in]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[in]->name);
#endif
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_2v_CPT0(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(2時刻目入力の『制御値0の本数』を確認)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   0 --／   ／
			//       ‾‾

			for(i=0; i<t_net->n_in; i++){
		
				//2時刻目入力信号線が制御値:1
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==1 ){
					n_contorolling++;
					in = i;
			
					//2時刻目入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
			}

			//-----------------------------------------------------------------------
			// 2時刻目入力信号線の『制御値が1本』&& 『1時刻目入力値=0』なら故障検出可能
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   0 --／   ／
			//       ‾‾
			if(n_contorolling==1){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[in]->nval_t1, tp_id) == 0){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
					t_net->in[in]->det_str++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_str[tp_id], t_net->in[in]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[in]->name);
#endif
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_2v_CPT1(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(入力信号線は全て非制御値⇒入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----)NOR >○-- 1
			//   0 --／   ／
			//       ‾‾      ※全入力信号線=0 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 1){
					//FFR内の検出故障数更新
					sffr[ffr_id].n_detect++;
	
					//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
					t_net->in[i]->det_stf++;

					//故障辞書にフラグ立て
					Set_NINT_One(fdic_stf[tp_id], t_net->in[i]->n);
#ifdef DEBUG
					printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_2v_CPT0(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case EXOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//         ))EXOR>--- 1               ))EXOR>--- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==0 ){

					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==1){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
						t_net->in[i]->det_stf++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_stf[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==1 ){

					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==0){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
						t_net->in[i]->det_str++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_str[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
		case EXNOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//        ))EXNOR>○-- 1             ))EXNOR>○-- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==0 ){

					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==1){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立下り遷移故障(1→0/1)の検出回数更新
						t_net->in[i]->det_stf++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_stf[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id)==1 ){

					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id)==0){
						//FFR内の検出故障数更新
						sffr[ffr_id].n_detect++;
	
						//対象信号線の立上り遷移故障(0→1/0)の検出回数更新
						t_net->in[i]->det_str++;

						//故障辞書にフラグ立て
						Set_NINT_One(fdic_str[tp_id], t_net->in[i]->n);
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_2v_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
	}

}//END
