//------------------------------------------------------------------------
//File name : count_xbit_rate.c
//Date : 2013/7/05
//Designer : H.Yamazaki
//Ver : 0.01
//
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<time.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

#define	DEBUG

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：count_xbit_rate
//機能　：X抽出率の計算
//引数　：なし
//戻り値：なし
//--------------------------------------------------------------------
void count_xbit_rate(){

	int			i,j;

	//==================================================
	// 縮退故障の場合
	//==================================================
	if(opt.fmodel == SAF){
		for(i=0; i<n_tp; i++){
			n_after_x += (n_pi - tp_bit[i].n_cbit);		//外部入力数 - テストパターン[i]のケアビット数
		}
	}

	//==================================================
	// 遷移故障の場合
	//==================================================
	else if(opt.fmodel == TDF){
		for(i=0; i<n_tp; i++){
			//n_after_x += ((n_spi+n_ppi) - tp_bit[i].n_cbit);	//(PI+PPI) - テストパターン[i]のケアビット数
				
			//PIのX数
			for(j=0; j<n_spi; j++){
				if(Get_NBit(spi[j]->xid_nval_t1, i)==3){
					n_after_x++;
				}
			}
				
			//PPIのX数
			for(j=0; j<n_ppi; j++){
				if(Get_NBit(ppi[j]->xid_nval_t1, i)==3){
					n_after_x++;
				}
			}
		}
	}
}