//------------------------------------------------------------------------
//File name : file_outpuf_miss_log.c
//Date : 2013/7/25
//Designer : H.Yamazaki
//Ver : 0.01
//
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

#define	DEBUG

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：file_output_miss_log
//機能　：見逃し故障ログファイル出力
//引数　：fp(出力ファイルポインタ)
//戻り値：なし
//--------------------------------------------------------------------
void file_output_miss_log(FILE* fp){

	int		i,j;
	int		count;		//各パターンで本来検出できた見逃し故障数

	fprintf(fp, "//=================================================\n");
	fprintf(fp, "// 各テストパターンごとの見逃し故障数\n");
	fprintf(fp, "//=================================================\n");

	//======================================================
	// 縮退故障モデル
	//======================================================
	if(opt.fmodel == SAF){

		for(i=0; i<n_tp; i++){

			//カウンタ初期化
			count = 0;

			for(j=0; j<n_net; j++){
				//----------------------------------------
				// 0縮退故障
				//----------------------------------------
				if(Get_NBit_INT(fdic_sa0[i], j)==1 && nl[j].test_sf0==YES && nl[j].det_sf0>0 && nl[j].xid_det_sf0==0){
					count++;
				}

				//----------------------------------------
				// 1縮退故障
				//----------------------------------------
				else if(Get_NBit_INT(fdic_sa1[i], j)==1 && nl[j].test_sf1==YES && nl[j].det_sf1>0 && nl[j].xid_det_sf1==0){
					count++;
				}
			}

			//見逃し故障数出力
			if(count > 0){
				fprintf(fp, "tp\t%d\t見逃し故障数\t%d\n",i, count);
			}
		}
	}
	
	//======================================================
	// 遷移故障モデル
	//======================================================
	else if(opt.fmodel == TDF){
	}
}