//------------------------------------------------------------------------
//File name : file_output_expectation_value.c
//Date : 2013/9/17
//Designer : H.Yamazaki
//Ver : 0.01
//
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<time.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

#define	DEBUG

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：file_output_expectation_value
//機能　：論理シミュレーションの出力期待値をファイル出力
//引数　：fp(出力ファイルポインタ)
//戻り値：なし
//--------------------------------------------------------------------
void file_output_expectation_value(FILE* fp){

	int					i;
	int					j;

	//===========================================================
	// 【縮退故障】組合せ回路の場合 (POを出力)
	//===========================================================
	if(opt.fmodel == SAF){

		for(i=0; i<n_tp; i++){
			for(j=0; j<n_po; j++){
				//-----------------------------
				//2値の場合
				//-----------------------------
				if(n_before_x == 0){
					if(Get_NBit_Xbuf(po[j]->nval, i) == 0){
						//fprintf(fp, "L");
						fprintf(fp, "0");
					}
					else if(Get_NBit_Xbuf(po[j]->nval, i) == 1){
						//fprintf(fp, "H");
						fprintf(fp, "1");
					}
				}
				//-----------------------------
				//3値の場合
				//-----------------------------
				else{
					if(Get_NBit(po[j]->nval, i) == 0){
						fprintf(fp, "L");
					}
					else if(Get_NBit(po[j]->nval, i) == 1){
						fprintf(fp, "H");
					}
					else if(Get_NBit(po[j]->nval, i) == 3){
						fprintf(fp, "N");
					}
				}
			}
			fprintf(fp, "\n");
		}
	}

	
	//===========================================================
	// 【遷移故障】順序回路の場合 (※2時刻目PPOのみ出力)
	//===========================================================
	else if(opt.fmodel == TDF){

		for(i=0; i<n_tp; i++){
			for(j=0; j<n_ppi; j++){
				//-----------------------------
				//2値の場合
				//-----------------------------
				if(n_before_x == 0){
					if(Get_NBit_Xbuf(s_nl[ppi_tp[j].nl_id].in[0]->nval_t2, i) == 0){
						fprintf(fp, "L");
					}
					else if(Get_NBit_Xbuf(s_nl[ppi_tp[j].nl_id].in[0]->nval_t2, i) == 1){
						fprintf(fp, "H");
					}
				}
				//-----------------------------
				//3値の場合
				//-----------------------------
				else{
					if(Get_NBit(s_nl[ppi_tp[j].nl_id].in[0]->nval_t2, i) == 0){
						fprintf(fp, "L");
					}
					else if(Get_NBit(s_nl[ppi_tp[j].nl_id].in[0]->nval_t2, i) == 1){
						fprintf(fp, "H");
					}
					else if(Get_NBit(s_nl[ppi_tp[j].nl_id].in[0]->nval_t2, i) == 3){
						fprintf(fp, "N");
					}
				}
			}
			fprintf(fp, "\n");
		}
	}
}

//--------------------------------------------------------------------
//関数名：file_output_po_pin
//機能　：(P)POのPIN情報をファイル出力
//引数　：fp(出力ファイルポインタ)
//戻り値：なし
//--------------------------------------------------------------------
void file_output_po_pin(FILE* fp){

	int					j;

	//===========================================================
	// 【縮退故障】組合せ回路の場合 (POを出力)
	//===========================================================
	if(opt.fmodel == SAF){
		for(j=0; j<n_po; j++)fprintf(fp, "%s\n", po[j]->name);
	}

	
	//===========================================================
	// 【遷移故障】順序回路の場合 (※2時刻目PPOのみ出力)
	//===========================================================
	else if(opt.fmodel == TDF){
		for(j=0; j<n_ppi; j++)fprintf(fp, "%s\n", s_nl[ppi_tp[j].nl_id].in[0]->name);
	}
}