//------------------------------------------------------------------------
//File name : TDF_2v_distributution_FSIM.c
//Date : 2014/1/04
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../../Netlist/s_netlist.h"
#include	"../../../Lib/bit_tp.h"
#include	"../../../Lib/bit_int.h"
#include	"../../../StandardHead.h"
#include	"../../../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	TDF_EDpush			(S_NLIST*, unsigned int);

void	TDF_2v_dis_ED_fout	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_buf	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_inv	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_and	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_nand	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_or	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_nor	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_exor	(S_NLIST*, unsigned int);
void	TDF_2v_dis_ED_exnor	(S_NLIST*, unsigned int);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define ED_DEBUG

//---------------------------------------------------------------------
// 静的変数
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : Make_FP_TDF_2v_dis_ED_PPSFP
//  機  能 : 【関数ポインタ作成】STEMからの2値遷移故障PPSFPイベントドリブン
//  戻り値 : なし
//  引  数 : なし
//----------------------------------------------
void Make_FP_TDF_2v_dis_ED_PPSFP(){

	//=========================================================
	// 関数ポインタ作成
	//=========================================================
	sfunc_dis_ppsfp[FOUT]	= TDF_2v_dis_ED_fout;
	sfunc_dis_ppsfp[BUF]	= TDF_2v_dis_ED_buf;
	sfunc_dis_ppsfp[INV]	= TDF_2v_dis_ED_inv;
	sfunc_dis_ppsfp[AND]	= TDF_2v_dis_ED_and;
	sfunc_dis_ppsfp[NAND]	= TDF_2v_dis_ED_nand;
	sfunc_dis_ppsfp[OR]		= TDF_2v_dis_ED_or;
	sfunc_dis_ppsfp[NOR]	= TDF_2v_dis_ED_nor;
	sfunc_dis_ppsfp[EXOR]	= TDF_2v_dis_ED_exor;
	sfunc_dis_ppsfp[EXNOR]	= TDF_2v_dis_ED_exnor;
}

//----------------------------------------------
//  関数名 : TDF_2v_distribution_ppsfp
//  機  能 : STEMからの2値遷移故障PPSFPイベントドリブン
//  戻り値 : なし
//  引  数 : tp_id(テストパターン番号配列), tp_count(テストパターン数), fnet(故障信号線), ed_flag(計算済みフラグ値)
//----------------------------------------------
void	TDF_2v_distribution_ppsfp(int *tp_id, int tp_count, SXID_LIST* fnet, unsigned int ed_flag){

	int				i;
	int				level_flag=0;		//event_lev更新時にbreakしないようにする
	int				event_lev;			//イベント計算するレベル(※計算しながら更新)
	S_NLIST			*temp_net;			//レベライズスタックから取り出した信号線を一時的に格納
//	unsigned int	det_tp_list=0;		//PPOまで故障伝搬したTPリスト【0:未伝搬 1:伝搬(=故障検出)】	//未使用のため削除
	unsigned int	exor_ppo;			//正常値と故障値のEXOR結果(故障伝搬テストパターンは1が立つ)
	
	//=========================================================
	// 故障信号線の初期化
	//=========================================================
	//故障フラグの設定
	fnet->net->flag = ed_flag;
	
	//故障値設定
	fnet->net->x_fault = fnet->net->dis_nval_t2->p_buf[0];		//x_faulにp_bufを代入(反転)
	fnet->net->p_fault = fnet->net->dis_nval_t2->x_buf[0];		//p_faulにx_bufを代入(反転)


	//=========================================================
	// 故障信号線の次イベントをレベライズスタックへプッシュ
	//=========================================================
	TDF_EDpush(fnet->net, ed_flag);


	//=========================================================
	// イベントドリブン開始レベル決定
	//=========================================================
	event_lev = fnet->net->out[0]->level;

	for(i=1; i<fnet->net->n_out; i++){
		if(event_lev > fnet->net->out[i]->level){
			event_lev = fnet->net->out[i]->level;	//低いレベルがあったら更新
		}
	}

	//=========================================================
	// イベントドリブン実行(全経路を保証するようにFSIM)
	//=========================================================
	while(1){

		//-------------------------------------------
		// レベライズスタックから信号線を取り出す
		//-------------------------------------------
		temp_net = slev_temp[event_lev].net[slev_temp[event_lev].n_net-1];	//ケツから取り出す
		
		//-------------------------------------------
		// 計算済みフラグを代入
		//-------------------------------------------
		temp_net->flag = ed_flag;

		//-------------------------------------------
		// temp_netの故障値計算
		//-------------------------------------------
		(*sfunc_dis_ppsfp[temp_net->type])(temp_net, ed_flag);
		
		//-------------------------------------------
		// 2時刻目正常値≠故障値 (故障値伝搬)
		//-------------------------------------------
		if(temp_net->dis_nval_t2->x_buf[0] != temp_net->x_fault){
			
			//--------------------------------------------------------------------
			//temp_netが疑似外部出力(PPO)の場合
			//--------------------------------------------------------------------
			if(temp_net->ppo_flag == YES){
				
				//現在レベルのレベライズスタックの保持信号線数をデクリメント
				slev_temp[event_lev].n_net--;
				
				//故障伝搬テストパターンのチェック(正常値と故障値のEXOR演算)
				exor_ppo = temp_net->dis_nval_t2->x_buf[0] ^ temp_net->x_fault;

				//対象PPOで検出したテストパターンをチェック(※通常は故障なので注意)
				for(i=0; i<tp_count; i++){
					if( (exor_ppo & MASKbit[i])!=0 ){							//対象bitに1が立ってる(正常値0,故障値1)
						Set_NINT_One(propa_po[temp_net->ppo_id].det_flag, i);	//対象PPOで故障のi番目が検出可能
						propa_po[temp_net->ppo_id].n_det++;						//対象PPOで検出可能な故障数を更新
					}
				}
			}
			
			//--------------------------------------------------------------------
			//内部信号線の場合は出力信号線をレベライズスタックへプッシュ
			//--------------------------------------------------------------------
			else{
				TDF_EDpush(temp_net, ed_flag);		//temp_netの出力をプッシュ
				slev_temp[event_lev].n_net--;		//現在レベルのレベライズスタックの保持信号線数をデクリメント
			}
		}

		//-------------------------------------------
		// temp_netの故障値消滅⇒出力代表信号線はプッシュしない
		//-------------------------------------------
		else{
			slev_temp[event_lev].n_net--;	//現在レベルのレベライズスタックの保持信号線数をデクリメント
		}
		
		//-------------------------------------------
		// event_levを更新(現event_levのスタック内信号線保持数が0になったとき)
		//-------------------------------------------
		if(slev_temp[event_lev].n_net == 0){

			//レベライズスタック内を探索
			for(i=event_lev+1; i<=max_level; i++){
				//保持信号線数≠0のレベルスタック発見
				if(slev_temp[i].n_net != 0){
					event_lev = i;		//event_lev更新
					level_flag++;		//break阻止
					break;
				}
			}

			//レベライズスタックの中身が全部空だった
			if(level_flag == 0){
				break;	//イベントドリブン終了
			}

			//次のevent_lev更新時に備えてlevel_flagを初期化
			level_flag = 0;

		}

	}//while


}

//******************************************************************************************************
// 関数ポインタさんの中身
//******************************************************************************************************
//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_fout
//  機  能 : 【FOUT】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_fout(S_NLIST *t_net, unsigned int ed_flag){

	//================================================
	//そのまま引き継ぎ
	//================================================
	t_net->x_fault = t_net->in[0]->x_fault;

}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_buf
//  機  能 : 【BUF】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_buf(S_NLIST *t_net, unsigned int ed_flag){
	
	//================================================
	//そのまま引き継ぎ
	//================================================
	t_net->x_fault = t_net->in[0]->x_fault;
	
}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_inv
//  機  能 : 【INV】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_inv(S_NLIST *t_net, unsigned int ed_flag){
	
	//================================================
	//反転処理
	//================================================
	t_net->x_fault = ~t_net->in[0]->x_fault;

}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_and
//  機  能 : 【AND】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_and(S_NLIST *t_net, unsigned int ed_flag){

	int				i;
	
	//================================================
	//入力の0番目の影響信号線値代入
	//================================================
	//-----------------------------------
	//入力が計算済み ⇒ 故障値を代入
	//-----------------------------------
	if(t_net->in[0]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault;
	}
	//-----------------------------------
	//正常値を代入
	//-----------------------------------
	else{
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0];
	}
	
	//================================================
	//残りの入力の影響信号線値計算
	//================================================
	for(i=1; i<t_net->n_in; i++){
		
		//-----------------------------------
		//入力が計算済み ⇒ 故障値で計算
		//-----------------------------------
		if(t_net->in[i]->flag == ed_flag){
			t_net->x_fault &= t_net->in[i]->x_fault;
		}

		//-----------------------------------
		//正常値で計算
		//-----------------------------------
		else{
			t_net->x_fault &= t_net->in[i]->dis_nval_t2->x_buf[0];
		}
	}
	
}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_nand
//  機  能 : 【NAND】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_nand(S_NLIST *t_net, unsigned int ed_flag){

	int				i;
	
	//================================================
	//入力の0番目の影響信号線値代入
	//================================================
	//-----------------------------------
	//入力が計算済み ⇒ 故障値を代入
	//-----------------------------------
	if(t_net->in[0]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault;
	}
	//-----------------------------------
	//正常値を代入
	//-----------------------------------
	else{
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0];
	}
	
	//================================================
	//残りの入力の影響信号線値計算
	//================================================
	for(i=1; i<t_net->n_in; i++){
		
		//-----------------------------------
		//入力が計算済み ⇒ 故障値で計算
		//-----------------------------------
		if(t_net->in[i]->flag == ed_flag){
			t_net->x_fault &= t_net->in[i]->x_fault;
		}
		
		//-----------------------------------
		//正常値で計算
		//-----------------------------------
		else{
			t_net->x_fault &= t_net->in[i]->dis_nval_t2->x_buf[0];
		}
	}
	
	//================================================
	//出力結果を反転
	//================================================
	t_net->x_fault = ~t_net->x_fault;

}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_or
//  機  能 : 【OR】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_or(S_NLIST *t_net, unsigned int ed_flag){

	int				i;
	
	//================================================
	//入力の0番目の影響信号線値代入
	//================================================
	//-----------------------------------
	//入力が計算済み ⇒ 故障値を代入
	//-----------------------------------
	if(t_net->in[0]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault;
	}
	//-----------------------------------
	//正常値を代入
	//-----------------------------------
	else{
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0];
	}
	
	//================================================
	//残りの入力の影響信号線値計算
	//================================================
	for(i=1; i<t_net->n_in; i++){
		
		//-----------------------------------
		//入力が計算済み ⇒ 故障値で計算
		//-----------------------------------
		if(t_net->in[i]->flag == ed_flag){
			t_net->x_fault |= t_net->in[i]->x_fault;
		}
		
		//-----------------------------------
		//正常値で計算
		//-----------------------------------
		else{
			t_net->x_fault |= t_net->in[i]->dis_nval_t2->x_buf[0];
		}
	}
}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_nor
//  機  能 : 【NOR】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_nor(S_NLIST *t_net, unsigned int ed_flag){

	int				i;

	//================================================
	//入力の0番目の影響信号線値代入
	//================================================
	//-----------------------------------
	//入力が計算済み ⇒ 故障値を代入
	//-----------------------------------
	if(t_net->in[0]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault;
	}
	//-----------------------------------
	//正常値を代入
	//-----------------------------------
	else{
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0];
	}
	
	//================================================
	//残りの入力の影響信号線値計算
	//================================================
	for(i=1; i<t_net->n_in; i++){
		
		//-----------------------------------
		//入力が計算済み ⇒ 故障値で計算
		//-----------------------------------
		if(t_net->in[i]->flag == ed_flag){
			t_net->x_fault |= t_net->in[i]->x_fault;
		}
		
		//-----------------------------------
		//正常値で計算
		//-----------------------------------
		else{
			t_net->x_fault |= t_net->in[i]->dis_nval_t2->x_buf[0];
		}
	}

	//================================================
	//出力結果を反転
	//================================================
	t_net->x_fault = ~t_net->x_fault;
}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_exor
//  機  能 : 【EXOR】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//※2入力のみ対応
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_exor(S_NLIST *t_net, unsigned int ed_flag){

	
	//------------------------------------------------
	// 2入力とも計算済み⇒両方故障値で計算
	//------------------------------------------------
	if(t_net->in[0]->flag==ed_flag && t_net->in[1]->flag==ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault ^ t_net->in[1]->x_fault;
	}
	//------------------------------------------------
	// 0番目入力のみ計算済み(0番目入力のみ故障値で計算)
	//------------------------------------------------
	else if(t_net->in[0]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault ^ t_net->in[1]->dis_nval_t2->x_buf[0];
	}
	
	//------------------------------------------------
	// 1番目入力のみ計算済み(1番目入力のみ故障値で計算)
	//------------------------------------------------
	else if(t_net->in[1]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0] ^ t_net->in[1]->x_fault;
	}
	
	//------------------------------------------------
	// 2入力とも正常値計算
	//------------------------------------------------
	else{
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0] ^ t_net->in[1]->dis_nval_t2->x_buf[0];
	}

}

//------------------------------------------------------------------------------------
//  関数名 : TDF_2v_dis_ED_exnor
//  機  能 : 【EXNOR】2値縮退故障イベントドリブン(故障値計算)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), ed_flag(現在のイベントフラグ値)
//※2入力のみ対応
//------------------------------------------------------------------------------------
void	TDF_2v_dis_ED_exnor(S_NLIST *t_net, unsigned int ed_flag){
	
	//------------------------------------------------
	// 2入力とも計算済み⇒両方故障値で計算
	//------------------------------------------------
	if(t_net->in[0]->flag==ed_flag && t_net->in[1]->flag==ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault ^ t_net->in[1]->x_fault;
	}
	//------------------------------------------------
	// 0番目入力のみ計算済み(0番目入力のみ故障値で計算)
	//------------------------------------------------
	else if(t_net->in[0]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->x_fault ^ t_net->in[1]->dis_nval_t2->x_buf[0];
	}
	
	//------------------------------------------------
	// 1番目入力のみ計算済み(1番目入力のみ故障値で計算)
	//------------------------------------------------
	else if(t_net->in[1]->flag == ed_flag){
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0] ^ t_net->in[1]->x_fault;
	}
	
	//------------------------------------------------
	// 2入力とも正常値計算
	//------------------------------------------------
	else{
		t_net->x_fault = t_net->in[0]->dis_nval_t2->x_buf[0] ^ t_net->in[1]->dis_nval_t2->x_buf[0];
	}
	
	//================================================
	//出力結果を反転
	//================================================
	t_net->x_fault = ~t_net->x_fault;

}
