//------------------------------------------------------------------------
//File name : sort_legal_state_tp.c
//Date : 2014/2/3
//Designer : H.Yamazaki
//Ver : 0.01
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"./rtl_state.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

	#define		DEBUG

#define		LEGAL_STATE		11	//有効状態
#define		ILLEGAL_STATE	22	//無効状態
//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：sort_legal_state_tp
//機能　：RTLの有効状態情報からテストパターンを有効状態と無効状態に分類
//引数　：st(有効状態ファイル), pin(有効状態ファイルのPINファイル), fname(ファイル名ポインタ)
//戻り値：なし
//--------------------------------------------------------------------
void sort_legal_state_tp(FILE *st, FILE *pin, char **fname){

	int				i,j,k;
	char			*str;			//strtok用
	char			temp[MAXN];		//fgets用
	FILE			*fp;			//出力用ファイルポインタ
	char			name[1000];		//出力ファイル名
	int				*tp_flag;		//各テストパターンの有効状態・無効状態フラグ
	int				get_temp;		//fgetc用変数
	unsigned int	nbit;			//格納先テストパターンビット
	int				nval;			//テストパターンの値
	int				rtl_val;		//RTLの値

	//====================================================================
	// 初期化
	//====================================================================
	n_state = 0;			//有効状態数初期化	
	n_illegal_tp = 0;			//有効状態テストパターン数初期化


	//テストパターンフラグ配列のメモリ確保
	tp_flag = (int*)malloc(sizeof(int) * n_tp);
	for(i=0; i<n_tp; i++)tp_flag[i] = ILLEGAL_STATE;		//全て無効状態で初期化

	//====================================================================
	// 有効状態数カウント
	//====================================================================
	while(fgets(temp,MAXN,st)!=NULL)n_state++;

	//ファイルポインタを先頭に戻す
	rewind(st);
	

	//====================================================================
	// 有効状態構造体のメモリ確保
	//====================================================================
	reg = (REGISTER*)malloc(sizeof(REGISTER) * n_ppi);
	
	for(i=0; i<n_ppi; i++){
		reg[i].id = i;
		reg[i].state = Alloc_Bit_TP(n_state);
	}


	//====================================================================
	// 有効状態PINファイル読み込み
	//====================================================================
	//カウンタ初期化
	i = 0;

	//ファイル読み込み
	while(fgets(temp,MAXN,pin)!=NULL){

		//改行削除
		str = strtok(temp, " \n");

		//レジスタ構造体配列にPIN名保存
		reg[i].name = (char*)malloc(sizeof(char) * strlen(str) );
		strcpy(reg[i].name, str);
#ifdef DEBUG
		printf("reg[%d]: %s\n", i, reg[i].name);
#endif

		//配列番号更新
		i++;
	}

	//ネットリストとポインタ接続
	for(i=0; i<n_ppi; i++){
		for(j=0; j<n_ppi; j++){
			if(strcmp(reg[i].name, ppi[j]->name) == 0){
				reg[i].ptr = ppi[j];		//ポインタ接続
#ifdef DEBUG
				printf("reg[%d] (%s):ポインタ接続完了\n", i, reg[i].name);
#endif
			}
		}
	}
	
	
	//====================================================================
	// RTL有効状態パターンの読み込み
	//====================================================================
	
	//全部格納したら終了
	for(i=0, nbit=0; (get_temp = fgetc(st)) != EOF; i++){

		//-----------------//
		//   改行の場合    //
		//-----------------//
		if(get_temp == '\n'){
#ifdef DEBUG
			printf("\n");
#endif
			i=-1;		//PI番号初期化
			nbit++;		//次のビット目へ
			continue;
		}

		//-----------------//
		//   0,1,Xの場合   //
		//-----------------//
		switch(get_temp){
			//----------------------------------------
			case '0':
#ifdef DEBUG
				printf("0");
#endif
				Set_NBit_Zero(reg[i].state, nbit);
				break;
			//----------------------------------------
			case '1':
#ifdef DEBUG
				printf("1");
#endif
				Set_NBit_One(reg[i].state, nbit);
				break;
			//----------------------------------------
			case 'X':
#ifdef DEBUG
				printf("X");
#endif
				Set_NBit_X(reg[i].state, nbit);
				break;
			//----------------------------------------
			default:
				printf("Read Test Pattern ERROR\n");
				exit(-1);
			//----------------------------------------
		}
	}

	
	//====================================================================
	// 有効状態・無効状態テストパターン判定
	//====================================================================
	//2値の場合
	if(n_before_x == 0){
		for(i=0; i<n_tp; i++){
			for(k=0; k<n_state; k++){
				for(j=0; j<n_ppi; j++){
					//RTL値とテストパターン値を取得
					rtl_val = Get_NBit(reg[j].state, k);
					nval = Get_NBit_Xbuf(reg[j].ptr->nval_t1, i);

					//比較
					if(rtl_val !=  nval){
						break;			//このパターンと一致しなかった
					}
				}
			}

			//全ての状態が同じ⇒i番目パターンで有効状態と判明
			if(k == n_state){
				tp_flag[i] = LEGAL_STATE;		//有効状態に変更
				n_illegal_tp++;					//有効状態テストパターン数更新
			}
		}
	}

	//3値の場合
	else{
		for(i=0; i<n_tp; i++){
			for(j=0; j<n_ppi; j++){
				
				//RTL値とテストパターン値を取得
				rtl_val = Get_NBit(reg[j].state, i);
				nval = Get_NBit(reg[j].ptr->nval_t1, i);

				//比較
				if(rtl_val !=  nval){
					break;			//このパターンと一致しなかった
				}
			}

			//全てのPINが同じ値⇒i番目パターンで有効状態と判明
			if(j == n_ppi){
				tp_flag[i] = LEGAL_STATE;		//有効状態に変更
				n_illegal_tp++;					//有効状態テストパターン数更新
			}
		}
	}


	//====================================================================
	// 有効状態パターンをファイル出力
	//====================================================================
	//ファイル名作成
	strcpy(name, "legal_");
	strcat(name, smodule_name);
	strcat(name, ".txt");

	//ファイルオープン
	fp = fopen(name, "w");

	//ファイル出力
	for(i=0; i<n_tp; i++){
		//有効状態
		if(tp_flag[i] == LEGAL_STATE){
			
			//=================================================
			// txt形式ファイルで入力の場合
			//=================================================
			if(opt.tp_txt == YES){
		
				//----------------------------------
				// PIN順序テーブルに従っての1時刻目値を出力
				//----------------------------------
				for(j=0; j<(n_spi+n_ppi); j++){

					//X抽出後の値を得る
					nval = Get_NBit(pin_tbl[j]->sinput->nval_t1, i);

					//0出力
					if(nval == 0){
						fprintf(fp, "0");
					}

					//1出力
					else if(nval == 1){
						fprintf(fp, "1");
					}

					//X出力
					else if(nval == 3){
						fprintf(fp, "X");
					}
				}
			}

			//=================================================
			// STIL形式ファイルで入力の場合
			//=================================================
			if(opt.tp_stil == YES){
		
				//----------------------------------
				//PI出力
				//----------------------------------
				for(j=0; j<n_spi; j++){
					//X抽出後の値を得る
					nval = Get_NBit(spi[j]->nval_t1, i);
				
					//0出力
					if(nval == 0){
						fprintf(fp, "0");
					}

					//1出力
					else if(nval == 1){
						fprintf(fp, "1");
					}

					//X出力
					else if(nval == 3){
						fprintf(fp, "X");
					}
				}
			
				//----------------------------------
				//PPI出力
				//----------------------------------
				for(j=0; j<n_ppi; j++){
					//X抽出後の値を得る
					nval = Get_NBit(ppi[j]->nval_t1, i);

					//0出力
					if(nval == 0){
						fprintf(fp, "0");
					}

					//1出力
					else if(nval == 1){
						fprintf(fp, "1");
					}

					//X出力
					else if(nval == 3){
						fprintf(fp, "X");
					}
				}
			}

			//改行出力
			fprintf(fp, "\n");
		}
	}


	//ファイルクローズ
	fclose(fp);

	//====================================================================
	// 無効状態パターンをファイル出力
	//====================================================================
	//ファイル名作成
	strcpy(name, "illegal_");
	strcat(name, smodule_name);
	strcat(name, ".txt");

	
	//ファイルオープン
	fp = fopen(name, "w");

	//ファイル出力
	for(i=0; i<n_tp; i++){
		//有効状態
		if(tp_flag[i] == ILLEGAL_STATE){
			
			//=================================================
			// txt形式ファイルで入力の場合
			//=================================================
			if(opt.tp_txt == YES){
		
				//----------------------------------
				// PIN順序テーブルに従っての1時刻目値を出力
				//----------------------------------
				for(j=0; j<(n_spi+n_ppi); j++){

					//X抽出後の値を得る
					nval = Get_NBit(pin_tbl[j]->sinput->nval_t1, i);

					//0出力
					if(nval == 0){
						fprintf(fp, "0");
					}

					//1出力
					else if(nval == 1){
						fprintf(fp, "1");
					}

					//X出力
					else if(nval == 3){
						fprintf(fp, "X");
					}
				}
			}

			//=================================================
			// STIL形式ファイルで入力の場合
			//=================================================
			if(opt.tp_stil == YES){
		
				//----------------------------------
				//PI出力
				//----------------------------------
				for(j=0; j<n_spi; j++){
					//X抽出後の値を得る
					nval = Get_NBit(spi[j]->nval_t1, i);
				
					//0出力
					if(nval == 0){
						fprintf(fp, "0");
					}

					//1出力
					else if(nval == 1){
						fprintf(fp, "1");
					}

					//X出力
					else if(nval == 3){
						fprintf(fp, "X");
					}
				}
			
				//----------------------------------
				//PPI出力
				//----------------------------------
				for(j=0; j<n_ppi; j++){
					//X抽出後の値を得る
					nval = Get_NBit(ppi[j]->nval_t1, i);

					//0出力
					if(nval == 0){
						fprintf(fp, "0");
					}

					//1出力
					else if(nval == 1){
						fprintf(fp, "1");
					}

					//X出力
					else if(nval == 3){
						fprintf(fp, "X");
					}
				}
			}

			//改行出力
			fprintf(fp, "\n");
		}
	}


	
	//====================================================================
	// ログ出力
	//====================================================================
	printf("\n\n//------------------------------------------\n");
	printf("// レポート：有効状態テストパターン分類\n");
	printf("//------------------------------------------\n");
	printf("テストパターン数   : %d\n", n_tp);
	printf("レジスタ(FF)数     : %d\n", n_ppi);
	printf("RTL記述有効状態数  : %d\n", n_state);
	printf("有効状態パターン数 : %d\n", n_tp - n_illegal_tp);
	printf("無効状態パターン数 : %d\n", n_illegal_tp);
	printf("//------------------------------------------\n");


	//ファイルクローズ
	fclose(fp);
	exit(2);
}