//------------------------------------------------------------------------
//File name : file_outpuf_xid_log.c
//Date : 2013/7/25
//Designer : H.Yamazaki
//Ver : 0.01
//
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

#define	DEBUG

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：file_output_xid_log
//機能　：XIDログファイル出力
//引数　：fp(出力ファイルポインタ)
//戻り値：なし
//--------------------------------------------------------------------
void file_output_xid_log(FILE* fp){

	int		i;


	fprintf(fp, "//=================================================\n");
	fprintf(fp, "// 各故障のX抽出実行回数\n");
	fprintf(fp, "//=================================================\n");

	//======================================================
	// 縮退故障モデル
	//======================================================
	if(opt.fmodel == SAF){
		for(i=0; i<n_net; i++){
			//-----------------------------------
			// 0縮退故障
			//-----------------------------------
			if(nl[i].test_sf0==YES && nl[i].det_sf0>0){
				if(nl[i].xid_det_sf0 > 0){
					fprintf(fp, "検出 \t");
				}
				else{
					fprintf(fp, "未検出 \t");
				}
				fprintf(fp, "SF0 \t %s \t n_xid \t %d \t n_det \t %d\n", nl[i].name, nl[i].n_sa0_xid, nl[i].det_sf0);
			}

			//-----------------------------------
			// 1縮退故障
			//-----------------------------------
			if(nl[i].test_sf1==YES && nl[i].det_sf1>0){
				if(nl[i].xid_det_sf1 > 0){
					fprintf(fp, "検出 \t");
				}
				else{
					fprintf(fp, "未検出 \t");
				}
				fprintf(fp, "SF1 \t %s \t n_xid \t %d \t n_det \t %d\n", nl[i].name, nl[i].n_sa1_xid, nl[i].det_sf1);
			}
		}
	}


	//======================================================
	// 遷移故障モデル
	//======================================================
	else if(opt.fmodel == TDF){
	}
}