//------------------------------------------------------------------------
//File name : file_output_rep_flist.c
//Date : 2013/11/14
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../Lib/bit_int.h"
#include	"../Lib/bit_tp.h"
#include	"../StandardHead.h"
#include	"../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
//#define	DET_DEBUG

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : file_output_rep_flist
//  機  能 : 代表故障リストをファイル出力
//  戻り値 : なし
//  引  数 : ファイルポインタ
//----------------------------------------------
void	file_output_rep_flist(FILE* fp){

	int		i;

	//=======================================================
	// 縮退故障
	//=======================================================
	if(opt.fmodel == SAF){
		for(i=0; i<n_net; i++){

			//0縮退故障
			if(nl[i].test_sf0 == YES){
				fprintf(fp, "SF0 %s\n", nl[i].name);
			}

			//1縮退故障
			if(nl[i].test_sf1 == YES){
				fprintf(fp, "SF1 %s\n", nl[i].name);
			}
		}
	}
	
	//=======================================================
	// 遷移故障
	//=======================================================
	else if(opt.fmodel == TDF){
		for(i=0; i<n_snet; i++){

			//立上り遷移故障
			if(s_nl[i].test_str == YES){
				fprintf(fp, "STR %s\n", s_nl[i].name);
			}

			//立下り遷移故障
			if(s_nl[i].test_stf == YES){
				fprintf(fp, "STF %s\n", s_nl[i].name);
			}
		}
	}

}