//------------------------------------------------------------------------
//File name : file_output_carebit_analysis.c
//Date : 2012/2/3
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../Netlist/netlist.h"
#include	"../Lib/bit_int.h"
#include	"../Lib/bit_tp.h"
#include	"../StandardHead.h"
#include	"../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------


//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : file_output_carebit_analysis
//  機  能 : 【解析モード】全TP全故障の必要ケアビット数ファイル出力
//  戻り値 : なし
//  引  数 : ファイルポインタ
//----------------------------------------------
void	file_output_carebit_analysis(FILE* fp){

	int		i;
	//FILE	*fp;

	
	//================================================
	// 何かバグあるのでここでファイルオープン
	//================================================
	/*
	if((fp = fopen("result_xid_analysis.txt","w")) == (FILE *)NULL){
		fprintf(stderr,"Cannot open Analyze file \n");
		exit(1);
	}*/


	fprintf(stderr,"\n\n File_Output_Carebit_Analize\n");
	fprintf(stderr,"|----+----|----+----|----+----|----+----|----+----|\n");

	//================================================
	// 縮退故障の場合
	//================================================
	for(i=0; i<n_net; i++){

		//------------------------------------
		// Progress Bar
		//------------------------------------
		if(((int)i % (int)((n_net*2/100)+1)) == 0)fprintf(stderr,"*");
		

		//------------------------------------
		//0縮退故障
		//------------------------------------
		if(nl[i].test_sf0==YES && nl[i].det_sf0>0){
			fprintf(fp, "%s \t SAF0 \t 検出回数: \t %d \t 総合ケアビット数: \t %d \t平均ケアビット数: \t %.2lf\n", nl[i].name, nl[i].det_sf0, nl[i].n_sa0_carebit, (double)nl[i].n_sa0_carebit/(double)nl[i].det_sf0);
		}		

		//------------------------------------
		//1縮退故障
		//------------------------------------
		if(nl[i].test_sf1==YES && nl[i].det_sf1>0){
			fprintf(fp, "%s \t SAF1 \t 検出回数: \t %d \t 総合ケアビット数: \t %d \t 平均ケアビット数: \t %.2lf\n", nl[i].name, nl[i].det_sf1, nl[i].n_sa1_carebit, (double)nl[i].n_sa1_carebit/(double)nl[i].det_sf1);
		}
	}

}