//------------------------------------------------------------------------
//File name : file_outpuf_missed_fault.c
//Date : 2013/10/24
//Designer : H.Yamazaki
//Ver : 0.01
//
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

#define	DEBUG

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：check_missed_fault
//機能　：見逃し故障にフラグ立て
//引数　：なし
//戻り値：なし
//※見逃し故障X抽出関数の直前で実行
//--------------------------------------------------------------------
void check_missed_fault(){

	int			i;

	//======================================================
	// 縮退故障モデル
	//======================================================
	if(opt.fmodel == SAF){
		//初期化
		for(i=0; i<n_net; i++)nl[i].missed_flag=0;

		//見逃し故障チェック
		for(i=0; i<n_net; i++){
			//-----------------------------------
			//0縮退故障の対象故障判定
			//-----------------------------------
			if(nl[i].test_sf0==YES && nl[i].det_sf0>=1 && nl[i].xid_det_sf0==NO){	//対象故障かつ1回以上検出かつ未検出
				nl[i].missed_flag = nl[i].missed_flag | 1;
			}
			//-----------------------------------
			//1縮退故障の対象故障判定
			//-----------------------------------
			if(nl[i].test_sf1==YES && nl[i].det_sf1>=1 && nl[i].xid_det_sf1==NO){	//対象故障かつ1回以上検出かつ未検出
				nl[i].missed_flag = nl[i].missed_flag | 2;
			}
		}
	}

	//======================================================
	// 遷移故障モデル
	//======================================================
	else if(opt.fmodel == TDF){	
		//初期化
		for(i=0; i<n_snet; i++)s_nl[i].missed_flag=0;

		//見逃し故障チェック
		for(i=0; i<n_snet; i++){
			//-----------------------------------
			//立上り遷移故障の対象故障判定
			//-----------------------------------
			if(s_nl[i].test_str==YES && s_nl[i].det_str>=1 && s_nl[i].xid_det_str==NO){	//対象故障かつ1回以上検出かつ未検出
				s_nl[i].missed_flag = s_nl[i].missed_flag | 1;
			}
			//-----------------------------------
			//立下り遷移故障の対象故障判定
			//-----------------------------------
			if(s_nl[i].test_stf==YES && s_nl[i].det_stf>=1 && s_nl[i].xid_det_stf==NO){	//対象故障かつ1回以上検出かつ未検出
				s_nl[i].missed_flag = s_nl[i].missed_flag | 2;
			}
		}
	}
}

//--------------------------------------------------------------------
//関数名：file_outpuf_missed_fault
//機能　：見逃し故障リストファイル出力
//引数　：fp(出力ファイルポインタ)
//戻り値：なし
//--------------------------------------------------------------------
void file_outpuf_missed_fault(FILE* fp){

	int		i;

	//======================================================
	// 縮退故障モデル
	//======================================================
	if(opt.fmodel == SAF){
		for(i=0; i<n_net; i++){
			//-----------------------------------
			//0縮退故障が見逃し故障
			//-----------------------------------
			if(nl[i].missed_flag==1 || nl[i].missed_flag==3){
				fprintf(fp, "SF0 %s\n", nl[i].name);
			}

			//-----------------------------------
			//1縮退故障が見逃し故障
			//-----------------------------------
			if(nl[i].missed_flag==2 || nl[i].missed_flag==3){
				fprintf(fp, "SF1 %s\n", nl[i].name);
			}
		}
	}

	//======================================================
	// 遷移故障モデル
	//======================================================
	else if(opt.fmodel == TDF){	
		for(i=0; i<n_snet; i++){
			//-----------------------------------
			//立上り遷移故障が見逃し故障
			//-----------------------------------
			if(s_nl[i].missed_flag==1 || s_nl[i].missed_flag==3){
				fprintf(fp, "STR %s\n", s_nl[i].name);
			}
			//-----------------------------------
			//立下り遷移故障が見逃し故障
			//-----------------------------------
			if(s_nl[i].missed_flag==2 || s_nl[i].missed_flag==3){
				fprintf(fp, "STF %s\n", s_nl[i].name);
			}
		}
	}
}