//------------------------------------------------------------------------
//File name : TDF_search_influence_corn.c
//Date : 2013/10/10
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/s_netlist.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"../../Lib/alloc.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
int		comp_n_corn_pi		(const void *,const void *);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define DEBUG
	//#define SORT_DEBUG

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : TDF_search_influence_corn
//  機  能 : 各PPOの影響範囲内PI+PPI数をカウント
//  戻り値 : なし
//  引  数 : なし
//  ※順序回路のためFFRグラフからの解析不能
//----------------------------------------------
unsigned int	TDF_search_influence_corn(){

	int					i,j;
	unsigned int		count=0;			//計算済み信号線フラグ値(1～2^32まで使用)
	S_NLIST				*t_net;				//デキューした信号線ポインタを格納
	
	
	//=================================================
	// フラグ初期化
	//=================================================
	for(i=0; i<n_snet; i++)s_nl[i].flag = 0;


	//=================================================
	// PPOから入力側へコーン探索
	//=================================================
	for(i=0; i<n_ppo; i++){
		
		//-------------------------------------
		// フラグ値更新
		//-------------------------------------
		count += 2;

		//-------------------------------------
		// 対象PPOをエンキュー
		//-------------------------------------
		ppo[i]->flag = count;			//対象PPOにフラグ値セット
		enqueue(nl_queue, ppo[i]);		//エンキュー
		
		//-------------------------------------
		// PI数，PPI数をカウント
		//-------------------------------------
		while( (t_net = (S_NLIST*)dequeue(nl_queue) ) != NULL){

			//デキュー信号線がPIかPPIなら信号線数更新
			if(t_net->type==IN || t_net->type==DFF){
				ppo[i]->n_corn_pi++;
			}

			//PI，PPI以外ならさらに入力側へ探索
			else{
				for(j=0; j<t_net->n_in; j++){
					if(t_net->in[j]->flag != count){		//入力がフラグ未設置の場合
						t_net->in[j]->flag = count;			//フラグ設置
						enqueue(nl_queue, t_net->in[j]);	//エンキュー
					}
				}
			}			
		}

		//-------------------------------------
		// キュー再初期化
		//-------------------------------------
		reset_queue(nl_queue);

	}

#ifdef DEBUG
	printf("\n//------------------------------\n");
	printf("// DEBUG: インフルエンスコーン解析【順序回路】\n");
	printf("//------------------------------\n");
	for(i=0; i<n_ppo; i++){
		printf("%s[ffr:%d] 影響PI+PPI:%d\n", ppo[i]->name, ppo[i]->ffr_id, ppo[i]->n_corn_pi);
	}
	printf("\n");
#endif	


	//=================================================
	// コーン探索の結果に基づいてpropa_poをソート
	//=================================================
	//メモリ確保
	sort_propa_po = (XID_PROPA_PO**)malloc(sizeof(XID_PROPA_PO*) * n_ppo);	//PPO数分メモリ確保

	//初期アドレス代入
	for(i=0; i<n_ppo; i++){
		sort_propa_po[i] = &propa_po[i];			//アドレス代入
		propa_po[i].n_corn_pi = ppo[i]->n_corn_pi;	//コーン内PI数情報代入
	}

	//n_corn_piの昇順でソート
	qsort((void*)sort_propa_po, n_ppo, sizeof(XID_PROPA_PO*), comp_n_corn_pi);

	
#ifdef SORT_DEBUG
	printf("\n//------------------------------\n");
	printf("// DEBUG: PPOソート【順序回路】\n");
	printf("//------------------------------\n");
	for(i=0; i<n_ppo; i++){
		printf("sort_propa_po[%d] n_corn_pi:%d\n", i, sort_propa_po[i]->n_corn_pi);
	}
	printf("\n");
#endif	

	return count;
	
}