//===========================================================-------------
//File name : TDF_Forward_Implication.c
//Date : 2013/10/15
//Designer : H.Yamazaki
//Ver : 0.01
//===========================================================-------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/s_netlist.h"
#include	"../../Lib/bit_tp.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"../Xidentification.h"

#include	<string.h>
//===========================================================----------
// プロトタイプ宣言
//===========================================================----------
void	TDF_0_Forward_Implication	(S_NLIST*, int, int);
void	TDF_1_Forward_Implication	(S_NLIST*, int, int);

//===========================================================----------
// 定義
//===========================================================----------

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//
	//#define		FIMPL_DEBUG
	//#define		BIT_DEBUG
//===========================================================-------------
//  静的変数
//===========================================================-------------

//===========================================================-------------
//  外部関数
//===========================================================-------------
//----------------------------------------------
//  関数名 : TDF_0_Forward_Implication
//  機  能 : t_netの入力値が0からの前方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(前方含意判定信号線), tp_id(テストパターンの何番目か), time(時刻)
//----------------------------------------------
void	TDF_0_Forward_Implication(S_NLIST* t_net, int tp_id, int time){

	int		i;

#ifdef BIT_DEBUG
	int			k,x,y;

	for(k=0; k<n_snet; k++){
		//1時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t1, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t1, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 1時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 1時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		//2時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t2, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t2, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 2時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 2時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
	}
#endif

	switch(t_net->type){
		//********************************************************************
		case DFF:
			//===========================================================
			// 入力=0 → 出力=0に前方含意可能
			//===========================================================
			//       ___________ 
			//       |   DFF    |
			// 0 --->|D        Q|---> 0
			//       |          |
			//       |__________|
			//
			//      ※Q端子がtype:DFF
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){
				//------------------------
				// 出力信号線を0固定
				//------------------------
				Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif				
				for(i=0; i<t_net->n_out; i++){
					//------------------------
					//★出力がDFF→2時刻目前方含意
					//------------------------
					if(t_net->out[i]->type == DFF){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
					//------------------------
					//★それ以外→1時刻目前方含意
					//------------------------
					else{
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//------------------------
				// 出力信号線を0固定
				//------------------------
				Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定(時刻2):%s\n", t_net->name);
#endif
				//------------------------
				// ★t_netの出力先がDFF意外なら2時刻目前方含意
				//------------------------
				for(i=0; i<t_net->n_out; i++){
					//出力がDFF以外
					if(t_net->out[i]->type != DFF){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
			}
			break;
		//********************************************************************
		case BUF:
		case FOUT:
		case AND:
			//===========================================================
			// 入力=0 → 出力=0に前方含意可能
			//===========================================================
			//      |＼                 ＿＿                   ______ 0
			//      |  ＼           0 --|   ＼                |
			// 0 ---|BUF >--- 0     ? --| AND│--- 0     0 ---|
			//      |  ／           ? --|   ／                |______ 
			//      |／                 ￣￣                          0
			//

			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){

				//------------------------
				// 出力信号線を0固定
				//------------------------
				Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif			
				//------------------------
				// PPOの場合2時刻目FFに前方含意
				//------------------------
				if(t_net->ppo_flag == YES){
					for(i=0; i<t_net->n_out; i++){
						//2時刻目FF(PPI)がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
				//------------------------
				// それ以外は1時刻目前方含意
				//------------------------
				else{
					//さらに出力信号線(1時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){
				
				//------------------------
				// 出力信号線を0固定
				//------------------------
				Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定(時刻2):%s\n", t_net->name);
#endif
				//------------------------
				// t_netがPPOで無い場合
				//------------------------
				if(t_net->ppo_flag == NO){
					//さらに出力信号線(2時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
			}

		break;
		//********************************************************************
		case INV:
		case NAND:
			//===========================================================
			// 入力=0 → 出力=1に前方含意可能
			//===========================================================
			//        |＼                   ＿＿
			//        |  ＼             0 --|   ＼
			//   0 ---|INV >○-- 1      ? --|NAND│○-- 1
			//        |  ／             ? --|   ／
			//        |／                   ￣￣   
			 
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){
				
				//------------------------
				//出力信号線を1固定
				//------------------------
				Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定(時刻1):%s\n", t_net->name);
#endif
				//------------------------
				// PPOの場合2時刻目FFに前方含意
				//------------------------
				if(t_net->ppo_flag == YES){
					for(i=0; i<t_net->n_out; i++){
						//2時刻目FF(PPI)がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
				//------------------------
				// それ以外は1時刻目前方含意
				//------------------------
				else{
					//さらに出力信号線(1時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){
				
				//------------------------
				//出力信号線を1固定
				//------------------------
				Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
				//------------------------
				// t_netがPPOで無い場合
				//------------------------
				if(t_net->ppo_flag == NO){
					//さらに出力信号線(2時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
			}
		break;
		//********************************************************************
		case OR:
			//===========================================================
			// 入力=0 (全入力=0なら出力=0に含意可能)
			//===========================================================
			//         ＿＿
			// 【0】---＼   ＼
			//   0-------) OR >--- 0(t_net)
			//   0-----／   ／
			//         ￣￣      ※全入力信号線=0 (非制御値)

			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){

				//---------------------------------
				//入力信号線の非制御値(0)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//0以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) != 0){
						break;
					}
				}

				//全て非制御値(0)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を0固定
					//------------------------
					Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
					//------------------------
					// PPOの場合2時刻目FFに前方含意
					//------------------------
					if(t_net->ppo_flag == YES){
						for(i=0; i<t_net->n_out; i++){
							//2時刻目FF(PPI)がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
					//------------------------
					// それ以外は1時刻目前方含意
					//------------------------
					else{
						//さらに出力信号線(1時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
								TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
							}
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//---------------------------------
				//入力信号線の非制御値(0)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//0以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) != 0){
						break;
					}
				}

				//全て非制御値(0)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を0固定
					//------------------------
					Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意0固定(時刻2):%s\n", t_net->name);
#endif
					//------------------------
					// t_netがPPOで無い場合
					//------------------------
					if(t_net->ppo_flag == NO){
						//さらに出力信号線(2時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
				}
			}

		break;
		//********************************************************************
		case NOR:
			//===========================================================
			// 入力=0 (全入力=0なら出力=1に含意可能)
			//===========================================================
			//         ＿＿
			// 【0】---＼   ＼
			//   0 ------)NOR >○-- 1(t_net)
			//   0 ----／   ／
			//         ￣￣
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){

				//---------------------------------
				//入力信号線の非制御値(0)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//0以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) != 0){
						break;
					}
				}
				
				//全て非制御値(0)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を1固定
					//------------------------
					Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意1固定(時刻1):%s\n", t_net->name);
#endif
					//------------------------
					// PPOの場合2時刻目FFに前方含意
					//------------------------
					if(t_net->ppo_flag == YES){
						for(i=0; i<t_net->n_out; i++){
							//2時刻目FF(PPI)がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
					//------------------------
					// それ以外は1時刻目前方含意
					//------------------------
					else{
						//さらに出力信号線(1時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
								TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
							}
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//---------------------------------
				//入力信号線の非制御値(0)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//0以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) != 0){
						break;
					}
				}

				//全て非制御値(0)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を1固定
					//------------------------
					Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
					//------------------------
					// t_netがPPOで無い場合
					//------------------------
					if(t_net->ppo_flag == NO){
						//さらに出力信号線(2時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//===========================================================
			// 入力=0 (全入力がケアビットなら前方含意可能)
			//===========================================================
			//         ＿＿＿                           ＿＿＿
			// 【0】---＼    ＼                 【0】---＼    ＼
			//           ))EXOR>--- 0(t_net)              ))EXOR>--- 1(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ￣￣￣                           ￣￣￣  
	
			//===========================================================
			// 入力=0 (全入力がケアビットなら前方含意可能)
			//===========================================================
			//         ＿＿＿                           ＿＿＿
			// 【0】---＼    ＼                 【0】---＼    ＼
			//          ))EXNOR>○-- 1(t_net)            ))EXNOR>○-- 0(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ￣￣￣                           ￣￣￣  
			
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){
				
				//---------------------------------
				//入力信号線のケアビット数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//Xがあったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
						break;
					}
				}

				//全てケアビットの場合
				if(i == t_net->n_in){
					//-----------------------------------------
					// 2値の場合
					//-----------------------------------------
					if(n_before_x == 0){
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit_Xbuf(t_net->nval_t1, tp_id) == 0){
							
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					}
				
					//-----------------------------------------
					// 3値の場合
					//-----------------------------------------
					else{
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit(t_net->nval_t1, tp_id) == 0){
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1 (全入力がケアビットなので問題ないはず…)
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//---------------------------------
				//入力信号線のケアビット数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//Xがあったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
						break;
					}
				}

				//全てケアビットの場合
				if(i == t_net->n_in){
					//-----------------------------------------
					// 2値の場合
					//-----------------------------------------
					if(n_before_x == 0){
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit_Xbuf(t_net->nval_t2, tp_id) == 0){
							
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					}
				
					//-----------------------------------------
					// 3値の場合
					//-----------------------------------------
					else{
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit(t_net->nval_t2, tp_id) == 0){
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1 (全入力がケアビットなので問題ないはず…)
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					}
				}
			}
		break;		
		//********************************************************************
	}
}

	
//----------------------------------------------
//  関数名 : TDF_1_Forward_Implication
//  機  能 : t_netの入力値が1からの前方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(前方含意判定信号線), tp_id(テストパターンの何番目か), time(時刻)
//----------------------------------------------
void	TDF_1_Forward_Implication(S_NLIST* t_net, int tp_id, int time){

	int		i;
	
#ifdef BIT_DEBUG

	int			k,x,y;

	for(k=0; k<n_snet; k++){

		//1時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t1, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t1, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 1時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 1時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		//2時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t2, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t2, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 2時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 2時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
	}
#endif

	switch(t_net->type){

		//********************************************************************
		case DFF:
			//===========================================================
			// 入力=1 → 出力=1に前方含意可能
			//===========================================================
			//       ___________ 
			//       |   DFF    |
			// 1 --->|D        Q|---> 1
			//       |          |
			//       |__________|
			//
			//      ※Q端子がtype:DFF
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){
				//------------------------
				// 出力信号線を1固定
				//------------------------
				Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定(時刻1):%s\n", t_net->name);
#endif
				for(i=0; i<t_net->n_out; i++){				
					//------------------------
					//★出力がDFF→2時刻目前方含意
					//------------------------
					if(t_net->out[i]->type == DFF){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}			
					//------------------------
					//★それ以外→1時刻目前方含意
					//------------------------
					else{
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//------------------------
				// 出力信号線を1固定
				//------------------------
				Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
				//------------------------
				// ★t_netの出力先がDFF意外なら2時刻目前方含意
				//------------------------
				for(i=0; i<t_net->n_out; i++){
					//出力がDFF以外
					if(t_net->out[i]->type != DFF){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
			}
			break;
		//********************************************************************
		case BUF:
		case FOUT:
		case OR:
			//===========================================================
			// 入力=1 → 出力=1に前方含意可能
			//===========================================================
			//      |＼                 ＿＿                   ______ 1
			//      |  ＼           1 --＼   ＼                |
			// 1 ---|BUF >--- 1     ? ----) OR >--- 1     1 ---|
			//      |  ／           ? --／   ／                |______ 
			//      |／                 ￣￣                          1
			//
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){
				
				//------------------------
				//出力信号線を1固定
				//------------------------
				Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定(時刻1):%s\n", t_net->name);
#endif
				//------------------------
				// PPOの場合2時刻目FFに前方含意
				//------------------------
				if(t_net->ppo_flag == YES){
					for(i=0; i<t_net->n_out; i++){
						//2時刻目FF(PPI)がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
				//------------------------
				// それ以外は1時刻目前方含意
				//------------------------
				else{
					//さらに出力信号線(1時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){
				
				//------------------------
				//出力信号線を1固定
				//------------------------
				Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
				//------------------------
				// t_netがPPOで無い場合
				//------------------------
				if(t_net->ppo_flag == NO){
					//さらに出力信号線(2時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
			}

		break;
		//********************************************************************
		case INV:
		case NOR:
			//===========================================================
			// 入力=1 (出力=0に含意可能)
			//===========================================================
			//        |＼                   ＿＿
			//        |  ＼             1 --＼   ＼
			//   1 ---|INV >○-- 0      ? ----)NOR >○-- 0
			//        |  ／             ? --／   ／
			//        |／                   ￣￣   
			 
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){

				//------------------------
				// 出力信号線を0固定
				//------------------------
				Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
				//------------------------
				// PPOの場合2時刻目FFに前方含意
				//------------------------
				if(t_net->ppo_flag == YES){
					for(i=0; i<t_net->n_out; i++){
						//2時刻目FF(PPI)がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
				//------------------------
				// それ以外は1時刻目前方含意
				//------------------------
				else{
					//さらに出力信号線(1時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){
				
				//------------------------
				// 出力信号線を0固定
				//------------------------
				Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
				printf("前方含意0固定(時刻2):%s\n", t_net->name);
#endif
				//------------------------
				// t_netがPPOで無い場合
				//------------------------
				if(t_net->ppo_flag == NO){
					//さらに出力信号線(2時刻目)を前方含意判定
					for(i=0; i<t_net->n_out; i++){
						//出力信号線がドントケア
						if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
							TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
						}
					}
				}
			}

		break;
		//********************************************************************
		case AND:
			//===========================================================
			// 入力=1 (全入力=1なら出力=1に含意可能)
			//===========================================================
			//         ＿＿  
			// 【1】---|   ＼
			//   1 ----| AND│--- 1(t_net)  
			//   1 ----|   ／
			//         ￣￣

			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){

				//---------------------------------
				//入力信号線の非制御値(1)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//1以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) != 1){
						break;
					}
				}

				//全て非制御値(1)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を1固定
					//------------------------
					Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意1固定(時刻1):%s\n", t_net->name);
#endif
					//------------------------
					// PPOの場合2時刻目FFに前方含意
					//------------------------
					if(t_net->ppo_flag == YES){
						for(i=0; i<t_net->n_out; i++){
							//2時刻目FF(PPI)がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
					//------------------------
					// それ以外は1時刻目前方含意
					//------------------------
					else{
						//さらに出力信号線(1時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
								TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
							}
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//---------------------------------
				//入力信号線の非制御値(1)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//1以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) != 1){
						break;
					}
				}

				//全て非制御値(1)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を1固定
					//------------------------
					Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
					//------------------------
					// t_netがPPOで無い場合
					//------------------------
					if(t_net->ppo_flag == NO){
						//さらに出力信号線(2時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
				}
			}

		break;
		//********************************************************************
		case NAND:
			//===========================================================
			// 入力=1 (全入力=1なら出力=0に含意可能)
			//===========================================================
			//         ＿＿  
			// 【1】---|   ＼
			//   1 ----|NAND│○-- 0(t_net)  
			//   1 ----|   ／
			//         ￣￣
			
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){

				//---------------------------------
				//入力信号線の非制御値(1)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//1以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) != 1){
						break;
					}
				}

				//全て非制御値(1)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を0固定
					//------------------------
					Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
					//------------------------
					// PPOの場合2時刻目FFに前方含意
					//------------------------
					if(t_net->ppo_flag == YES){
						for(i=0; i<t_net->n_out; i++){
							//2時刻目FF(PPI)がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
					//------------------------
					// それ以外は1時刻目前方含意
					//------------------------
					else{
						//さらに出力信号線(1時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
								TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
							}
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//---------------------------------
				//入力信号線の非制御値(1)数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//1以外があったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) != 1){
						break;
					}
				}

				//全て非制御値(1)の場合
				if(i == t_net->n_in){
					
					//------------------------
					//出力信号線を0固定
					//------------------------
					Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
					printf("前方含意0固定(時刻2):%s\n", t_net->name);
#endif
					//------------------------
					// t_netがPPOで無い場合
					//------------------------
					if(t_net->ppo_flag == NO){
						//さらに出力信号線(2時刻目)を前方含意判定
						for(i=0; i<t_net->n_out; i++){
							//出力信号線がドントケア
							if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
								TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
							}
						}
					}
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//===========================================================
			// 入力=1 (全入力がケアビットなら前方含意可能)
			//===========================================================
			//         ＿＿＿                           ＿＿＿
			// 【1】---＼    ＼                 【1】---＼    ＼
			//           ))EXOR>--- 1(t_net)              ))EXOR>--- 0(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ￣￣￣                           ￣￣￣  
	
			//===========================================================
			// 入力=1 (全入力がケアビットなら前方含意可能)
			//===========================================================
			//         ＿＿＿                           ＿＿＿
			// 【1】---＼    ＼                 【1】---＼    ＼
			//          ))EXNOR>○-- 0(t_net)            ))EXNOR>○-- 1(t_net)
			//   0 ----／    ／                   1 ----／    ／
			//         ￣￣￣                           ￣￣￣  
			
			//-----------------------------------------------------------
			// ■1時刻目前方含意
			//-----------------------------------------------------------
			if(time == 1){
				
				//---------------------------------
				//入力信号線のケアビット数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//Xがあったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
						break;
					}
				}

				//全てケアビットの場合
				if(i == t_net->n_in){
					//-----------------------------------------
					// 2値の場合
					//-----------------------------------------
					if(n_before_x == 0){
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit_Xbuf(t_net->nval_t1, tp_id) == 0){
							
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif							
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					}
				
					//-----------------------------------------
					// 3値の場合
					//-----------------------------------------
					else{
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit(t_net->nval_t1, tp_id) == 0){
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1 (全入力がケアビットなので問題ないはず…)
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t1, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// PPOの場合2時刻目FFに前方含意
							//------------------------
							if(t_net->ppo_flag == YES){
								for(i=0; i<t_net->n_out; i++){
									//2時刻目FF(PPI)がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
							//------------------------
							// それ以外は1時刻目前方含意
							//------------------------
							else{
								//さらに出力信号線(1時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t1, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 1);	//1時刻目前方含意
									}
								}
							}
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目前方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//---------------------------------
				//入力信号線のケアビット数を確認
				//---------------------------------
				for(i=0; i<t_net->n_in; i++){
					//Xがあったらbreak
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
						break;
					}
				}

				//全てケアビットの場合
				if(i == t_net->n_in){
					//-----------------------------------------
					// 2値の場合
					//-----------------------------------------
					if(n_before_x == 0){
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit_Xbuf(t_net->nval_t2, tp_id) == 0){
							
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					}
				
					//-----------------------------------------
					// 3値の場合
					//-----------------------------------------
					else{
						//------------------------
						//出力値=0
						//------------------------
						if(Get_NBit(t_net->nval_t2, tp_id) == 0){
							//------------------------
							//出力信号線を0固定
							//------------------------
							Set_NBit_Zero(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意0固定(時刻1):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					
						//------------------------
						//出力値=1 (全入力がケアビットなので問題ないはず…)
						//------------------------
						else{
							//------------------------
							//出力信号線を1固定
							//------------------------
							Set_NBit_One(t_net->xid_nval_t2, tp_id);
#ifdef FIMPL_DEBUG
							printf("前方含意1固定(時刻2):%s\n", t_net->name);
#endif
							//------------------------
							// t_netがPPOで無い場合
							//------------------------
							if(t_net->ppo_flag == NO){
								//さらに出力信号線(2時刻目)を前方含意判定
								for(i=0; i<t_net->n_out; i++){
									//出力信号線がドントケア
									if(Get_NBit(t_net->out[i]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->out[i], tp_id, 2);	//2時刻目前方含意
									}
								}
							}
						}
					}
				}
			}
		break;		
		//********************************************************************
	}
}