//------------------------------------------------------------------------------------
//File name : TDF_3v_XID_PPSFP_CPT.c
//Date : 2013/10/14
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../../Netlist/netlist.h"
#include	"../../../Lib/bit_tp.h"
#include	"../../../Lib/bit_int.h"
#include	"../../../StandardHead.h"
#include	"../../../option.h"

//---------------------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------------------
void	dtob					(unsigned int, int);
void	TDF_3v_XID_PPSFP_CPT0	(int , unsigned int , S_NLIST *);
void	TDF_3v_XID_PPSFP_CPT1	(int , unsigned int , S_NLIST *);

//---------------------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------------------
//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

	//#define DEBUG

//------------------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------
//  関数名 : TDF_3v_XID_PPSFP_CPT0
//  機  能 : 【X抽出時用】3値遷移故障クリティカルパストレーシング
//  戻り値 : なし
//  引  数 : ffr_id(FFR番号), tp_id(テストパターンの何番目か), t_net(CPTを始める信号線[=FFRの先頭])
//------------------------------------------------------------------------------------------------
void	TDF_3v_XID_PPSFP_CPT0(int ffr_id, unsigned int tp_id, S_NLIST *t_net){

	int i;
	int	n_contorolling=0;	//入力の制御値の本数
	int	in;					//t_netのi番目(制御値の場所を格納)
	int	nval;				//正常値の一時保存変数
	int	n_xbit=0;			//入力のXbitの本数

	switch(t_net->type){
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(2時刻目入力=0) && 1時刻目入力=1 (入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|BUF >--- 0
			//        |  ／
			//        |／
			
			//---------------------------
			//1時刻目入力値==1
			//---------------------------
			if(t_net->in[0]->xid_det_stf == NO){

				//1時刻目入力値==1
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 1){

					//立下り遷移故障(1→0/1)を検出
					t_net->in[0]->xid_det_stf = YES;

					//テスト対象故障の場合
					if(t_net->in[0]->test_stf == YES){
						sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
						n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
					}
#ifdef DEBUG
					printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[0]->name);
#endif
				}
			}
			
			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(2時刻目入力=1) && 1時刻目入力=0 (入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|INV >○-- 0
			//        |  ／
			//        |／

			//---------------------------
			//1時刻目入力値==0
			//---------------------------
			if(t_net->in[0]->xid_det_str == NO){

				//1時刻目入力値==0
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 0){

					//立上り遷移故障(0→1/0)を検出
					t_net->in[0]->xid_det_str = YES;

					//テスト対象故障の場合
					if(t_net->in[0]->test_str == YES){
						sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
						n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
					}
#ifdef DEBUG
					printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[0]->name);
#endif
				}
			}
			
			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(2時刻目入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   X --| AND│--- 0
			//   1 --|   ／
			//       ￣￣

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->xid_nval_t2, tp_id);

				//2時刻目入力信号線が制御値:0
				if(nval == 0){
					n_contorolling++;
					in = i;
			
					//2時刻目入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------------------
			// 2時刻目入力信号線の『制御値が1本』&& 『1時刻目入力値=1』なら故障検出可能
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --| AND│--- 0
			//   1 --|   ／
			//       ￣￣
			if(n_contorolling==1 && n_xbit==0){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(t_net->in[in]->xid_det_stf == NO){

					//1時刻目入力値==1
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 1){

						//立下り遷移故障(1→0/1)を検出
						t_net->in[in]->xid_det_stf = YES;

						//テスト対象故障の場合
						if(t_net->in[in]->test_stf == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
						printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[in]->name);
#endif
					}
				}
				
				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[in]);
			}
			
		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(入力信号線は全て非制御値⇒入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --|NAND│○-- 0
			//   1 --|   ／
			//       ￣￣      ※全入力信号線=1 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(t_net->in[i]->xid_det_str == NO){

					//1時刻目入力値==0
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 0){
						
						//立上り遷移故障(0→1/0)を検出
						t_net->in[i]->xid_det_str = YES;

						//テスト対象故障の場合
						if(t_net->in[i]->test_str == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
					}
				}

				//---------------------------
				//さらに2時刻目入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------------------
			// 出力=0(入力信号線は全て非制御値⇒入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----) OR >--- 0
			//   0 --／   ／
			//       ￣￣      ※全入力信号線=0 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(t_net->in[i]->xid_det_stf == NO){

					//1時刻目入力値==1
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 1){

						//立下り遷移故障(1→0/1)を検出
						t_net->in[i]->xid_det_stf = YES;

						//テスト対象故障の場合
						if(t_net->in[i]->test_stf == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
					printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
					}
				}

				//---------------------------
				//さらに2時刻目入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------------------
			// 出力=0(入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----)NOR >○-- 0
			//   X --／   ／
			//       ￣￣

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->xid_nval_t2, tp_id);

				//入力信号線が制御値:1
				if(nval == 1){
					n_contorolling++;
					in = i;
			
					//入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------------------
			// 入力信号線の『制御値が1本』かつ『Xbitが存在しない』なら故障検出可能
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----)NOR >○-- 0
			//   0 --／   ／
			//       ￣￣
			if(n_contorolling==1 && n_xbit==0){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(t_net->in[in]->xid_det_str == NO){

					//1時刻目入力値==0
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 0){

						//立上り遷移故障(0→1/0)を検出
						t_net->in[in]->xid_det_str = YES;

						//テスト対象故障の場合
						if(t_net->in[in]->test_str == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[in]->name);
#endif
					}
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case EXOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//         ))EXOR>--- 0               ))EXOR>--- 0
			//   0 --／    ／               1 --／    ／
			//       ￣￣￣                     ￣￣￣  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==0 ){
					
					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(t_net->in[i]->xid_det_stf == NO){

						//1時刻目入力値==1
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==1){
							
							//立下り遷移故障(1→0/1)を検出
							t_net->in[i]->xid_det_stf = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_stf == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==1 ){
					
					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(t_net->in[i]->xid_det_str == NO){

						//1時刻目入力値==0
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==0){

							//立上り遷移故障(0→1/0)を検出
							t_net->in[i]->xid_det_str = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_str == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
		case EXNOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//        ))EXNOR>○-- 0             ))EXNOR>○-- 0
			//   0 --／    ／               1 --／    ／
			//       ￣￣￣                     ￣￣￣  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==0 ){

					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(t_net->in[i]->xid_det_stf == NO){

						//1時刻目入力値==1
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==1){

							//立下り遷移故障(1→0/1)を検出
							t_net->in[i]->xid_det_stf = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_stf == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==1 ){

					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(t_net->in[i]->xid_det_str == NO){

						//1時刻目入力値==0
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==0){

							//立上り遷移故障(0→1/0)を検出
							t_net->in[i]->xid_det_str = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_str == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}
		break;
		//********************************************************************
	}


}//END

//******************************************************************************
//******************************************************************************
//******************************************************************************
//------------------------------------------------------------------------------------------------
//  関数名 : TDF_3v_XID_PPSFP_CPT1
//  機  能 : 【X抽出時用】3値遷移故障クリティカルパストレーシング
//  戻り値 : なし
//  引  数 : ffr_id(FFR番号), tp_id(テストパターンの何番目か), t_net(CPTを始める信号線[=FFRの先頭])
//------------------------------------------------------------------------------------------------
void	TDF_3v_XID_PPSFP_CPT1(int ffr_id, unsigned int tp_id, S_NLIST *t_net){

	int i;
	int	n_contorolling=0;	//入力の制御値の本数
	int	in;					//t_netのi番目(制御値の場所を格納)
	int	nval;				//正常値の一時保存変数
	int	n_xbit=0;			//入力のXbitの本数

	switch(t_net->type){
		//********************************************************************
		case BUF:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1(2時刻目入力=1) && 1時刻目入力=0 (入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   1 ---|BUF >--- 1
			//        |  ／
			//        |／

			//---------------------------
			//1時刻目入力値==0
			//---------------------------
			if(t_net->in[0]->xid_det_str == NO){

				//1時刻目入力値==0
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 0){
					
					//立上り遷移故障(0→1/0)を検出
					t_net->in[0]->xid_det_str = YES;

					//テスト対象故障の場合
					if(t_net->in[0]->test_str == YES){
						sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
						n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
					}
#ifdef DEBUG
					printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[0]->name);
#endif
				}
			}

			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case INV:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1(2時刻目入力=0) && 1時刻目入力=1 (入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//        |＼
			//        |  ＼
			//   0 ---|INV >○-- 1
			//        |  ／
			//        |／

			//---------------------------
			//1時刻目入力値==1
			//---------------------------
			if(t_net->in[0]->xid_det_stf == NO){

				//1時刻目入力値==1
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 1){
					
					//立下り遷移故障(1→0/1)を検出
					t_net->in[0]->xid_det_stf = YES;

					//テスト対象故障の場合
					if(t_net->in[0]->test_stf == YES){
						sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
						n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
					}
#ifdef DEBUG
					printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[0]->name);
#endif
				}
			}

			//---------------------------
			//さらに2時刻目入力信号線をCPT
			//---------------------------
			TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[0]);

		break;
		//********************************************************************
		case AND:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1(入力信号線は全て非制御値⇒入力の立上り遷移故障(0→1/0)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --|   ＼
			//   1 --| AND│--- 1
			//   1 --|   ／
			//       ￣￣      ※全入力信号線=1 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(t_net->in[i]->xid_det_str == NO){

					//1時刻目入力値==0
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 0){

						//立上り遷移故障(0→1/0)を検出
						t_net->in[i]->xid_det_str = YES;

						//テスト対象故障の場合
						if(t_net->in[i]->test_str == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
					}
				}

				//---------------------------
				//さらに2時刻目入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case NAND:
			//-----------------------------------------------------------
			// 出力=1(入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   X --|NAND│○-- 1
			//   1 --|   ／
			//       ￣￣

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->xid_nval_t2, tp_id);

				//入力信号線が制御値:0
				if(nval == 0){
					n_contorolling++;
					in = i;
			
					//2時刻目入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------------------
			// 2時刻目入力信号線の『制御値が1本』&& 『1時刻目入力値=1』なら故障検出可能
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --|   ＼
			//   1 --|NAND│○-- 1
			//   1 --|   ／
			//       ￣￣
			if(n_contorolling==1 && n_xbit==0){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(t_net->in[in]->xid_det_stf == NO){

					//1時刻目入力値==1
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 1){
						
						//立下り遷移故障(1→0/1)を検出
						t_net->in[in]->xid_det_stf = YES;

						//テスト対象故障の場合
						if(t_net->in[in]->test_stf == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
						printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[in]->name);
#endif
					}
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case OR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(入力の『制御値0の本数』と『Xbitの存在』を確認)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   X --／   ／
			//       ￣￣

			for(i=0; i<t_net->n_in; i++){
		
				//入力信号線の正常値取得
				nval = Get_NBit(t_net->in[i]->xid_nval_t2, tp_id);

				//2時刻目入力信号線が制御値:1
				if(nval == 1){
					n_contorolling++;
					in = i;
			
					//2時刻目入力信号線に制御値が2個以上存在
					if(n_contorolling >= 2){
						break;	//故障検出不可能
					}
				}
				//入力信号線が制御値:X
				else if(nval == 3){
					n_xbit++;
					break;	//故障検出不可能
				}
			}

			//-----------------------------------------------------------------------
			// 2時刻目入力信号線の『制御値が1本』&& 『1時刻目入力値=0』なら故障検出可能
			//-----------------------------------------------------------------------
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   0 --／   ／
			//       ￣￣
			if(n_contorolling==1 && n_xbit==0){

				//---------------------------
				//1時刻目入力値==0
				//---------------------------
				if(t_net->in[in]->xid_det_str == NO){

					//1時刻目入力値==0
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 0){
						
						//立上り遷移故障(0→1/0)を検出
						t_net->in[in]->xid_det_str = YES;

						//テスト対象故障の場合
						if(t_net->in[in]->test_str == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
						printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[in]->name);
#endif
					}
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[in]);
			}

		break;
		//********************************************************************
		case NOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=0(入力信号線は全て非制御値⇒入力の立下り遷移故障(1→0/1)が検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----)NOR >○-- 1
			//   0 --／   ／
			//       ￣￣      ※全入力信号線=0 (非制御値)

			for(i=0; i<t_net->n_in; i++){

				//---------------------------
				//1時刻目入力値==1
				//---------------------------
				if(t_net->in[i]->xid_det_stf == NO){

					//1時刻目入力値==1
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 1){
							
						//立下り遷移故障(1→0/1)を検出
						t_net->in[i]->xid_det_stf = YES;

						//テスト対象故障の場合
						if(t_net->in[i]->test_stf == YES){
							sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
							n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
						}
#ifdef DEBUG
						printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
					}
				}

				//---------------------------
				//2時刻目入力信号線のさらに入力信号線をCPT
				//---------------------------
				TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[i]);
			}

		break;
		//********************************************************************
		case EXOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//         ))EXOR>--- 1               ))EXOR>--- 1
			//   0 --／    ／               1 --／    ／
			//       ￣￣￣                     ￣￣￣  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==0 ){

					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(t_net->in[i]->xid_det_stf == NO){

						//1時刻目入力値==1
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==1){
							
							//立下り遷移故障(1→0/1)を検出
							t_net->in[i]->xid_det_stf = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_stf == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==1 ){

					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(t_net->in[i]->xid_det_str == NO){

						//1時刻目入力値==0
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==0){
							
							//立上り遷移故障(0→1/0)を検出
							t_net->in[i]->xid_det_str = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_str == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
		case EXNOR:
			//-----------------------------------------------------------------------
			// 2時刻目出力=1 (※2入力のみなので，入力信号線は全て検出可能)
			//-----------------------------------------------------------------------
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//        ))EXNOR>○-- 1             ))EXNOR>○-- 1
			//   0 --／    ／               1 --／    ／
			//       ￣￣￣                     ￣￣￣  
	
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------------
				// 2時刻目入力信号線=0 (立下り遷移故障(1→0/1)が検出可能)
				//----------------------------------------
				if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==0 ){

					//---------------------------
					//1時刻目入力値==1
					//---------------------------
					if(t_net->in[i]->xid_det_stf == NO){

						//1時刻目入力値==1
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==1){

							//立下り遷移故障(1→0/1)を検出
							t_net->in[i]->xid_det_stf = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_stf == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, t_net->in[i]);
				}

				//----------------------------------------
				// 2時刻目入力信号線=1 (立上り遷移故障(0→1/0)が検出可能)
				//----------------------------------------
				else if( Get_NBit(t_net->in[i]->xid_nval_t2, tp_id)==1 ){

					//---------------------------
					//1時刻目入力値==0
					//---------------------------
					if(t_net->in[i]->xid_det_str == NO){

						//1時刻目入力値==0
						if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id)==0){

							//立上り遷移故障(0→1/0)を検出
							t_net->in[i]->xid_det_str = YES;

							//テスト対象故障の場合
							if(t_net->in[i]->test_str == YES){
								sffr[ffr_id].n_xid_detect++;		//対象FFR内の検出故障数更新
								n_xid_detect++;						//X抽出後テスト集合の検出故障数更新
							}
#ifdef DEBUG
							printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, t_net->in[i]->name);
#endif
						}
					}

					//---------------------------
					//2時刻目入力信号線のさらに入力信号線をCPT
					//---------------------------
					TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, t_net->in[i]);
				}
			}

		break;
		//********************************************************************
	}

}//END



//----------------------------------------------
//  関数名 : TDF_FOUT_3v_XID_CPT
//  機  能 : POまで故障伝搬したTPが何番目か判定し，CPT関数実行
//  戻り値 : なし
//  引  数 : ffr_id(ステムのFFR番号), stem_net(ステム信号線), ui_num(unsigned int番目), det_tp_list(PPOまで故障伝搬したTPリスト【0:未伝搬 1:伝搬(=故障検出)】), t_ppo(故障伝搬したPO)
//----------------------------------------------
void	TDF_FOUT_3v_XID_CPT	(int ffr_id, S_NLIST* stem_net, int ui_num, unsigned int* det_tp_list, S_NLIST* t_ppo){

	int				i;
	int				tp_id;		//テストパターンの何番目か
	unsigned int	x_buff;		//正常値x_buff一時保存
	unsigned int	p_buff;		//正常値p_buff一時保存
	unsigned int	fault_tp;	//故障伝搬したTP
#ifdef DEBUG
	int				j;
#endif

	//===========================================================
	// PPOの故障伝搬テストパターン判定(故障伝搬パターンに1が立つ)
	//===========================================================
	fault_tp = (t_ppo->xid_nval_t2->x_buf[ui_num] ^ t_ppo->x_fault) & (t_ppo->xid_nval_t2->p_buf[ui_num] ^ t_ppo->p_fault);	//(X-buff同士のEXOR)AND(P-buff同士のEXOR)

#ifdef DEBUG
	printf("\nSTEM(%s) : PPO(%s)の故障伝搬テストパターン判定\n",stem_net->name, t_ppo->name);
	dtob(fault_tp, 32);
#endif

	//===========================================================
	// テストパターン数が32未満(確保したunsinged int が1個)
	//===========================================================
	if(n_tp_int == 1){
		for(i=0; i<n_tp; i++){
			//------------------------------------------------
			//det_tp_listのi番目=0(テストパターンi番目が未検出)
			//------------------------------------------------
			if((*det_tp_list & MASKbit[i]) == 0){	
								
				//------------------------------------------------
				//fault_tpのiビット目に『1』が立っているか？(故障検出パターンか)
				//------------------------------------------------
				if( (fault_tp & MASKbit[i]) != 0){					
#ifdef DEBUG
					printf("\n%dパターン目：", i);
					for(j=0; j<n_spi; j++)printf("%d", Get_NBit_Xbuf(spi[j]->nval_t1, i));
					for(j=0; j<n_ppi; j++)printf("%d", Get_NBit_Xbuf(ppi[j]->nval_t1, i));
					printf("\n");
#endif
					
					//------------------------------------------------
					//FOUT-STEMの正常値計算
					//------------------------------------------------
					x_buff = stem_net->xid_nval_t2->x_buf[ui_num] & MASKbit[i];	//ステム信号線のXbufのj番目以外全て0の状態にする
					p_buff = stem_net->xid_nval_t2->p_buf[ui_num] & MASKbit[i];	//ステム信号線のPbufのj番目以外全て0の状態にする
											
					//------------------------------------------------
					//ステム信号線の正常値がXbitじゃない場合
					//------------------------------------------------
					if((x_buff&p_buff)==0){

						//==========================================
						// 2時刻目正常値 == 1
						//==========================================
						if(x_buff != 0){	//i番目に1が立ってる
								
							*det_tp_list |= MASKbit[i];			//det_tp_listのi番目に『1』を立てる
							tp_id = i;							//テストパターン番号を求める

							//--------------------------------------
							// 1時刻目正常値 == 0
							//--------------------------------------
							if(sffr[ffr_id].FoutStem->xid_det_str == NO){

								if( (stem_net->xid_nval_t1->x_buf[ui_num] & MASKbit[i])==0 && (stem_net->xid_nval_t1->p_buf[ui_num] & MASKbit[i])!=0){
								
									//【立上り遷移故障(0→1/0)を検出】検出情報更新
									sffr[ffr_id].FoutStem->xid_det_str = YES;

									if(sffr[ffr_id].FoutStem->test_str == YES){
										sffr[ffr_id].n_xid_detect++;				//対象FFR内の検出故障数更新
										n_xid_detect++;								//X抽出後テスト集合の検出故障数更新
									}
#ifdef DEBUG
									printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, sffr[ffr_id].FoutStem->name);
#endif
								}
							}
								
							//正常値1のCPT開始
							TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, stem_net);
						}
								
						//==========================================
						// 2時刻目正常値 == 0
						//==========================================
						else{	//全部0になった

							*det_tp_list |= MASKbit[i];		//det_tp_listのi番目に『1』を立てる
							tp_id = i;							//テストパターン番号を求める
							
							//--------------------------------------
							// 1時刻目正常値 == 1
							//--------------------------------------
							if(sffr[ffr_id].FoutStem->xid_det_stf == NO){

								if( (stem_net->xid_nval_t1->x_buf[ui_num] & MASKbit[i])!=0 && (stem_net->xid_nval_t1->p_buf[ui_num] & MASKbit[i])==0){
								
									//【立下り遷移故障(1→0/1)を検出】検出情報更新
									sffr[ffr_id].FoutStem->xid_det_stf = YES;

									if(sffr[ffr_id].FoutStem->test_stf == YES){
										sffr[ffr_id].n_xid_detect++;				//対象FFR内の検出故障数更新
										n_xid_detect++;								//X抽出後テスト集合の検出故障数更新
									}
#ifdef DEBUG
									printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, sffr[ffr_id].FoutStem->name);
#endif							
								}
							}
								
							//正常値0のCPT開始
							TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, stem_net);
						}
					}
				}
			}
		}
	}

	//===========================================================
	// テストパターン数が32以上
	//===========================================================
	else{
		for(i=0; i<32; i++){
			//------------------------------------------------
			//det_tp_listのi番目=0(テストパターンi番目が未検出)
			//------------------------------------------------
			if((*det_tp_list & MASKbit[i]) == 0){
								
				//------------------------------------------------
				//fault_tpのiビット目に『1』が立っているか？(故障検出パターンか)
				//------------------------------------------------
				if( (fault_tp & MASKbit[i]) != 0){
					
					//------------------------------------------------
					//FOUT-STEMの正常値計算
					//------------------------------------------------				
					x_buff = stem_net->xid_nval_t2->x_buf[ui_num] & MASKbit[i];	//ステム信号線のXbufのj番目以外全て0の状態にする
					p_buff = stem_net->xid_nval_t2->p_buf[ui_num] & MASKbit[i];	//ステム信号線のPbufのj番目以外全て0の状態にする
						
					//------------------------------------------------
					//ステム信号線の正常値がXbitじゃない場合
					//------------------------------------------------
					if((x_buff&p_buff)==0){

						//==========================================
						// 2時刻目正常値 == 1
						//==========================================
						if(x_buff != 0){	//i番目に1が立ってる
								
							*det_tp_list |= MASKbit[i];						//det_tp_listのi番目に『1』を立てる
							tp_id = (ui_num*32)+i;							//テストパターン番号を求める
							
							//--------------------------------------
							// 1時刻目正常値 == 0
							//--------------------------------------
							if(sffr[ffr_id].FoutStem->xid_det_str == NO){

								if( (stem_net->xid_nval_t1->x_buf[ui_num] & MASKbit[i])==0 && (stem_net->xid_nval_t1->p_buf[ui_num] & MASKbit[i])!=0){
								
									//【立上り遷移故障(0→1/0)を検出】検出情報更新
									//一番最後のunsigned intの未使用bit対策
									if(tp_id < n_tp){
										
										sffr[ffr_id].FoutStem->xid_det_str = YES;	
										
										//検出情報更新
										if(sffr[ffr_id].FoutStem->test_str == YES){
											sffr[ffr_id].n_xid_detect++;					//対象FFR内の検出故障数更新
											n_xid_detect++;								//X抽出後テスト集合の検出故障数更新
										}						
#ifdef DEBUG
										printf("tp[%d] CPT: STR(0→1/0) %s\n", tp_id, sffr[ffr_id].FoutStem->name);
#endif
									}
								}
							}
							
							//一番最後のunsigned intの未使用bit対策
							if(tp_id < n_tp){
								//正常値1のCPT開始
								TDF_3v_XID_PPSFP_CPT1(ffr_id, tp_id, stem_net);
							}
						}
								
						//==========================================
						// 2時刻目正常値 == 0
						//==========================================
						else{	//全部0になった

							*det_tp_list |= MASKbit[i];					//det_tp_listのi番目に『1』を立てる
							tp_id = (ui_num*32)+i;							//テストパターン番号を求める

							//--------------------------------------
							// 1時刻目正常値 == 1
							//--------------------------------------							
							if(sffr[ffr_id].FoutStem->xid_det_stf == NO){

								if( (stem_net->xid_nval_t1->x_buf[ui_num] & MASKbit[i])!=0 && (stem_net->xid_nval_t1->p_buf[ui_num] & MASKbit[i])==0){
									
									//一番最後のunsigned intの未使用bit対策
									if(tp_id < n_tp){
										
										//【立下り遷移故障(1→0/1)を検出】検出情報更新
										sffr[ffr_id].FoutStem->xid_det_stf = YES;	
										
										//検出情報更新
										if(sffr[ffr_id].FoutStem->test_stf == YES){
											sffr[ffr_id].n_xid_detect++;					//対象FFR内の検出故障数更新
											n_xid_detect++;								//X抽出後テスト集合の検出故障数更新
										}
#ifdef DEBUG
										printf("tp[%d] CPT: STF(1→0/1) %s\n", tp_id, sffr[ffr_id].FoutStem->name);
#endif							
									}
								}
							}
							
							//一番最後のunsigned intの未使用bit対策
							if(tp_id < n_tp){
								//正常値0のCPT開始
								TDF_3v_XID_PPSFP_CPT0(ffr_id, tp_id, stem_net);
							}
						}
					}
				}
			}
		}
	}
	
}
