//------------------------------------------------------------------------
//File name : search_input_corn.c
//Date : 2014/1/17
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"./cpi_analyze.h"
#include	"../../Netlist/s_netlist.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//--------------------------------------------------------------------
//定義
//--------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

//---------------------------------------------------------------------
// 外部宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 静的変数
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 外部関数
//---------------------------------------------------------------------
	//#define DEBUG

//------------------------------------------------------------
// 関数名 : search_input_corn
// 機能   : 制御ポイント挿入箇所から入力方向へ信号線探索
// 戻り値 : なし
// 引数   : なし
//------------------------------------------------------------
void search_input_corn(){

	int			i,j;
	S_NLIST		*temp;
	

#ifdef DEBUG
	printf("\n//-------------------------------------\n");
	printf("//入力側探索\n");
	printf("//-------------------------------------\n");
#endif

	//======================================================
	// キュー初期化
	//======================================================
	reset_queue(nl_queue);
	
	
	//======================================================
	// 入力方向へコーン探索 
	//======================================================
	for(i=0; i<n_cpi; i++){
		
#ifdef DEBUG
		printf("開始信号線(FF):%s\n", cpi_list[i].net->name);
#endif
		//対象FFをエンキュー
		enqueue(nl_queue, (void*)cpi_list[i].net);

		//対象FF(PPI)にフラグ設置
		Set_NINT_One(cpi_list[i].net->cpi_ana_in_flag, i);

		//到達可能信号線情報の更新(自分自身)
		cpi_list[i].n_corn_in_net++;


		//探索
		while((temp = (S_NLIST *)dequeue(nl_queue)) != (S_NLIST *)NULL){	//空になるまでデキュー
			
			//入力信号線数回ループ
			for(j=0; j<temp->n_in; j++){
				
				//未探索信号線
				if(Get_NBit_INT(temp->in[j]->cpi_ana_in_flag, i) == 0){
					//PI or PPIまで到達した場合：到達可能PPI数の更新
					if(temp->in[j]->type==IN || temp->in[j]->type==DFF){
#ifdef DEBUG
						printf("PPI:%s\n", temp->in[j]->name);
#endif
						cpi_list[i].n_corn_ppi++;						//到達可能PPI数更新
						cpi_list[i].n_corn_in_net++;					//到達可能入力信号線数更新
						Set_NINT_One(temp->in[j]->cpi_ana_in_flag, i);		//探索済みフラグチェック
					}				
				
					//その他：エンキューし探索続行
					else{
						Set_NINT_One(temp->in[j]->cpi_ana_in_flag, i);		//探索済みフラグチェック
						enqueue(nl_queue, (void*)temp->in[j]);			//入力信号線をエンキュー
#ifdef DEBUG
						printf("入力側:%s\n", temp->in[j]->name);
#endif
					}
				}
			}
		}
	}

}