//------------------------------------------------------------------------
//File name : search_output_corn.c
//Date : 2014/1/17
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"./cpi_analyze.h"
#include	"../../Netlist/s_netlist.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//--------------------------------------------------------------------
//定義
//--------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

//---------------------------------------------------------------------
// 外部宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 静的変数
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 外部関数
//---------------------------------------------------------------------
	//#define DEBUG

//------------------------------------------------------------
// 関数名 : search_output_corn
// 機能   : 制御ポイント挿入箇所から出力方向へ信号線探索
// 戻り値 : なし
// 引数   : なし
//------------------------------------------------------------
void search_output_corn(){
	
	int			i,j;
	S_NLIST		*temp;


#ifdef DEBUG
	printf("\n//-------------------------------------\n");
	printf("//出力側探索\n");
	printf("//-------------------------------------\n");
#endif

	//======================================================
	// キュー初期化
	//======================================================
	reset_queue(nl_queue);
	

	//======================================================
	// 出力方向へコーン探索 
	//======================================================
	for(i=0; i<n_cpi; i++){

#ifdef DEBUG
		printf("開始信号線(FF):%s\n", cpi_list[i].net->name);
#endif
		//対象FFをエンキュー
		enqueue(nl_queue, (void*)cpi_list[i].net);

		//対象FF(PPI)にフラグ設置
		Set_NINT_One(cpi_list[i].net->cpi_ana_out_flag, i);

		//到達可能信号線情報の更新(自分自身)
		cpi_list[i].n_corn_out_net++;


		//探索
		while((temp = (S_NLIST *)dequeue(nl_queue)) != (S_NLIST *)NULL){	//空になるまでデキュー
			
			//出力信号線数回ループ
			for(j=0; j<temp->n_out; j++){
				
				//PPOまで到達した場合：到達可能PPO数の更新
				if(Get_NBit_INT(temp->out[j]->cpi_ana_out_flag, i)==0 && temp->out[j]->ppo_flag==YES){
#ifdef DEBUG
					printf("PPO:%s\n", temp->out[j]->name);
#endif
					cpi_list[i].n_corn_ppo++;							//到達可能PPO数更新
					cpi_list[i].n_corn_out_net++;						//到達可能出力信号線数更新
					Set_NINT_One(temp->out[j]->cpi_ana_out_flag, i);	//探索済みフラグチェック
				}				
				
				//その他でテスト対象信号線の場合：エンキューし探索続行
				else if(Get_NBit_INT(temp->out[j]->cpi_ana_out_flag, i)==0 && temp->out[j]->testable_net==YES){
					Set_NINT_One(temp->out[j]->cpi_ana_out_flag, i);	//探索済みフラグチェック
					enqueue(nl_queue, (void*)temp->out[j]);				//出力信号線をエンキュー
#ifdef DEBUG
					printf("出力側:%s\n", temp->out[j]->name);
#endif
				}
			}
		}
	}

}