//------------------------------------------------------------------------
//論理SIM結果とstilファイル出力期待値の比較
//File name : comp_exp_combinational.c
//Date : 2013/10/6
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../StandardHead.h"
#include	"../option.h"
#include	"../Lib/alloc.h"

//------------------------------------------------------------------------
// プロタイプ宣言
//------------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

	//#define DEBUG

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//------------------------------------------------------------------------
//  関数名 : comp_exp_2v_combinational
//  機  能 : 【2値組合せ回路】論理SIM結果とstilファイル出力期待値の比較
//  戻り値 : なし
//  引  数 : テストパターンファイルポインタ
//------------------------------------------------------------------------
void comp_exp_2v_combinational(FILE *fp){

	int				i,j;
	char			temp[MAXN];
	char			get_temp;
	
	//===========================================================================
	// ファイルポインタを先頭に戻す
	//===========================================================================
	rewind(fp);

#ifdef DEBUG
	
	printf("\nPOピン配列\n");
	for(j=0; j<n_po; j++){
		printf("%s \n", po[j]->name);
	}
#endif

	//===========================================================================
	// 出力期待値比較
	//===========================================================================
	//--------------------------------------------
	//テストパターン番号初期化
	//--------------------------------------------
	i = 0;
	
	//--------------------------------------------
	//出力期待値比較
	//--------------------------------------------
	do{
		
		//--------------------------------------------
		//Callがある場所までポインタを移動
		//--------------------------------------------
		while(fgets(temp,MAXN,fp) !=NULL){
			if(strstr(temp,"Call")!=NULL){
				break;
			}
		}

		//--------------------------------------------
		//PO番号初期化
		//--------------------------------------------
#ifdef DEBUG
		printf("\n%dパターン目LSIM結果(PO)\n", i);
		for(j=0; j<n_ppi; j++){
			if(Get_NBit_Xbuf(po[j]->nval, i) == 1){
				printf("H");
			}
			else if(Get_NBit_Xbuf(po[j]->nval, i) == 0){
				printf("L");
			}
		}
		printf("\n");
#endif		
		j = 0;

		//--------------------------------------------
		//1行読み込み
		//--------------------------------------------
		get_temp = fgetc(fp);
	
		//--------------------------------------------
		// ; まで移動
		//--------------------------------------------
		do{
			get_temp = fgetc(fp);
		}while(get_temp!=';');

		//--------------------------------------------
		// = まで移動
		//--------------------------------------------
		do{
			get_temp = fgetc(fp);
		}while(get_temp!='=');
		
		//--------------------------------------------
		//;までの間(出力期待値)を論理SIM結果と比較
		//--------------------------------------------
		do{
			//POの出力期待値を取得
			get_temp = fgetc(fp);

			//比較
			if(get_temp == 'H'){
				if(Get_NBit_Xbuf(po[j]->nval, i) != 1){
					printf("\n//--------------------------------------------------\n");
					printf("//ERROR: 出力期待値比較\n");
					printf("//--------------------------------------------------\n");
					printf("%dパターン目のPO[%d]の出力期待値が異なります！\n", i, j);
					exit(-1);
				}
			}
			else if(get_temp == 'L'){
				if(Get_NBit_Xbuf(po[j]->nval, i) != 0){
					printf("\n//--------------------------------------------------\n");
					printf("//ERROR: 出力期待値比較\n");
					printf("//--------------------------------------------------\n");
					printf("%dパターン目のPO[%d]の出力期待値が異なります！\n", i, j);
					exit(-1);
				}
			}

			//PO番号更新
			j++;

		}while(get_temp!=';');

		i++;

	}while(i != n_tp);

	

#ifdef DEBUG
	printf("出力期待値比較終了\n");
#endif
	
}


//------------------------------------------------------------------------
//  関数名 : comp_exp_3v_combinational
//  機  能 : 【3値組合せ回路】論理SIM結果とstilファイル出力期待値の比較
//  戻り値 : なし
//  引  数 : テストパターンファイルポインタ
//------------------------------------------------------------------------
void comp_exp_3v_combinational(FILE *fp){

	int				i,j;
	char			temp[MAXN];
	char			get_temp;
	
	//===========================================================================
	// ファイルポインタを先頭に戻す
	//===========================================================================
	rewind(fp);

#ifdef DEBUG
	
	printf("\nPOピン配列\n");
	for(j=0; j<n_po; j++){
		printf("%s \n", po[j]->name);
	}
#endif

	//===========================================================================
	// 出力期待値比較
	//===========================================================================
	//--------------------------------------------
	//テストパターン番号初期化
	//--------------------------------------------
	i = 0;
	
	//--------------------------------------------
	//出力期待値比較
	//--------------------------------------------
	do{
		
		//--------------------------------------------
		//Callがある場所までポインタを移動
		//--------------------------------------------
		while(fgets(temp,MAXN,fp) !=NULL){
			if(strstr(temp,"Call")!=NULL){
				break;
			}
		}

		//--------------------------------------------
		//PO番号初期化
		//--------------------------------------------
#ifdef DEBUG
		printf("\n%dパターン目LSIM結果(PO)\n", i);
		for(j=0; j<n_ppi; j++){
			if(Get_NBit(po[j]->nval, i) == 1){
				printf("H");
			}
			else if(Get_NBit(po[j]->nval, i) == 0){
				printf("L");
			}
			else if(Get_NBit(po[j]->nval, i) == 3){
				printf("N");
			}
		}
		printf("\n");
#endif		
		j = 0;

		//--------------------------------------------
		//1行読み込み
		//--------------------------------------------
		get_temp = fgetc(fp);
	
		//--------------------------------------------
		// ; まで移動
		//--------------------------------------------
		do{
			get_temp = fgetc(fp);
		}while(get_temp!=';');

		//--------------------------------------------
		// = まで移動
		//--------------------------------------------
		do{
			get_temp = fgetc(fp);
		}while(get_temp!='=');
		
		//--------------------------------------------
		//;までの間(出力期待値)を論理SIM結果と比較
		//--------------------------------------------
		do{
			//POの出力期待値を取得
			get_temp = fgetc(fp);

			//比較
			if(get_temp == 'H'){
				if(Get_NBit(po[j]->nval, i) != 1){
					printf("\n//--------------------------------------------------\n");
					printf("//ERROR: 出力期待値比較\n");
					printf("//--------------------------------------------------\n");
					printf("%dパターン目のPO[%d]の出力期待値が異なります！\n", i, j);
					exit(-1);
				}
			}
			else if(get_temp == 'L'){
				if(Get_NBit(po[j]->nval, i) != 0){
					printf("\n//--------------------------------------------------\n");
					printf("//ERROR: 出力期待値比較\n");
					printf("//--------------------------------------------------\n");
					printf("%dパターン目のPO[%d]の出力期待値が異なります！\n", i, j);
					exit(-1);
				}
			}
			else if(get_temp == 'N'){
				if(Get_NBit(po[j]->nval, i) != 3){
					printf("\n//--------------------------------------------------\n");
					printf("//ERROR: 出力期待値比較\n");
					printf("//--------------------------------------------------\n");
					printf("%dパターン目のPO[%d]の出力期待値が異なります！\n", i, j);
					exit(-1);
				}
			}

			//PO番号更新
			j++;

		}while(get_temp!=';');

		i++;

	}while(i != n_tp);

	

#ifdef DEBUG
	printf("出力期待値比較終了\n");
#endif
	
}