//------------------------------------------------------------------------
//File name : rep_flist
//Date : 2011/6/28
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>

#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../StandardHead.h"

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define FLIST_DEBUG

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	saf_rep_flist();
void	tdf_rep_flist();


//----------------------------------------------
//関数名：rep_flist
//機能　：代表故障設定(Representative Fault Set)
//引数　：なし
//戻り値：なし
//----------------------------------------------
void rep_flist(){

	//===================================
	// 縮退故障の場合
	//===================================
	if(opt.fmodel == SAF){
		saf_rep_flist();
	}
	//===================================
	// 遷移故障の場合
	//===================================
	else if(opt.fmodel == TDF){
		tdf_rep_flist();
	}

}//END


//----------------------------------------------
//関数名：saf_rep_flist
//機能　：縮退故障の代表故障設定
//引数　：なし
//戻り値：なし
//----------------------------------------------
void saf_rep_flist(){

	int		i,j;
	
	//============================================
	// 代表故障数初期化
	//============================================
	n_rep = n_net*2;
	
	//============================================
	// テスト対象フラグ初期化
	//============================================
	for(i=0; i<n_net; i++){
		nl[i].test_sf0 = YES;
		nl[i].test_sf1 = YES;
	}
	
	//============================================
	// 等価故障解析(テスト対象から外していく)
	//============================================
	for(i=0; i<n_net; i++){
		switch( nl[i].type){
			//------------------------------------------
			case BUF:
			case INV:
				//入力信号線の故障は等価
				nl[i].in[0]->test_sf0 = NO;
				nl[i].in[0]->test_sf1 = NO;

				//代表故障数を減らす
				n_rep -= 2;
				break;
			//------------------------------------------
			case AND:
			case NAND:
				//入力信号線の0縮退故障は等価
				for(j=0; j<nl[i].n_in; j++){
					nl[i].in[j]->test_sf0 = NO;
				}

				//代表故障数を減らす
				n_rep -= nl[i].n_in;
				break;
			//------------------------------------------
			case OR:
			case NOR:
				//入力信号線の1縮退故障は等価
				for(j=0; j<nl[i].n_in; j++){
					nl[i].in[j]->test_sf1 = NO;
				}

				//代表故障数を減らす
				n_rep -= nl[i].n_in;
				break;
			//------------------------------------------
			default:
				break;
			//------------------------------------------
		}

	}

#ifdef FLIST_DEBUG
	printf("\n//------------------------------\n");
	printf("// DEBUG：代表故障リスト\n");
	printf("//------------------------------\n");
	for(i=0; i<n_net; i++){
		if(nl[i].test_sf0 == YES){
			printf("SF0 %s\n", nl[i].name);
		}
		if(nl[i].test_sf1 == YES){
			printf("SF1 %s\n", nl[i].name);
		}
	}
#endif
	

}//END


//----------------------------------------------
//関数名：tdf_rep_flist
//機能　：遷移故障の代表故障設定
//引数　：なし
//戻り値：なし
//----------------------------------------------
void tdf_rep_flist(){

	int i;

	//============================================
	// 代表故障数初期化
	//============================================
	n_rep = n_snet*2;
	
	//============================================
	// テスト対象フラグ初期化
	//============================================
	for(i=0; i<n_snet; i++){
		s_nl[i].test_str = YES;
		s_nl[i].test_stf = YES;
	}
	
	//============================================
	// 等価故障解析(テスト対象から外していく)
	//============================================
	for(i=0; i<n_snet; i++){
		if(s_nl[i].type==BUF || s_nl[i].type==INV){
			//入力信号線の故障は等価
			s_nl[i].in[0]->test_str = NO;
			s_nl[i].in[0]->test_stf = NO;

			//代表故障数を減らす
			n_rep -= 2;
		}
	}	

}//END