//------------------------------------------------------------------------
//File name : cal_cpi_utilization.c
//Date : 2013/12/1
//Designer : H.Yamazaki
//Ver : 0.01
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<time.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

#define	DEBUG

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：cal_cpi_utilization
//機能　：制御ポイント信号線(CP)のケアビット率(使用率)計算
//引数　：なし
//戻り値：なし
//--------------------------------------------------------------------
void cal_cpi_utilization(){

	int			i,j;
	int			n_c = 0;	//ケアビット数
			
	//=========================================================
	// 制御ポイント信号線(CP)のケアビット率(使用率)計算
	//=========================================================
	for(i=0; i<n_tp; i++){
		
		//FFC=1の信号線なら計算
		for(j=0; j<n_ffc; j++){
			if(Get_NBit(ffc[j]->nval_t1, i) == 1){
								
				//CPに含まれるケアビット数計算
				if(Get_NBit(ffc[j]->link_cpi[0]->link_cpi[0]->xid_nval_t1, i) != 3){
					n_c++;
				}
			}
		}
	}

	printf("制御ポイント(CP)使用率: %.2lf%%\n", ((double)n_c/(double)(n_tp*n_cpi))*100 );
	
}