//------------------------------------------------------------------------
//File name : set_cpi_value
//Date : 2013/11/18
//Designer : H.Yamazaki
//Ver : 0.02
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<string.h>
#include	<stdlib.h>

#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../StandardHead.h"

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//----------------------------------------------
//関数名：set_cpi_value
//機能　：【遷移故障】制御ポイント挿入後付加信号線(PI)の論理値をLSIM値から格納
//引数　：なし
//戻り値：なし
//----------------------------------------------
void set_cpi_value(){

	int		i,j;
	int		val;

	//======================================================
	// 2値の場合
	//======================================================
	if(n_before_x == 0){

		for(i=n_se_input; i<(n_se_input+(n_sdff/2)); i++){

			//対応PPIの2時刻目値をテストパターンとして保持
			for(j=0; j<n_tp; j++){

				//対応FFの2時刻目値を取得
				val = Get_NBit_Xbuf(pi_tp[i].sinput->link_cpi[0]->nval_t2, j);

				//0の場合
				if(val == 0){
					Set_NBit_Zero(pi_tp[i].tp, j);
				}

				//1の場合
				else if(val == 1){
					Set_NBit_One(pi_tp[i].tp, j);
				}
			}
		}
	}
	
	//======================================================
	// 3値の場合
	//======================================================
	else{

		for(i=n_se_input; i<(n_se_input+(n_sdff/2)); i++){
			
			//対応PPIの2時刻目値をテストパターンとして保持
			for(j=0; j<n_tp; j++){

				//対応FFの2時刻目値を取得
				val = Get_NBit(pi_tp[i].sinput->link_cpi[0]->nval_t2, j);

				//0の場合
				if(val == 0){
					Set_NBit_Zero(pi_tp[i].tp, j);
				}

				//1の場合
				else if(val == 1){
					Set_NBit_One(pi_tp[i].tp, j);
				}

				//Xの場合
				else if(val == 3){
					Set_NBit_X(pi_tp[i].tp, j);
				}
			}
		}
	}

}