//------------------------------------------------------------------------
//File name : read_flist
//Date : 2011/6/28
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<string.h>
#include	<stdlib.h>

#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../StandardHead.h"

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

//==========================
//|  ・縮退故障リスト	   |
//|  (故障タイプ 信号線名) |
//==========================
//|  SF0 a				   |
//|  SF1 b				   |
//|  SF1 c				   |
//==========================


//==========================
//| ・遷移故障リスト	   |
//| (故障タイプ 信号線名)  |
//==========================
//| STR a				   |
//| STF b				   |
//| STR c				   |
//==========================

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	saf_read_flist(FILE *);
void	tdf_read_flist(FILE *);


//----------------------------------------------
//関数名：read_flist
//機能　：故障リスト読み込み
//引数　：故障リストファイルポインタ
//戻り値：なし
//----------------------------------------------
void read_flist(FILE *fp){

	//===================================
	// 縮退故障の場合
	//===================================
	if(opt.fmodel == SAF){
		saf_read_flist(fp);
	}
	//===================================
	// 遷移故障の場合
	//===================================
	else if(opt.fmodel == TDF){
		tdf_read_flist(fp);
	}

}//END


//----------------------------------------------
//関数名：saf_read_flist
//機能　：縮退故障のテスト対象故障設定(ファイル読み込み)
//引数　：故障リストファイルポインタ
//戻り値：なし
//----------------------------------------------
void saf_read_flist(FILE *fp){

	int i;

	char str[MAXN];
	char *net;		//信号線名
	char *flt;		//故障タイプ
	int  sav;		//故障タイプ(define値一時保存)
	int  count;		//テスト対象故障数

	//============================================
	// 初期化
	//============================================
	count = 0;
	
	//============================================
	// テスト対象フラグ初期化
	//============================================
	for(i=0; i<n_net; i++){
		nl[i].test_sf0 = NO;
		nl[i].test_sf1 = NO;
	}
	
	//============================================
	// 故障リスト読み込み(テスト対象にしていく)
	//============================================
	while(fgets(str,MAXN,fp)!=NULL){

		//------------------------------
		//故障タイプ読込み
		//------------------------------
		flt = strtok(str," \t,\n");
		
		//------------------------------
		//信号線名読込み
		//------------------------------
		net = strtok('\0'," ,\t\n");
		
		//------------------------------
		//故障タイプ判定
		//------------------------------
		if(!strcmp(flt,"SF0")){
			sav = 0;	//0縮退故障
		}
		else if(!strcmp(flt,"SF1")){
			sav = 1;	//1縮退故障
		}
		else{
			fprintf(stderr,"Fault list wrong!\n");
			exit(-1);
		}
		//------------------------------
		//故障信号線探索
		//------------------------------
		for(i=0; i<n_net; i++){
			if(!strcmp(net,nl[i].name)){
				if(sav == 0){
					nl[i].test_sf0 = YES;
					count++;
					break;
				}
				else if(sav == 1){
					nl[i].test_sf1 = YES;
					count++;
					break;
				}
			}
		}
		//テスト対象とする信号線がない
		if(i==n_net){
			fprintf(stderr,"Not found fault signal : %s\n",net);

			//見つからなかった個数をカウント
			n_not_found_fault++;
		}
	}//while

	
	//============================================
	// テスト対象(代表)故障数代入
	//============================================
	n_rep = count;

	//============================================
	// ファイルクローズ
	//============================================
	fclose(fp);

}//END


//----------------------------------------------
//関数名：tdf_read_flist
//機能　：遷移故障のテスト対象故障設定(ファイル読み込み)
//引数　：故障リストファイルポインタ
//戻り値：なし
//----------------------------------------------
void tdf_read_flist(FILE *fp){

	int i;

	char str[MAXN];
	char temp[MAXN];
	char *net;		//信号線名
	char *flt;		//故障タイプ
	int  sav;		//故障タイプ(define値一時保存)
	int  count;		//テスト対象故障数

	//============================================
	// 初期化
	//============================================
	count = 0;
	
	//============================================
	// テスト対象フラグ初期化
	//============================================
	for(i=0; i<n_snet; i++){
		s_nl[i].test_str = NO;
		s_nl[i].test_stf = NO;
	}
	
	//============================================
	// 故障リスト読み込み(テスト対象にしていく)
	//============================================
	while(fgets(str,MAXN,fp)!=NULL){

		//------------------------------
		//故障タイプ読込み
		//------------------------------
		flt = strtok(str," \t,\n");
		
		//------------------------------
		//信号線名読込み
		//------------------------------
		net = strtok('\0'," ,\t\n");
		
		//------------------------------
		//故障タイプ判定
		//------------------------------
		if(!strcmp(flt,"STR")){
			sav = 0;	//立上り遷移故障(0→1/0)
		}
		else if(!strcmp(flt,"STF")){
			sav = 1;	//立下り遷移故障(1→0/1)
		}
		else{
			fprintf(stderr,"Fault list wrong!\n");
			exit(-1);
		}
		//------------------------------
		//故障信号線探索
		//------------------------------
		for(i=0; i<n_snet; i++){
			if(!strcmp(net,s_nl[i].name)){
				if(sav == 0){
					s_nl[i].test_str = YES;	//故障設置
					count++;
					break;
				}
				else if(sav == 1){
					s_nl[i].test_stf = YES;	//故障設置
					count++;
					break;
				}
			}
		}
		//テスト対象とする信号線がない
		if(i==n_snet){
			//------------------------------------------
			// CPI_XIDモードの場合：名前を変えて再探索(制御ポイントの影響で名前が変わっている可能性あり)
			//------------------------------------------
			if(opt.cpi_xid==YES || opt.cpi_fsim==YES){

				//現在の信号線名をコピー
				strcpy(temp, net);

				//最後の文字を消す
				temp[(strlen(temp)-1)] = '\0';

				//最後に『tpi_and_0_A』を連結
				strcat(temp, "tpi_and_0_A");

				//再探索
				for(i=0; i<n_snet; i++){
					if(!strcmp(temp,s_nl[i].name)){
						if(sav == 0){
							s_nl[i].test_str = YES;	//故障設置
							count++;
							break;
						}
						else if(sav == 1){
							s_nl[i].test_stf = YES;	//故障設置
							count++;
							break;
						}
					}
				}

				//再探索しても無い場合は警告
				if(i==n_snet){
					fprintf(stderr,"Not found fault signal : %s\n",net);
					
					//見つからなかった個数をカウント
					n_not_found_fault++;
				}
			}
			//------------------------------------------
			// その他：ERROR
			//------------------------------------------
			else{
				fprintf(stderr,"Not found fault signal : %s\n",net);

				//見つからなかった個数をカウント
				n_not_found_fault++;
			}
		}
	}//while

	
	//============================================
	// テスト対象(代表)故障数代入
	//============================================
	n_rep = count;

	//============================================
	// ファイルクローズ
	//============================================
	fclose(fp);

}//END