//------------------------------------------------------------------------
//File name : cpi_analyze_main.c
//Date : 2014/1/17
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	"../../option.h"
#include	"../../Lib/bit_int.h"
#include	"../../Netlist/s_netlist.h"
#include	"../../StandardHead.h"
#include	"./cpi_analyze.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	read_analyze_cpi_list		(FILE*);
void	search_output_corn			();
void	search_input_corn			();


//--------------------------------------------------------------------
//定義
//--------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

//---------------------------------------------------------------------
// 外部宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 静的変数
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 外部関数
//---------------------------------------------------------------------
//------------------------------------------------------------
// 関数名 : cpi_analyze_main
// 機能   : 制御ポイント挿入箇所解析
// 戻り値 : なし
// 引数   : list(CPI解析リスト), log(解析結果ログ)
//------------------------------------------------------------
void cpi_analyze_main(FILE	*list, FILE	*log){

	int				i,j;
	int				n_total_out=0;		//全CPIからの出力側全範囲
	int				n_total_in=0;		//全CPIからの入力側全範囲	
	int				n_total_ppo=0;		//全CPIからの出力側全範囲
	int				n_total_ppi=0;		//全CPIからの入力側全範囲

	
	//===================================================
	// コマンドチェック
	//===================================================
	if(opt.cpi_analyze==NO || opt.cpi_ana_list==NO || opt.cpi_ana_log==NO){
		printf("解析ファイルかログファイルのどちらかが足りません！\n");
		exit(-1);
	}

	printf("\n//-----------------------------------------\n");
	printf("// 制御ポイント挿入箇所解析モード\n");
	printf("//-----------------------------------------\n");
	printf("START\n");


	//===================================================
	// 解析対象ファイル読み込み
	//===================================================
	read_analyze_cpi_list(list);
	
	
	//===================================================
	// ネットリスト構造体へフラグ確保
	//===================================================
	for(i=0; i<n_snet; i++){
		s_nl[i].cpi_ana_out_flag = Alloc_Bit_INT((unsigned int)n_cpi);
		s_nl[i].cpi_ana_in_flag = Alloc_Bit_INT((unsigned int)n_cpi);
	}
	

	//===================================================
	// 出力側へのコーン探索
	//===================================================
	search_output_corn();
	

	//===================================================
	// 入力側へのコーン探索
	//===================================================
	search_input_corn();
	

	//===================================================
	// 解析結果ログファイル出力
	//===================================================
	//----------------------------------------------
	// 各CPIからの個別情報
	//----------------------------------------------
	for(i=0; i<n_cpi; i++){
		fprintf(log, "%s	%s	level:	%d	到達可能PPO数:	%d	到達可能PPI数:	%d	出力コーン信号線数:	%d	入力コーン信号線数:	%d\n",
			cpi_list[i].ffc_name_ins, cpi_list[i].ff_name, cpi_list[i].net->in[0]->level, 
			cpi_list[i].n_corn_ppo, cpi_list[i].n_corn_ppi, cpi_list[i].n_corn_out_net, cpi_list[i].n_corn_in_net);
	}
	
	//----------------------------------------------
	// 全CPIからの合計情報
	//----------------------------------------------
	//入出力コーンの累計計算
	for(i=0; i<n_snet; i++){

		//出力側の累計計算
		for(j=0; j<n_cpi; j++){
			if(Get_NBit_INT(s_nl[i].cpi_ana_out_flag, j)==1){
				n_total_out++;
				break;
			}
		}
		
		//入力側の累計計算
		for(j=0; j<n_cpi; j++){
			if(Get_NBit_INT(s_nl[i].cpi_ana_in_flag, j)==1){
				n_total_in++;
				break;
			}
		}
	}

	//累計PPI数の計算
	for(i=0; i<n_ppi; i++){
		for(j=0; j<n_cpi; j++){
			if(Get_NBit_INT(ppi[i]->cpi_ana_in_flag, j)==1){
				n_total_ppi++;
				break;
			}
		}
	}
	//累計PI数の計算
	for(i=0; i<n_spi; i++){
		for(j=0; j<n_cpi; j++){
			if(Get_NBit_INT(spi[i]->cpi_ana_in_flag, j)==1){
				n_total_ppi++;
				break;
			}
		}
	}

	//累計PPO数の計算
	for(i=0; i<n_ppo; i++){
		for(j=0; j<n_cpi; j++){
			if(Get_NBit_INT(ppo[i]->cpi_ana_out_flag, j)==1){
				n_total_ppo++;
				break;
			}
		}
	}

	fprintf(log, "最大レベル:	%d	総信号線数:	%d	テスト可能信号線数:	%d	合計到達可能出力数:	%d	合計到達可能入力数:	%d	合計PPO数:	%d	合計PPI数:	%d\n"
		,max_level, n_snet, n_testable_net, n_total_out, n_total_in, n_total_ppo, n_total_ppi);

	
	printf("END (プログラムを終了します)\n");
	exit(2);
}