//------------------------------------------------------------------------
//File name : read_analyze_cpi_list.c
//Date : 2014/1/17
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"./cpi_analyze.h"
#include	"../../Netlist/s_netlist.h"


//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//--------------------------------------------------------------------
//定義
//--------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

//---------------------------------------------------------------------
// 外部宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 静的変数
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 外部関数
//---------------------------------------------------------------------
	#define	DEBUG

//------------------------------------------------------------
// 関数名 : read_analyze_cpi_list
// 機能   : 制御ポイント挿入箇所解析リストのファイル読み込み
// 戻り値 : なし
// 引数   : fp(制御ポイント挿入箇所解析ファイル)
//
//【ファイルフォーマット】
// FFCインスタンス名 オリジナルFF名
//	・
//	・
//	・
//------------------------------------------------------------
void read_analyze_cpi_list(FILE	*fp){

	int		i,j;
	char	str[MAXN];
	char	*net;
	
	//=====================================================
	// 制御ポイント挿入数カウント
	//=====================================================
	//制御ポイント挿入数初期化
	n_cpi = 0;

	//制御ポイント挿入数カウント
	while(fgets(str,MAXN,fp)!=NULL)n_cpi++;
	
#ifdef DEBUG
	printf("制御ポイント挿入数：%d\n", n_cpi);
#endif

	//ファイルポインタを先頭に戻す
	rewind(fp);

	//=====================================================
	//メモリ確保と初期化
	//=====================================================
	cpi_list = (CPI_LIST*)malloc(sizeof(CPI_LIST) * n_cpi);

	
	//CPIリスト構造体初期化
	for(i=0; i<n_cpi; i++){
		cpi_list[i].n_corn_in_net = 0;
		cpi_list[i].n_corn_out_net = 0;
		cpi_list[i].n_corn_ppi = 0;
		cpi_list[i].n_corn_ppo = 0;
	}
	
	//=====================================================
	//FFCインスタンス名とオリジナルFF名を格納
	//=====================================================
	i=0;
	while(fgets(str,MAXN,fp)!=NULL){
		
		//------------------------------------
		//FFCインスタンス名切り出し
		//------------------------------------
		net = strtok(str," ");

		//FFCインスタンス名保存
		strcpy(cpi_list[i].ffc_name_ins, net);
		
		//------------------------------------
		//オリジナルFF(PPI)名切り出し
		//------------------------------------
		net = strtok(NULL,"\n");

		//オリジナルFF名保存
		strcpy(cpi_list[i].ff_name, net);

#ifdef DEBUG
		printf("[%d]: FFC：%s オリジナルFF：%s\n", i, cpi_list[i].ffc_name_ins, cpi_list[i].ff_name);
#endif
		
		//------------------------------------
		//インデックス保存
		//------------------------------------
		cpi_list[i].n = i;

		//カウンタ更新
		i++;
	}
	
	//=====================================================
	// ネットリスト構造体(PPI)とポインタ接続(オリジナルFF名で探索)
	//=====================================================
	for(i=0; i<n_cpi; i++){
		for(j=0; j<n_ppi; j++){
			if(strcmp(cpi_list[i].ff_name, ppi[j]->name) == 0){
				cpi_list[i].net = ppi[j];
#ifdef DEBUG
				printf("cpi_list[%d].net: %s\n", i, cpi_list[i].net->name);
#endif
			}
		}
	}

}