//===========================================================-------------
//File name : TDF_Backward_Implication.c
//Date : 2013/10/13
//Designer : H.Yamazaki
//Ver : 0.01
//===========================================================-------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../Netlist/s_netlist.h"
#include	"../../Lib/bit_tp.h"
#include	"../../Lib/bit_int.h"
#include	"../../StandardHead.h"
#include	"../../option.h"
#include	"../Xidentification.h"

#include	<string.h>
//===========================================================----------
// プロトタイプ宣言
//===========================================================----------
void	TDF_0_Backward_Implication	(S_NLIST*, int, int, unsigned int);
void	TDF_1_Backward_Implication	(S_NLIST*, int, int, unsigned int);
void	TDF_0_Forward_Implication	(S_NLIST*, int, int);
void	TDF_1_Forward_Implication	(S_NLIST*, int, int);

//===========================================================----------
// 定義
//===========================================================----------

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//
	//#define		BIMPL_DEBUG
	//#define		BIT_DEBUG
//===========================================================-------------
//  静的変数
//===========================================================-------------

//===========================================================-------------
//  外部関数
//===========================================================-------------
//===========================================================-------------
//  外部関数
//===========================================================-------------
//----------------------------------------------
//  関数名 : TDF_0_Backward_Implication
//  機  能 : t_netの出力値が0からの後方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(後方含意判定信号線の出力信号線), tp_id(テストパターンの何番目か), time(時刻) jus_flag(正当化フラグ{jus_flag:1時刻目正当化, jus_flag+1:2時刻目正当化, jus_flag+2:1・2時刻目正当化})
//----------------------------------------------
void	TDF_0_Backward_Implication(S_NLIST* t_net, int tp_id, int time, unsigned int jus_flag){

	int			i, j, in;
	char		n_contorolling=0;	//制御値信号線の本数
	

#ifdef BIT_DEBUG

	int			k,x,y;

	for(k=0; k<n_snet; k++){
		//1時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t1, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t1, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 1時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 1時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		//2時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t2, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t2, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 2時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 2時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
	}
#endif
	
	switch(t_net->type){
		//********************************************************************
		case DFF:
			//===========================================================
			// 入力=0に後方含意可能 ← 出力=0
			//===========================================================
			//             ___________ 
			// 1時刻目     |   DFF    |         2時刻目
			// (PPO) 0 --->|D        Q|---> 0 (DFF = PPI)
			//             |          |
			//             |__________|
			//
			//      ※Q端子がtype:DFF
			//-----------------------------------------------------------
			// ■2時刻目の場合→1時刻目に遡る (※1時刻目の場合は何もしない)
			//-----------------------------------------------------------
			if(time == 2){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を0固定
					//------------------------------------------------
					Set_NBit_Zero(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定(時刻1 PPO):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
							//--------------------
							//2時刻目0固定
							//--------------------
							Set_NBit_Zero(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意0固定(時刻2 PPO):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}							
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに(1時刻目)後方含意判定
					//------------------------------------------------
					else{
						TDF_0_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				}
			}

			break;
		//********************************************************************
		case FOUT:
			//===========================================================
			// 入力=0に後方含意可能 ← 出力=0
			//===========================================================
			//         ______ 0(t_net)
			//        |
			//   0 ---|
			//        |______ 
			//                X(前方含意発生)

			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を0固定
					//------------------------------------------------
					Set_NBit_Zero(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定(時刻1):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
							//--------------------
							//2時刻目0固定
							//--------------------
							Set_NBit_Zero(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_0_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				
					//------------------------------------------------
					// ★ブランチ信号線の前方含意★
					//------------------------------------------------
					for(i=0; i<t_net->in[0]->n_out; i++){						
						if(Get_NBit(t_net->in[0]->out[i]->xid_nval_t1, tp_id) == 3){
							//入力(STEM)値1からの前方含意
							TDF_0_Forward_Implication(t_net->in[0]->out[i], tp_id, 1);
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を0固定
					//------------------------------------------------
					Set_NBit_Zero(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定(時刻2):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
							//--------------------
							//1時刻目0固定
							//--------------------
							Set_NBit_Zero(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPOの場合：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == YES){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}

							//--------------------
							//それ以外：1時刻目前方含意
							//--------------------
							else{
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t1, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 1);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}					
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_0_Backward_Implication(t_net->in[0], tp_id, 2, jus_flag);
					}
				
					//------------------------------------------------
					// ★ブランチがPPOでない場合：2時刻目前方含意
					//------------------------------------------------
					for(i=0; i<t_net->in[0]->n_out; i++){						
						if(Get_NBit(t_net->in[0]->out[i]->xid_nval_t2, tp_id) == 3){
							//入力(STEM)値1からの前方含意
							TDF_0_Forward_Implication(t_net->in[0]->out[i], tp_id, 2);
						}
					}
				}
			}
		break;
		//********************************************************************
		case BUF:
			//===========================================================
			// 出力=0(入力=0に後方含意可能)
			//===========================================================
			//        |＼
			//        |  ＼
			//   0 ---|BUF >--- 0(t_net)
			//        |  ／
			//        |／

			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を0固定
					//------------------------------------------------
					Set_NBit_Zero(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定(時刻1):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
							//--------------------
							//2時刻目0固定
							//--------------------
							Set_NBit_Zero(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_0_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を0固定
					//------------------------------------------------
					Set_NBit_Zero(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定(時刻2):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
							//--------------------
							//1時刻目0固定
							//--------------------
							Set_NBit_Zero(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPOの場合：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == YES){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}

							//--------------------
							//それ以外：1時刻目前方含意
							//--------------------
							else{
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t1, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 1);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_0_Backward_Implication(t_net->in[0], tp_id, 2, jus_flag);
					}
				}
			}

		break;
		//********************************************************************
		case INV:
			//===========================================================
			// 出力=0(入力=1に後方含意可能)
			//===========================================================
			//        |＼
			//        |  ＼
			//   1 ---|INV >○-- 0(t_net)
			//        |  ／
			//        |／

			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を1固定
					//------------------------------------------------
					Set_NBit_One(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定(時刻1):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
							//--------------------
							//2時刻目1固定
							//--------------------
							Set_NBit_One(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_1_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を1固定
					//------------------------------------------------
					Set_NBit_One(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定(時刻2):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
							//--------------------
							//1時刻目1固定
							//--------------------
							Set_NBit_One(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[0]->name);
#endif							
							//--------------------
							//PPOの場合：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == YES){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
							//--------------------
							//それ以外：1時刻目前方含意
							//--------------------
							else{
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t1, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 1);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_1_Backward_Implication(t_net->in[0], tp_id, 2, jus_flag);
					}
				}
			}

		break;
		//********************************************************************
		case AND:
			//===========================================================
			// 出力=0(入力の制御値0が1本なら後方含意可能，2本以上なら限定含意操作)
			//===========================================================
			//       ＿＿
			//   0 --|   ＼
			//   1 --| AND│--- 0(t_net)
			//   1 --|   ／
			//       ‾‾
			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//-----------------------------------
				// 入力信号線の制御値0の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit(t_net->in[i]->nval_t1, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				
				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻1):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == NO){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[in]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[in]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[in]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_0_Backward_Implication(t_net->in[in], tp_id, 1, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//2時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag+1){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(1時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}


			}
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//-----------------------------------
				// 入力信号線の制御値0の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit(t_net->in[i]->nval_t2, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}

				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻2):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == YES){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}

								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[in]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_0_Backward_Implication(t_net->in[in], tp_id, 2, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//1時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(2時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag+1 && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag+1;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}
			}
			
		break;
		//********************************************************************
		case NAND:
			//===========================================================
			// 出力=0(全入力が1に後方含意可能)
			//===========================================================
			//       ＿＿
			//   1 --|   ＼
			//   1 --|NAND│○-- 0(t_net)
			//   1 --|   ／
			//       ‾‾      ※全入力信号線=1 (非制御値)
			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == NO){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[i]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[i]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_1_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
						}
					}
				}
			}
			
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == YES){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}
								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_1_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
						}
					}
				}
			}

		break;
		//********************************************************************
		case OR:
			//===========================================================
			// 出力=0(全入力が0に後方含意可能)
			//===========================================================
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----) OR >--- 0
			//   0 --／   ／
			//       ‾‾      ※全入力信号線=0 (非制御値)
			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){
				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == NO){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[i]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[i]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_0_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == YES){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}

								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_0_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
						}
					}
				}
			}

		break;
		//********************************************************************
		case NOR:
			//===========================================================
			// 出力=0(入力の制御値1が1本なら後方含意可能，2本以上なら限定含意操作)
			//===========================================================
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----)NOR >○-- 0
			//   0 --／   ／
			//       ‾‾
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//-----------------------------------
				// 入力信号線の制御値1の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:1
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit(t_net->in[i]->nval_t1, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				
				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻1):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == NO){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[in]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[in]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[in]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_1_Backward_Implication(t_net->in[in], tp_id, 1, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//2時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag+1){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(1時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}


			}
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//-----------------------------------
				// 入力信号線の制御値1の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:1
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:1
						if(Get_NBit(t_net->in[i]->nval_t2, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}

				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻2):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == YES){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}
								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[in]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_1_Backward_Implication(t_net->in[in], tp_id, 2, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//1時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(2時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag+1 && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag+1;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//===========================================================
			// 出力=0 (※制御値が無いため2入力とも遡る(後方含意))
			//===========================================================
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//         ))EXOR>--- 0               ))EXOR>--- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			//===========================================================
			// 出力=1 (※制御値が無いため2入力とも遡る(後方含意))
			//===========================================================
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//        ))EXNOR>○-- 0             ))EXNOR>○-- 0
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){				
				for(i=0; i<t_net->n_in; i++){
					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){

						//---------------------------------------
						// 2値の場合
						//---------------------------------------
						if(n_before_x == 0){
							//■0固定
							if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
						}
					
						//---------------------------------------
						// 3値の場合
						//---------------------------------------
						else{
							//■0固定
							if(Get_NBit(t_net->in[i]->nval_t1, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
						}
					}
				}
			}
			
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				for(i=0; i<t_net->n_in; i++){
					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){

						//---------------------------------------
						// 2値の場合
						//---------------------------------------
						if(n_before_x == 0){
							//■0固定
							if(Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//1時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPOの場合：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == YES){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}

										//--------------------
										//それ以外：1時刻目前方含意
										//--------------------
										else{
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//1時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPOの場合：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == YES){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}

										//--------------------
										//それ以外：1時刻目前方含意
										//--------------------
										else{
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
						}
					
						//---------------------------------------
						// 3値の場合
						//---------------------------------------
						else{
							//■0固定
							if(Get_NBit(t_net->in[i]->nval_t2, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//1時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPOの場合：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == YES){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}

										//--------------------
										//それ以外：1時刻目前方含意
										//--------------------
										else{
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//1時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPOの場合：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == YES){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}

										//--------------------
										//それ以外：1時刻目前方含意
										//--------------------
										else{
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
						}
					}
				}
			}
		break;
		//********************************************************************
	}
}

//----------------------------------------------
//  関数名 : TDF_1_Backward_Implication
//  機  能 : t_netの出力値が1からの後方含意(再帰関数)
//  戻り値 : なし
//  引  数 :  t_net(後方含意判定信号線の出力信号線), tp_id(テストパターンの何番目か), time(時刻) jus_flag(正当化フラグ{jus_flag:1時刻目正当化, jus_flag+1:2時刻目正当化, jus_flag+2:1・2時刻目正当化})
//----------------------------------------------
void	TDF_1_Backward_Implication(S_NLIST* t_net, int tp_id, int time, unsigned int jus_flag){
	
	int			i, j, in;
	char		n_contorolling=0;	//制御値信号線の本数
		
#ifdef BIT_DEBUG

	int			k,x,y;

	
	for(k=0; k<n_snet; k++){
		//1時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t1, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t1, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 1時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 1時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		//2時刻目チェック
		x = Get_NBit(s_nl[k].xid_nval_t2, tp_id);
		y = Get_NBit_Xbuf(s_nl[k].nval_t2, tp_id);
		if(x==0 && y==1){
			printf("tp[%d] 2時刻目 %s : 1 → 0に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
		else if(x==1 && y==0){
			printf("tp[%d] 2時刻目 %s : 0 → 1に固定\n", tp_id, s_nl[k].name);
			exit(-1);
		}
	}
#endif
	
	switch(t_net->type){
		//********************************************************************
		case DFF:
			//===========================================================
			// 入力=1に後方含意可能 ← 出力=1
			//===========================================================
			//             ___________ 
			// 1時刻目     |   DFF    |         2時刻目
			// (PPO) 1 --->|D        Q|---> 1 (DFF = PPI)
			//             |          |
			//             |__________|
			//
			//      ※Q端子がtype:DFF
			//-----------------------------------------------------------
			// ■2時刻目の場合→1時刻目に遡る (※1時刻目の場合は何もしない)
			//-----------------------------------------------------------
			if(time == 2){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を1固定
					//------------------------------------------------
					Set_NBit_One(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定(時刻1 PPO):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
							//--------------------
							//2時刻目1固定
							//--------------------
							Set_NBit_One(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに(1時刻目)後方含意判定
					//------------------------------------------------
					else{
						TDF_1_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				}
			}
			break;
		//********************************************************************
		case FOUT:
			//===========================================================
			// 出力=1(入力=1に後方含意可能)
			//===========================================================
			//                      ______ 1(t_net)
			//                     |
			// (t_net->in[0]) 1 ---|
			//                     |______ 
			//                             X(前方含意発生)

			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線(ステム)を1固定
					//------------------------------------------------
					Set_NBit_One(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定(時刻1):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){

							//--------------------
							//2時刻目1固定
							//--------------------
							Set_NBit_One(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_1_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				
					//------------------------------------------------
					// ★ブランチ信号線の前方含意★
					//------------------------------------------------
					for(i=0; i<t_net->in[0]->n_out; i++){						
						if(Get_NBit(t_net->in[0]->out[i]->xid_nval_t1, tp_id) == 3){
							//入力(STEM)値1からの前方含意
							TDF_1_Forward_Implication(t_net->in[0]->out[i], tp_id, 1);
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を1固定
					//------------------------------------------------
					Set_NBit_One(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定(時刻2):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
							//--------------------
							//1時刻目1固定
							//--------------------
							Set_NBit_One(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPOの場合：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == YES){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}

							//--------------------
							//それ以外：1時刻目前方含意
							//--------------------
							else{
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t1, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 1);
									}
								}
							}
						}
						
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}					
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_1_Backward_Implication(t_net->in[0], tp_id, 2, jus_flag);
					}
				
					//------------------------------------------------
					// ★ブランチがPPOでない場合：2時刻目前方含意
					//------------------------------------------------
					for(i=0; i<t_net->in[0]->n_out; i++){						
						if(Get_NBit(t_net->in[0]->out[i]->xid_nval_t2, tp_id) == 3){
							//入力(STEM)値1からの前方含意
							TDF_1_Forward_Implication(t_net->in[0]->out[i], tp_id, 2);
						}
					}
				}
			}
		break;
		//********************************************************************
		case BUF:
			//===========================================================
			// 出力=1(入力=1に後方含意可能)
			//===========================================================
			//        |＼
			//        |  ＼
			//   1 ---|BUF >--- 1
			//        |  ／
			//        |／

			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を1固定
					//------------------------------------------------
					Set_NBit_One(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定(時刻1):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
							//--------------------
							//2時刻目1固定
							//--------------------
							Set_NBit_One(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_1_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を1固定
					//------------------------------------------------
					Set_NBit_One(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意1固定(時刻2):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
							//--------------------
							//1時刻目1固定
							//--------------------
							Set_NBit_One(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPOの場合：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == YES){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}

							//--------------------
							//それ以外：1時刻目前方含意
							//--------------------
							else{
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t1, tp_id) == 3){
										TDF_1_Forward_Implication(t_net->in[0]->out[j], tp_id, 1);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_1_Backward_Implication(t_net->in[0], tp_id, 2, jus_flag);
					}
				}
			}
		break;
		//********************************************************************
		case INV:
			//===========================================================
			// 出力=1(入力=0に後方含意可能)
			//===========================================================
			//        |＼
			//        |  ＼
			//   0 ---|INV >○-- 1
			//        |  ／
			//        |／

			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を0固定
					//------------------------------------------------
					Set_NBit_Zero(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定(時刻1):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
							//--------------------
							//2時刻目0固定
							//--------------------
							Set_NBit_Zero(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPO以外：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == NO){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//入力信号線がPPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					else if(t_net->in[0]->type == DFF){
						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

						//PPIに対するケアビット情報
						ppi_bit[t_net->in[0]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
						ppi_bit[t_net->in[0]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_0_Backward_Implication(t_net->in[0], tp_id, 1, jus_flag);
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				//X抽出後正常値がX(ドントケア)の場合
				if(Get_NBit(t_net->in[0]->xid_nval_t2, tp_id) == 3){
			
					//------------------------------------------------
					//入力信号線を0固定
					//------------------------------------------------
					Set_NBit_Zero(t_net->in[0]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
					printf("後方含意0固定(時刻2):%s\n", t_net->in[0]->name);
#endif
					//------------------------------------------------
					//入力信号線がPIの場合ケアビット保持数情報を更新
					//------------------------------------------------
					if(t_net->in[0]->type == IN){
						//PIの場合のみ1・2時刻目両方固定
						if(Get_NBit(t_net->in[0]->xid_nval_t1, tp_id) == 3){
							//--------------------
							//1時刻目0固定
							//--------------------
							Set_NBit_Zero(t_net->in[0]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
							printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[0]->name);
#endif
							//--------------------
							//PPOの場合：2時刻目前方含意
							//--------------------
							if(t_net->in[0]->ppo_flag == YES){
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t2, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 2);
									}
								}
							}
							
							//--------------------
							//それ以外：1時刻目前方含意
							//--------------------
							else{
								for(j=0; j<t_net->in[0]->n_out; j++){
									if(Get_NBit(t_net->in[0]->out[j]->xid_nval_t1, tp_id) == 3){
										TDF_0_Forward_Implication(t_net->in[0]->out[j], tp_id, 1);
									}
								}
							}
						}

						//テストパターンに対するケアビット情報
						tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
						tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

						//PIに対するケアビット情報
						pi_bit[t_net->in[0]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
						pi_bit[t_net->in[0]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
					}
					//------------------------------------------------
					//違う場合はさらに後方含意判定
					//------------------------------------------------
					else{
						TDF_0_Backward_Implication(t_net->in[0], tp_id, 2, jus_flag);
					}
				}
			}

		break;
		//********************************************************************
		case AND:
			//===========================================================
			// 出力=1(全入力が1に後方含意可能)
			//===========================================================
			//       ＿＿
			//   1 --|   ＼
			//   1 --| AND│--- 1
			//   1 --|   ／
			//       ‾‾

			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == NO){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[i]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[i]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_1_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
						}
					}
				}
			}
			
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == YES){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}
								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_1_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
						}
					}
				}
			}

		break;
		//********************************************************************
		case NAND:
			//===========================================================
			// 出力=1(入力の制御値0が1本なら後方含意可能，2本以上なら限定含意操作)
			//===========================================================
			//       ＿＿
			//   0 --|   ＼
			//   1 --|NAND│○-- 1
			//   1 --|   ／
			//       ‾‾
			
			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//-----------------------------------
				// 入力信号線の制御値0の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit(t_net->in[i]->nval_t1, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				
				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻1):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == NO){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[in]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[in]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[in]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_0_Backward_Implication(t_net->in[in], tp_id, 1, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//2時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag+1){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(1時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}


			}
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//-----------------------------------
				// 入力信号線の制御値0の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit(t_net->in[i]->nval_t2, tp_id) == 0 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}

				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻2):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == YES){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}

								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[in]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_0_Backward_Implication(t_net->in[in], tp_id, 2, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//1時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(2時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag+1 && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag+1;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}
			}
		break;
		//********************************************************************
		case OR:
			//===========================================================
			// 出力=1(入力の制御値1が1本なら後方含意可能，2本以上なら限定含意操作)
			//===========================================================
			//       ＿＿
			//   1 --＼   ＼
			//   0 ----) OR >--- 1
			//   0 --／   ／
			//       ‾‾   

			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){

				//-----------------------------------
				// 入力信号線の制御値1の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:1
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:0
						if(Get_NBit(t_net->in[i]->nval_t1, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				
				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻1):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == NO){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[in]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[in]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[in]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_1_Backward_Implication(t_net->in[in], tp_id, 1, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//2時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag+1){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(1時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}


			}
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){

				//-----------------------------------
				// 入力信号線の制御値1の本数を計算
				//-----------------------------------
				//2値
				if(n_before_x == 0){
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:1
						if(Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}
				//3値
				else{
					for(i=0; i<t_net->n_in; i++){		
						//入力信号線が制御値:1
						if(Get_NBit(t_net->in[i]->nval_t2, tp_id) == 1 ){
							n_contorolling++;
							in = i;
			
							//入力信号線に制御値が2個以上存在
							if(n_contorolling >= 2){
								break;
							}
						}
					}
				}

				//-----------------------------------
				// 制御値が1本→後方含意
				//-----------------------------------
				if(n_contorolling == 1){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[in]->xid_nval_t2, tp_id) == 3){

						//入力信号線を1固定
						Set_NBit_One(t_net->in[in]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意1固定(時刻2):%s\n", t_net->in[in]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[in]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[in]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目1固定
								//--------------------
								Set_NBit_One(t_net->in[in]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[in]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[in]->ppo_flag == YES){
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[in]->out[j], tp_id, 2);
										}
									}
								}

								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[in]->n_out; j++){
										if(Get_NBit(t_net->in[in]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_1_Forward_Implication(t_net->in[in]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[in]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[in]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							TDF_1_Backward_Implication(t_net->in[in], tp_id, 2, jus_flag);
						}
					}

				}
				//-----------------------------------
				// 制御値が複数本→限定正当化
				//-----------------------------------
				else{
					//対象信号線の入力信号線数が0本の場合(PI)は正当化とかしなくておk
					if(t_net->n_in > 0){
						//1時刻目限定正当化エンキュー済み
						if(t_net->jus_flag == jus_flag){
							t_net->jus_flag = jus_flag+2;		//1・2時刻目限定正当化エンキューフラグ設置
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻1+2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
						//未エンキュー(2時刻目積んでない&&1・2時刻目積んでない)
						else if(t_net->jus_flag!=jus_flag+1 && t_net->jus_flag!=jus_flag+2){
							//1時刻目エンキュー
							t_net->jus_flag = jus_flag+1;
							enqueue(nl_queue, (void*)t_net);	//自分自身(t_net)をエンキュー
#ifdef BIMPL_DEBUG
							printf("限定正当化エンキュー(時刻2): %s (ed_flag:%d xid_flag:%d jus_flag:%d)\n", t_net->name, t_net->flag, t_net->xid_flag, t_net->jus_flag);
#endif
						}
					}
				}
			}


		break;
		//********************************************************************
		case NOR:
			//===========================================================
			// 出力=1(全入力が0に後方含意可能)
			//===========================================================
			//       ＿＿
			//   0 --＼   ＼
			//   0 ----)NOR >○-- 1
			//   0 --／   ／
			//       ‾‾

			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){
				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
								//--------------------
								//2時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPO以外：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == NO){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//入力信号線がPPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						else if(t_net->in[i]->type == DFF){
							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

							//PPIに対するケアビット情報
							ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
							ppi_bit[t_net->in[i]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント

						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_0_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
						}
					}
				}
			}

			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				for(i=0; i<t_net->n_in; i++){

					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){

						//入力信号線を0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
						printf("後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
						//------------------------------------------------
						//入力信号線がPIの場合ケアビット保持数情報を更新
						//------------------------------------------------
						if(t_net->in[i]->type == IN){
							//PIの場合のみ1・2時刻目両方固定
							if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
								//--------------------
								//1時刻目0固定
								//--------------------
								Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//--------------------
								//PPOの場合：2時刻目前方含意
								//--------------------
								if(t_net->in[i]->ppo_flag == YES){
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
										}
									}
								}

								//--------------------
								//それ以外：1時刻目前方含意
								//--------------------
								else{
									for(j=0; j<t_net->in[i]->n_out; j++){
										if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
											TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
										}
									}
								}
							}

							//テストパターンに対するケアビット情報
							tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
							tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

							//PIに対するケアビット情報
							pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
							pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
						}
						//------------------------------------------------
						//違う場合はさらに後方含意判定
						//------------------------------------------------
						else{
							//さらに入力信号線を後方含意判定
							TDF_0_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
						}
					}
				}
			}

		break;
		//********************************************************************
		case EXOR:
		case EXNOR:
			//===========================================================
			// 出力=1 (※制御値が無いため2入力とも遡る(後方含意))
			//===========================================================
			//       ＿＿＿                     ＿＿＿
			//   1 --＼    ＼               0 --＼    ＼
			//         ))EXOR>--- 1               ))EXOR>--- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			//===========================================================
			// 出力=1 (※制御値が無いため2入力とも遡る(後方含意))
			//===========================================================
			//       ＿＿＿                     ＿＿＿
			//   0 --＼    ＼               1 --＼    ＼
			//        ))EXNOR>○-- 1             ))EXNOR>○-- 1
			//   0 --／    ／               1 --／    ／
			//       ‾‾‾                     ‾‾‾  
			
			//-----------------------------------------------------------
			// ■1時刻目後方含意
			//-----------------------------------------------------------
			if(time == 1){				
				for(i=0; i<t_net->n_in; i++){
					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){

						//---------------------------------------
						// 2値の場合
						//---------------------------------------
						if(n_before_x == 0){
							//■0固定
							if(Get_NBit_Xbuf(t_net->in[i]->nval_t1, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
						}
					
						//---------------------------------------
						// 3値の場合
						//---------------------------------------
						else{
							//■0固定
							if(Get_NBit(t_net->in[i]->nval_t1, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PPI)のテストパターン[tp_id]の0数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_0bit++;	//対象信号線(PPI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){									
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){
										//--------------------
										//2時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 1, jus_flag);
								}
							}
						}
					}
				}
			}
			
			//-----------------------------------------------------------
			// ■2時刻目後方含意
			//-----------------------------------------------------------
			else if(time == 2){
				for(i=0; i<t_net->n_in; i++){
					//X抽出後正常値がX(ドントケア)の場合
					if(Get_NBit(t_net->in[i]->xid_nval_t2, tp_id) == 3){

						//---------------------------------------
						// 2値の場合
						//---------------------------------------
						if(n_before_x == 0){
							//■0固定
							if(Get_NBit_Xbuf(t_net->in[i]->nval_t2, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//2時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPOの場合：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == YES){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}

										//--------------------
										//それ以外：1時刻目前方含意
										//--------------------
										else{
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//2時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPOの場合：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == YES){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}

										//--------------------
										//それ以外：1時刻目前方含意
										//--------------------
										else{
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//入力信号線がPPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								else if(t_net->in[i]->type == DFF){
									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PPI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PPI)のテストパターン[tp_id]の1数をインクリメント

									//PPIに対するケアビット情報
									ppi_bit[t_net->in[i]->ppi_id].n_cbit++;	//対象信号線(PPI)のケアビット数をインクリメント
									ppi_bit[t_net->in[i]->ppi_id].n_1bit++;	//対象信号線(PPI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
						}
					
						//---------------------------------------
						// 3値の場合
						//---------------------------------------
						else{
							//■0固定
							if(Get_NBit(t_net->in[i]->nval_t2, tp_id) == 0){
								//入力信号線を0固定
								Set_NBit_Zero(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意0固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//2時刻目0固定
										//--------------------
										Set_NBit_Zero(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意0固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t1, tp_id) == 3){
													TDF_0_Forward_Implication(t_net->in[i]->out[j], tp_id, 1);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_0bit++;			//対象信号線(PI)のテストパターン[tp_id]の0数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_0bit++;	//対象信号線(PI)の0数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_0_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
							//■1固定
							else{
								//入力信号線を1固定
								Set_NBit_One(t_net->in[i]->xid_nval_t2, tp_id);
#ifdef BIMPL_DEBUG
								printf("後方含意1固定(時刻2):%s\n", t_net->in[i]->name);
#endif
								//------------------------------------------------
								//入力信号線がPIの場合ケアビット保持数情報を更新
								//------------------------------------------------
								if(t_net->in[i]->type == IN){
									//PIの場合のみ1・2時刻目両方固定
									if(Get_NBit(t_net->in[i]->xid_nval_t1, tp_id) == 3){
										//--------------------
										//2時刻目1固定
										//--------------------
										Set_NBit_One(t_net->in[i]->xid_nval_t1, tp_id);
#ifdef BIMPL_DEBUG
										printf("※PI 後方含意1固定(時刻1):%s\n", t_net->in[i]->name);
#endif
										//--------------------
										//PPO以外：2時刻目前方含意
										//--------------------
										if(t_net->in[i]->ppo_flag == NO){
											for(j=0; j<t_net->in[i]->n_out; j++){
												if(Get_NBit(t_net->in[i]->out[j]->xid_nval_t2, tp_id) == 3){
													TDF_1_Forward_Implication(t_net->in[i]->out[j], tp_id, 2);
												}
											}
										}
									}

									//テストパターンに対するケアビット情報
									tp_bit[tp_id].n_cbit++;			//対象信号線(PI)のテストパターン[tp_id]のケアビット数をインクリメント
									tp_bit[tp_id].n_1bit++;			//対象信号線(PI)のテストパターン[tp_id]の1数をインクリメント

									//PIに対するケアビット情報
									pi_bit[t_net->in[i]->pi_id].n_cbit++;	//対象信号線(PI)のケアビット数をインクリメント
									pi_bit[t_net->in[i]->pi_id].n_1bit++;	//対象信号線(PI)の1数をインクリメント
								}
								//------------------------------------------------
								//違う場合はさらに後方含意判定
								//------------------------------------------------
								else{
									//さらに入力信号線を後方含意判定
									TDF_1_Backward_Implication(t_net->in[i], tp_id, 2, jus_flag);
								}
							}
						}
					}
				}
			}
		break;
		//********************************************************************
	}
}