//------------------------------------------------------------------------
//File name : make_fault_tbl.c
//Date : 2013/12/1
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<string.h>
#include	<stdlib.h>

#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../StandardHead.h"

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

	//#define DEBUG
//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//----------------------------------------------
//関数名：make_fault_tbl
//機能　：優先パスフラグのある順に信号線(故障リストテーブル)を作成
//引数　：priority(優先フラグ値)
//戻り値：なし
//----------------------------------------------
void make_fault_tbl(unsigned int priority){

	int			i;
	int			count=0;


	//====================================================
	// 優先パスフラグのある信号線のみ故障テーブルにポインタ代入
	//====================================================
	for(i=0; i<n_snet; i++){
		if(s_nl[i].pri_path == priority){
			flt_stbl[count] = &s_nl[i];
			count++;
#ifdef DEBUG
			printf("%s\n", s_nl[i].name);
#endif
		}
	}

	//====================================================
	// 残りの信号線を代入
	//====================================================
	for(i=0; i<n_snet; i++){
		if(s_nl[i].pri_path != priority){
			flt_stbl[count] = &s_nl[i];
			count++;
#ifdef DEBUG
			printf("%s\n", s_nl[i].name);
#endif
		}
	}

}