//------------------------------------------------------------------------
//File name : make_pointer_cpi
//Date : 2013/11/22
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<string.h>
#include	<stdlib.h>

#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../StandardHead.h"

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define DEBUG

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//----------------------------------------------
//関数名：make_pointer_cpi
//機能　：オリジナルFF，FFC,CPのそれぞれの個数とポイント配列を作成
//引数　：なし
//戻り値：なし
//----------------------------------------------
void make_pointer_cpi(){
	
	int			i;
	int			count;


	//========================================================
	// メモリ確保
	//========================================================
	//個数の初期化
	n_ori_pi = n_spi - (n_sdff/2);
	n_ori_dff = n_sdff/2;
	n_ffc = n_sdff/2;
	n_cp = n_sdff/2;

	//メモリ確保
	ori_pi = (S_NLIST**)malloc(sizeof(S_NLIST*)*n_ori_pi);
	ori_dff = (S_NLIST**)malloc(sizeof(S_NLIST*)*n_ori_dff);
	ffc = (S_NLIST**)malloc(sizeof(S_NLIST*)*n_ffc);
	cp = (S_NLIST**)malloc(sizeof(S_NLIST*)*n_cp);
	

	//========================================================
	// ポインタ接続
	//========================================================
	//------------------------------------------
	// オリジナルPIのポインタ配列作成
	//------------------------------------------
	count = 0;
	for(i=0; i<n_se_input; i++){
		if(pi_tp[i].nl_id != -1){
			ori_pi[count] = pi_tp[i].sinput;
			count++;
		}
	}
	
	//------------------------------------------
	// オリジナルFFのポインタ配列作成
	//------------------------------------------
	count = 0;
	for(i=0; i<n_scan_ff; i++){
		if(ppi_tp[i].nl_id != -1){
			ori_dff[count] = ppi_tp[i].sinput;
			count++;
		}
	}
	
	//------------------------------------------
	// FFCのポインタ配列作成
	//------------------------------------------
	count = 0;
	for(i; i<(n_scan_ff+(n_sdff/2)); i++){
		if(ppi_tp[i].nl_id != -1){
			ffc[count] = ppi_tp[i].sinput;
			count++;
		}
	}
	
	//------------------------------------------
	// CPのポインタ配列作成
	//------------------------------------------
	count = 0;
	for(i=n_se_input; i<(n_se_input+(n_sdff/2)); i++){
		if(pi_tp[i].nl_id != -1){
			cp[count] = pi_tp[i].sinput;
			count++;
		}
	}

#ifdef DEBUG
	printf("\n//======================================\n");
	printf("// DEBUG: オリジナルPIポインタ\n");
	printf("//======================================\n");
	for(i=0; i<n_ori_pi; i++)printf("%s\n", ori_pi[i]->name);

	printf("\n//======================================\n");
	printf("// DEBUG: オリジナルFFポインタ\n");
	printf("//======================================\n");
	for(i=0; i<n_ori_dff; i++)printf("%s\n", ori_dff[i]->name);

	printf("\n//======================================\n");
	printf("// DEBUG: CP(PI))ポインタ\n");
	printf("//======================================\n");
	for(i=0; i<n_cp; i++)printf("%s\n", cp[i]->name);

	printf("\n//======================================\n");
	printf("// DEBUG: FFC(FF)ポインタ\n");
	printf("//======================================\n");
	for(i=0; i<n_ffc; i++)printf("%s\n", ffc[i]->name);

#endif
}