//------------------------------------------------------------------------
//File name : FPointer_SAF_Different_Fault_Path.c
//Date : 2013/7/27
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../../Netlist/netlist.h"
#include	"../../../Lib/bit_tp.h"
#include	"../../../Lib/bit_int.h"
#include	"../../../Lib/mt19937ar.h"
#include	"../../../StandardHead.h"
#include	"../../../option.h"
#include	"../../Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void		dtob								(unsigned int, int);
void		SAF_XID_fpath_push					(NLIST*, int, int);
void		SAF_0_Backward_Implication			(NLIST*, int);
void		SAF_1_Backward_Implication			(NLIST*, int);

//伝搬経路決定
void		SAF_XID_diff_fpath_single_gate		(NLIST*, int, int, unsigned int, unsigned int);
void		SAF_XID_diff_fpath_and				(NLIST*, int, int, unsigned int, unsigned int);
void		SAF_XID_diff_fpath_nand				(NLIST*, int, int, unsigned int, unsigned int);
void		SAF_XID_diff_fpath_or				(NLIST*, int, int, unsigned int, unsigned int);
void		SAF_XID_diff_fpath_nor				(NLIST*, int, int, unsigned int, unsigned int);
void		SAF_XID_diff_fpath_exor				(NLIST*, int, int, unsigned int, unsigned int);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//
//  ed_flag		: FSIMでの故障伝搬フラグ(SPPFPで決定)
//  ed_flag-1	: FSIMでイベント計算されたが故障伝搬しなかった信号線(SPPFPで決定)
//  xid_flag	: ケアビットに固定したフラグ(故障伝搬経路or正当化経路)
//
	//#define PATH_DEBUG

//------------------------------------------------------------------------
//  静的変数
//------------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : FPointer_SAF_Diff_Fault_Path
//  機  能 : 【関数ポインタ作成】SAF用の故障伝搬経路決定の関数ポインタ作成
//  戻り値 : なし
//  引  数 : なし
//----------------------------------------------
void	FPointer_SAF_Diff_Fault_Path(){
		
	//======================================================================================
	// 関数ポインタ作成
	//======================================================================================
	//故障伝搬経路
	func_path[FOUT]	 = SAF_XID_diff_fpath_single_gate;
	func_path[BUF]	 = SAF_XID_diff_fpath_single_gate;
	func_path[INV]	 = SAF_XID_diff_fpath_single_gate;
	func_path[AND]	 = SAF_XID_diff_fpath_and;
	func_path[NAND]	 = SAF_XID_diff_fpath_nand;
	func_path[OR]	 = SAF_XID_diff_fpath_or;
	func_path[NOR]	 = SAF_XID_diff_fpath_nor;
	func_path[EXOR]	 = SAF_XID_diff_fpath_exor;
	func_path[EXNOR] = SAF_XID_diff_fpath_exor;
}


//******************************************************************************************************
// 関数ポインタさんの中身
//******************************************************************************************************
//★【2値・3値共通】故障伝搬経路★
//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_diff_fpath_single_gate
//  機  能 : 【FOUT・BUF・INV】故障伝搬経路決定(※通常とパス選択が異なる)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), fault_id(32個中何番目の故障なのか), ed_flag(FSIMイベントフラグ値), xid_flag(X抽出(ケアビット固定)フラグ値)
//------------------------------------------------------------------------------------
void	SAF_XID_diff_fpath_single_gate(NLIST *t_net, int tp_id, int fault_id, unsigned int ed_flag, unsigned int xid_flag){
	
	//================================================
	//FOUT・BUF・INVの入力は絶対故障伝搬経路
	//================================================
	SAF_XID_fpath_push(t_net->in[0], xid_flag, tp_id);
}


//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_diff_fpath_and
//  機  能 : 【AND】故障伝搬経路決定(※通常とパス選択が異なる)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), fault_id(32個中何番目の故障なのか), ed_flag(FSIMイベントフラグ値), xid_flag(X抽出(ケアビット固定)フラグ値)
//------------------------------------------------------------------------------------
void	SAF_XID_diff_fpath_and(NLIST *t_net, int tp_id, int fault_id, unsigned int ed_flag, unsigned int xid_flag){

	int		i;
	int		fix_id = -1;				//入力信号線の最小レベルの入力ID
	int		cbit_id[10];				//故障伝搬信号線のID
	int		n_cbit = 0;					//故障伝搬信号線数
		
	//===============================================================================
	// ゲート出力正常値が制御値(0)で決定 (規則① or 規則③)
	//===============================================================================
	//         ＿＿
	//   0/1 --|   ＼
	//   0/1 --| AND│--- 0/1
	//   1/1 --|   ／
	//         ￣￣
	if(Get_NBit_Xbuf(t_net->nval, tp_id) == 0){
		
		//---------------------------------------
		//正常値が制御値(0)の信号線を全て遡る
		//---------------------------------------
		//2値
		if(n_before_x == 0){
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(0)
				//----------------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(1)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
		//3値
		else{
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(0)
				//----------------------------------
				if(Get_NBit(t_net->in[i]->nval, tp_id) == 0){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(1)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
				//※入力にXがあった場合は故障伝搬しないので大丈夫
			}
		}
		
	}
	
	//===============================================================================
	// 【※通常と異なる】ゲート出力正常値が非制御値(1)で決定 (規則① or 規則②)
	//===============================================================================
	else{
		//         ＿＿
		//   1/0 --|   ＼
		//   1/0 --| AND│--- 1/0
		//   1/1 --|   ／
		//         ￣￣
		//---------------------------------------
		//故障伝搬入力(1/0)を探索⇒故障値入力0を探索
		//---------------------------------------
		for(i=0; i<t_net->n_in; i++){
			//故障SIMフラグが立ってる信号線
			if(t_net->in[i]->flag == ed_flag){
				if((t_net->in[i]->x_fault & MASKbit[fault_id]) == 0){	//AND入力故障値==0
					
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線を選択】
					//=================================================================
					if(opt.diff_path_mode == RAND_FIX){

						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//固定済み信号線のID保存
							break;
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線以外を選択】
					//=================================================================
					else if(opt.diff_path_mode == DIFF){
					
						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//※全て固定済み信号線の場合に利用
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線も選択するかも】
					//=================================================================
					else if(opt.diff_path_mode == RAND){
						cbit_id[n_cbit] = i;				//故障伝搬信号線のID保存
						n_cbit++;							//故障伝搬信号線数更新
					}
				}
			}
		}

		//=================================================================
		//【固定済み信号線を選択】【固定済み信号線以外を選択】
		//=================================================================
		if(opt.diff_path_mode==RAND_FIX || opt.diff_path_mode==DIFF){
			//---------------------------------------
			//固定済み信号線が存在(全て固定済み)
			//---------------------------------------
			if(fix_id != -1){
				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

							//1からの後方含意
							SAF_1_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
			//---------------------------------------
			//固定済み信号線が無い(ランダム選択)
			//---------------------------------------
			else{
				//故障伝搬経路をランダムで決定
				fix_id = cbit_id[(genrand_int31()%n_cbit)];

				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

							//1からの後方含意
							SAF_1_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
		}
		//=================================================================
		//【固定済み信号線も選択するかも】
		//=================================================================
		else if(opt.diff_path_mode == RAND){
			//故障伝搬経路をランダムで決定
			fix_id = cbit_id[(genrand_int31()%n_cbit)];

			for(i=0; i<t_net->n_in; i++){

				//固定済み信号線を故障伝搬経路に決定
				if(i == fix_id){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
				}

				//その他信号線は後方含意or限定正当化
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
	}
}

//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_diff_fpath_nand
//  機  能 : 【NAND】故障伝搬経路決定(※通常とパス選択が異なる)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), fault_id(32個中何番目の故障なのか), ed_flag(FSIMイベントフラグ値), xid_flag(X抽出(ケアビット固定)フラグ値)
//------------------------------------------------------------------------------------
void	SAF_XID_diff_fpath_nand(NLIST *t_net, int tp_id, int fault_id, unsigned int ed_flag, unsigned int xid_flag){

	int		i;
	int		fix_id = -1;				//入力信号線の最小レベルの入力ID
	int		cbit_id[10];				//故障伝搬信号線のID
	int		n_cbit = 0;					//故障伝搬信号線数
	
	//===============================================================================
	// ゲート出力正常値が制御値(0)で決定 (規則① or 規則③)
	//===============================================================================
	//         ＿＿
	//   0/1 --|   ＼
	//   0/1 --|NAND│○-- 1/0
	//   1/1 --|   ／
	//         ￣￣     
	if(Get_NBit_Xbuf(t_net->nval, tp_id) == 1){
		
		//---------------------------------------
		//正常値が制御値(0)の信号線を全て遡る
		//---------------------------------------
		//2値
		if(n_before_x == 0){
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(0)
				//----------------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(1)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
		//3値
		else{
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(0)
				//----------------------------------
				if(Get_NBit(t_net->in[i]->nval, tp_id) == 0){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(1)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
				//※入力にXがあった場合は故障伝搬しないので大丈夫
			}
		}
		
	}
	
	//===============================================================================
	// ゲート出力正常値が非制御値(1)で決定 (規則① or 規則②)
	//===============================================================================
	else{
		//         ＿＿
		//   1/0 --|   ＼
		//   1/0 --|NAND│○-- 0/1
		//   1/1 --|   ／
		//         ￣￣     
		//---------------------------------------
		//故障伝搬入力(1/0)を探索⇒故障値入力0を探索
		//---------------------------------------
		for(i=0; i<t_net->n_in; i++){
			//故障SIMフラグが立ってる信号線
			if(t_net->in[i]->flag == ed_flag){
				if((t_net->in[i]->x_fault & MASKbit[fault_id]) == 0){	//NAND入力故障値==0

					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線を選択】
					//=================================================================
					if(opt.diff_path_mode == RAND_FIX){

						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//固定済み信号線のID保存
							break;
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線以外を選択】
					//=================================================================
					else if(opt.diff_path_mode == DIFF){
					
						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//※全て固定済み信号線の場合に利用
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線も選択するかも】
					//=================================================================
					else if(opt.diff_path_mode == RAND){
						cbit_id[n_cbit] = i;				//故障伝搬信号線のID保存
						n_cbit++;							//故障伝搬信号線数更新
					}
				}
			}
		}

		//=================================================================
		//【固定済み信号線を選択】【固定済み信号線以外を選択】
		//=================================================================
		if(opt.diff_path_mode==RAND_FIX || opt.diff_path_mode==DIFF){
			//---------------------------------------
			//固定済み信号線が存在(全て固定済み)
			//---------------------------------------
			if(fix_id != -1){
				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

							//1からの後方含意
							SAF_1_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
			//---------------------------------------
			//固定済み信号線が無い(ランダム選択)
			//---------------------------------------
			else{
				//故障伝搬経路をランダムで決定
				fix_id = cbit_id[(genrand_int31()%n_cbit)];

				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

							//1からの後方含意
							SAF_1_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
		}
		//=================================================================
		//【固定済み信号線も選択するかも】
		//=================================================================
		else if(opt.diff_path_mode == RAND){
			//故障伝搬経路をランダムで決定
			fix_id = cbit_id[(genrand_int31()%n_cbit)];

			for(i=0; i<t_net->n_in; i++){

				//固定済み信号線を故障伝搬経路に決定
				if(i == fix_id){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
				}

				//その他信号線は後方含意or限定正当化
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
	}
}

//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_diff_fpath_or
//  機  能 : 【OR】故障伝搬経路決定(※通常とパス選択が異なる)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), fault_id(32個中何番目の故障なのか), ed_flag(FSIMイベントフラグ値), xid_flag(X抽出(ケアビット固定)フラグ値)
//------------------------------------------------------------------------------------
void	SAF_XID_diff_fpath_or(NLIST *t_net, int tp_id, int fault_id, unsigned int ed_flag, unsigned int xid_flag){

	int		i;
	int		fix_id = -1;				//入力信号線の最小レベルの入力ID
	int		cbit_id[10];				//故障伝搬信号線のID
	int		n_cbit = 0;					//故障伝搬信号線数
	
	//===============================================================================
	// ゲート出力正常値が制御値(1)で決定 (規則① or 規則③)
	//===============================================================================
	//         ＿＿
	//   1/0 --＼   ＼
	//   1/0 ----) OR >--- 1/0
	//   0/0 --／   ／
	//         ￣￣  
	if(Get_NBit_Xbuf(t_net->nval, tp_id) == 1){
		
		//---------------------------------------
		//正常値が制御値(1)の信号線を全て遡る
		//---------------------------------------
		//2値
		if(n_before_x == 0){
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(1)
				//----------------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 1){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(0)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
		//3値
		else{
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(1)
				//----------------------------------
				if(Get_NBit(t_net->in[i]->nval, tp_id) == 1){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(0)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
				//※入力にXがあった場合は故障伝搬しないので大丈夫
			}
		}
		
	}
	
	//===============================================================================
	// ゲート出力正常値が非制御値(0)で決定 (規則① or 規則②)
	//===============================================================================
	else{
		//         ＿＿
		//   0/1 --＼   ＼
		//   0/1 ----) OR >--- 0/1
		//   0/0 --／   ／
		//         ￣￣    
		//---------------------------------------
		//故障伝搬入力(0/1)を探索⇒故障値入力1を探索
		//---------------------------------------
		for(i=0; i<t_net->n_in; i++){
			//故障SIMフラグが立ってる信号線
			if(t_net->in[i]->flag == ed_flag){
				if((t_net->in[i]->x_fault & MASKbit[fault_id]) != 0){	//OR入力故障値==1

					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線を選択】
					//=================================================================
					if(opt.diff_path_mode == RAND_FIX){

						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//固定済み信号線のID保存
							break;
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線以外を選択】
					//=================================================================
					else if(opt.diff_path_mode == DIFF){
					
						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//※全て固定済み信号線の場合に利用
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線も選択するかも】
					//=================================================================
					else if(opt.diff_path_mode == RAND){
						cbit_id[n_cbit] = i;				//故障伝搬信号線のID保存
						n_cbit++;							//故障伝搬信号線数更新
					}
				}
			}
		}

		//=================================================================
		//【固定済み信号線を選択】【固定済み信号線以外を選択】
		//=================================================================
		if(opt.diff_path_mode==RAND_FIX || opt.diff_path_mode==DIFF){
			//---------------------------------------
			//固定済み信号線が存在(全て固定済み)
			//---------------------------------------
			if(fix_id != -1){
				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

							//0からの後方含意
							SAF_0_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
			//---------------------------------------
			//固定済み信号線が無い(ランダム選択)
			//---------------------------------------
			else{
				//故障伝搬経路をランダムで決定
				fix_id = cbit_id[(genrand_int31()%n_cbit)];

				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

							//0からの後方含意
							SAF_0_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
		}
		//=================================================================
		//【固定済み信号線も選択するかも】
		//=================================================================
		else if(opt.diff_path_mode == RAND){
			//故障伝搬経路をランダムで決定
			fix_id = cbit_id[(genrand_int31()%n_cbit)];

			for(i=0; i<t_net->n_in; i++){

				//固定済み信号線を故障伝搬経路に決定
				if(i == fix_id){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
				}

				//その他信号線は後方含意or限定正当化
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
	}
}

//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_diff_fpath_nor
//  機  能 : 【NOR】故障伝搬経路決定(※通常とパス選択が異なる)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), fault_id(32個中何番目の故障なのか), ed_flag(FSIMイベントフラグ値), xid_flag(X抽出(ケアビット固定)フラグ値)
//------------------------------------------------------------------------------------
void	SAF_XID_diff_fpath_nor(NLIST *t_net, int tp_id, int fault_id, unsigned int ed_flag, unsigned int xid_flag){

	int		i;
	int		fix_id = -1;				//入力信号線の最小レベルの入力ID
	int		cbit_id[10];				//故障伝搬信号線のID
	int		n_cbit = 0;					//故障伝搬信号線数
	
	//===============================================================================
	// ゲート出力正常値が制御値(1)で決定 (規則① or 規則③)
	//===============================================================================
	//         ＿＿
	//   1/0 --＼   ＼
	//   1/0 ----)NOR >○-- 0/1
	//   0/0 --／   ／
	//         ￣￣
	if(Get_NBit_Xbuf(t_net->nval, tp_id) == 0){
		
		//---------------------------------------
		//正常値が制御値(1)の信号線を全て遡る
		//---------------------------------------
		//2値
		if(n_before_x == 0){
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(1)
				//----------------------------------
				if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 1){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(0)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
		//3値
		else{
			for(i=0; i<t_net->n_in; i++){
				//----------------------------------
				//入力正常値：制御値(1)
				//----------------------------------
				if(Get_NBit(t_net->in[i]->nval, tp_id) == 1){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
				}
				//----------------------------------
				//入力正常値：非制御値(0)
				//----------------------------------
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
				//※入力にXがあった場合は故障伝搬しないので大丈夫
			}
		}
		
	}
	
	//===============================================================================
	// ゲート出力正常値が非制御値(0)で決定 (規則① or 規則②)
	//===============================================================================
	else{
		//         ＿＿
		//   0/1 --＼   ＼
		//   0/1 ----)NOR >○-- 1/0
		//   0/0 --／   ／
		//         ￣￣
		//---------------------------------------
		//故障伝搬入力(0/1)を探索⇒故障値入力1を探索
		//---------------------------------------
		for(i=0; i<t_net->n_in; i++){
			//故障SIMフラグが立ってる信号線
			if(t_net->in[i]->flag == ed_flag){
				if((t_net->in[i]->x_fault & MASKbit[fault_id]) != 0){	//NOR入力故障値==1

					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線を選択】
					//=================================================================
					if(opt.diff_path_mode == RAND_FIX){

						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//固定済み信号線のID保存
							break;
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線以外を選択】
					//=================================================================
					else if(opt.diff_path_mode == DIFF){
					
						//-----------------------------------------------------------
						//故障伝搬 && 入力信号線のxid_nvalにドントケア(X)が存在
						//-----------------------------------------------------------
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){	//ドントケア(X)発見
							cbit_id[n_cbit] = i;				//未固定信号線のID保存
							n_cbit++;							//故障伝搬信号線数更新
						}
						//-----------------------------------------------------------
						//故障伝搬 && 入力に他故障でケアビット(1)固定された信号線が存在
						//-----------------------------------------------------------
						else{
							fix_id = i;							//※全て固定済み信号線の場合に利用
						}
					}
					//=================================================================
					// ■固定済み信号線があった場合⇒【固定済み信号線も選択するかも】
					//=================================================================
					else if(opt.diff_path_mode == RAND){
						cbit_id[n_cbit] = i;				//故障伝搬信号線のID保存
						n_cbit++;							//故障伝搬信号線数更新
					}
				}
			}
		}

		//=================================================================
		//【固定済み信号線を選択】【固定済み信号線以外を選択】
		//=================================================================
		if(opt.diff_path_mode==RAND_FIX || opt.diff_path_mode==DIFF){
			//---------------------------------------
			//固定済み信号線が存在(全て固定済み)
			//---------------------------------------
			if(fix_id != -1){
				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

							//0からの後方含意
							SAF_0_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
			//---------------------------------------
			//固定済み信号線が無い(ランダム選択)
			//---------------------------------------
			else{
				//故障伝搬経路をランダムで決定
				fix_id = cbit_id[(genrand_int31()%n_cbit)];

				for(i=0; i<t_net->n_in; i++){

					//固定済み信号線を故障伝搬経路に決定
					if(i == fix_id){
						SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
					}

					//その他信号線は後方含意or限定正当化
					else{
						//入力信号線がXの場合
						if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
							//0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

							//0からの後方含意
							SAF_0_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}
		}
		//=================================================================
		//【固定済み信号線も選択するかも】
		//=================================================================
		else if(opt.diff_path_mode == RAND){
			//故障伝搬経路をランダムで決定
			fix_id = cbit_id[(genrand_int31()%n_cbit)];

			for(i=0; i<t_net->n_in; i++){

				//固定済み信号線を故障伝搬経路に決定
				if(i == fix_id){
					SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);	//故障伝搬入力は遡る
				}

				//その他信号線は後方含意or限定正当化
				else{
					//入力信号線がXの場合
					if(Get_NBit(t_net->in[i]->xid_nval, tp_id) == 3){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
	}
}


//------------------------------------------------------------------------------------
//  関数名 : SAF_XID_diff_fpath_exor
//  機  能 : 【EXOR・EXNOR】故障伝搬経路決定(※通常とパス選択が異なる)
//  戻り値 : なし
//  引  数 : t_net(対象信号線), tp_id(テストパターンの何番目か), fault_id(32個中何番目の故障なのか), ed_flag(FSIMイベントフラグ値), xid_flag(X抽出(ケアビット固定)フラグ値)
//※2入力のみ対応
//------------------------------------------------------------------------------------
void	SAF_XID_diff_fpath_exor(NLIST *t_net, int tp_id, int fault_id, unsigned int ed_flag, unsigned int xid_flag){
	
	int				i;
	

	//★EXOR・EXNORは2入力とも故障値の場合は，出力に故障伝搬しないので注意★
	//(※出力に故障伝搬してる場合，故障伝搬入力は1本のみとなる)
	//         ＿＿＿                       ＿＿＿                        ＿＿＿
	//   0/1 --＼    ＼               1/0 --＼    ＼                1/0 --＼    ＼
	//           ))EXOR>--- 0/0               ))EXOR>--- 0/0                ))EXOR>--- 1/1
	//   0/1 --／    ／               1/0 --／    ／                0/1 --／    ／
	//         ￣￣￣                       ￣￣￣                        ￣￣￣  
	
	//================================================
	// EXOR・EXNORのみ特殊処理
	//================================================
	for(i=0; i<t_net->n_in; i++){

		//--------------------------------------------------------------------
		// 入力信号線に故障伝搬経路flagが立ってる(対象故障のかは分からないが)
		//--------------------------------------------------------------------
		if(t_net->in[i]->flag == ed_flag){
			//-----------------------------------------------
			// 対象故障が故障伝搬(入力正常値≠入力故障値)
			//-----------------------------------------------
			//※故障伝搬経路なので3値でもx_bufの確認だけでOK
			if( (Get_NBit_Xbuf(t_net->in[i]->nval, tp_id)) != (t_net->in[i]->x_fault & MASKbit[fault_id])){
				SAF_XID_fpath_push(t_net->in[i], xid_flag, tp_id);
			}			
			//-----------------------------------------------
			// 調べたら故障伝搬信号線でなかった⇒エンキュー(後で限定含意・限定正当化)
			//-----------------------------------------------
			else{
				//入力信号線がXの場合
				if(Get_NBit(t_net->in[i]->xid_nval, tp_id)){
					//------------------------------
					//2値
					//------------------------------
					if(n_before_x == 0){
						//入力値=0
						if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0){
							//0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

							//0からの後方含意
							SAF_0_Backward_Implication(t_net->in[i], tp_id);
						}

						//入力値=1
						else{
							//1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

							//1からの後方含意
							SAF_1_Backward_Implication(t_net->in[i], tp_id);
						}
					}
					//------------------------------
					//3値
					//------------------------------
					else{
						//入力値=0
						if(Get_NBit(t_net->in[i]->nval, tp_id) == 0){
							//0固定
							Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

							//0からの後方含意
							SAF_0_Backward_Implication(t_net->in[i], tp_id);
						}

						//入力値=1
						else{
							//1固定
							Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

							//1からの後方含意
							SAF_1_Backward_Implication(t_net->in[i], tp_id);
						}
					}
				}
			}

		}
		//----------------------------------------------------------
		//絶対故障伝搬信号線でない⇒エンキュー(後で限定含意・限定正当化)
		//----------------------------------------------------------
		else{
			//入力信号線がXの場合
			if(Get_NBit(t_net->in[i]->xid_nval, tp_id)){
				//------------------------------
				//2値
				//------------------------------
				if(n_before_x == 0){
					//入力値=0
					if(Get_NBit_Xbuf(t_net->in[i]->nval, tp_id) == 0){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}

					//入力値=1
					else{
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
				//------------------------------
				//3値
				//------------------------------
				else{
					//入力値=0
					if(Get_NBit(t_net->in[i]->nval, tp_id) == 0){
						//0固定
						Set_NBit_Zero(t_net->in[i]->xid_nval, tp_id);

						//0からの後方含意
						SAF_0_Backward_Implication(t_net->in[i], tp_id);
					}

					//入力値=1
					else{
						//1固定
						Set_NBit_One(t_net->in[i]->xid_nval, tp_id);

						//1からの後方含意
						SAF_1_Backward_Implication(t_net->in[i], tp_id);
					}
				}
			}
		}
	}
	
}