//------------------------------------------------------------------------
//File name : search_tdf_testable_net.c
//Date : 2013/9/15
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../StandardHead.h"
#include	"../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define		DEBUG
#define		OBSERV		2	//観測可能
#define		TRANS		3	//遷移可能
#define		OB_TR		5	//遷移・観測可能

//---------------------------------------------------------------------
//　静的変数
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------

//----------------------------------------------
//  関数名 : search_tdf_testable_net
//  機  能 : 【遷移故障のみ】遷移故障テスト可能(遷移・観測可能)な信号線の判定
//  戻り値 : なし
//  引  数 : なし
//----------------------------------------------
void search_tdf_testable_net(){


	int		i;
	S_NLIST	*temp;

	//========================================================
	// PPOから到達可能信号線(観測可能信号線)を探索
	//========================================================
	//-------------------------------------------
	// PPO信号線をエンキュー
	//-------------------------------------------
	for(i=0; i<n_ppo; i++){
		ppo[i]->testable_net = OBSERV;				//観測可能フラグ設置
		enqueue(nl_queue, (void*)ppo[i]);		//エンキュー
#ifdef DEBUG
		printf("観測可能: %s (flag = %d)\n", ppo[i]->name, ppo[i]->testable_net);
#endif
	}
		
	//-------------------------------------------
	// 観測可能信号線を探索(入力方向探索)
	//-------------------------------------------
	while((temp = (S_NLIST*)dequeue(nl_queue) ) != NULL){
		if(temp->type != DFF){
			for(i=0; i<temp->n_in; i++){
				if(temp->in[i]->testable_net != OBSERV){
					temp->in[i]->testable_net = OBSERV;		//観測可能フラグ設置
					enqueue(nl_queue, (void*)temp->in[i]);		//エンキュー
#ifdef DEBUG
					printf("観測可能: %s (flag = %d)\n", temp->in[i]->name, temp->in[i]->testable_net);
#endif
				}
			}
		}
	}

	//========================================================
	// PPIから到達可能信号線(遷移可能信号線)を探索
	//========================================================
	//-------------------------------------------
	// PPI信号線をエンキュー
	//-------------------------------------------
	for(i=0; i<n_ppi; i++){
		ppi[i]->testable_net += TRANS;		//遷移可能フラグ設置
		enqueue(nl_queue, (void*)ppi[i]);		//エンキュー
#ifdef DEBUG
		printf("遷移可能: %s (flag = %d)\n", ppi[i]->name, ppi[i]->testable_net);
#endif
	}
		
	//-------------------------------------------
	// 遷移可能信号線を探索(出力方向探索)
	//-------------------------------------------
	while((temp = (S_NLIST*)dequeue(nl_queue) ) != NULL){
		for(i=0; i<temp->n_out; i++){
			if(temp->out[i]->type != DFF){
				if(temp->out[i]->testable_net!=TRANS && temp->out[i]->testable_net!=OB_TR){
					temp->out[i]->testable_net += TRANS;		//観測可能フラグ設置
					enqueue(nl_queue, (void*)temp->out[i]);		//エンキュー
#ifdef DEBUG
					printf("遷移可能: %s (flag = %d)\n", temp->out[i]->name, temp->out[i]->testable_net);
#endif
				}
			}
		}
	}
	
	//========================================================
	// 遷移・観測可能信号判定
	//========================================================
	for(i=0; i<n_snet; i++){
		
		//遷移観測可能信号の場合
		if(s_nl[i].testable_net == OB_TR){
			s_nl[i].testable_net = YES;
			n_testable_net++;
#ifdef DEBUG
			printf("遷移観測可能: %s (flag = %d)\n", s_nl[i].name, s_nl[i].testable_net);
#endif
		}

		//それ以外
		else{
			s_nl[i].testable_net = NO;
		}
	}

	//========================================================
	// DEBUG
	//========================================================
#ifdef DEBUG
	printf("\n//-------------------------------------\n");
	printf("// DEBUG: 遷移故障テスト可能信号線解析\n");
	printf("//-------------------------------------\n");
	for(i=0; i<n_snet; i++){
		if(s_nl[i].testable_net == YES){
			printf("%s\n", s_nl[i].name);
		}
	}
	printf("\n");
#endif

}