//------------------------------------------------------------------------
//unsigned intでのビット単位テストパターン格納
//File name : bit_tp.h
//Date : 2010/5/26
//Designer : Yamazaki brothers
//Ver : 0.01
//------------------------------------------------------------------------
//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

#ifndef BIT_ARRAY_C
#define BIT_ARRAY_C

//------------------------------------------------------------------------
// 構造体定義
//------------------------------------------------------------------------
//---------------------------------
// テストパターン保存構造体
//---------------------------------
typedef struct bit_test_pattern{

	unsigned int int_num;		//確保したintの個数
	unsigned int *x_buf;		//Xバッファ
	unsigned int *p_buf;		//Pバッファ

}BIT_TP;


//---------------------------------
// マスク
//---------------------------------
static unsigned int MASK[] = {
			0x00000001,	//1bit目
			0x00000002,	//2bit目
			0x00000004,	//3bit目
			0x00000008,	//4bit目
			0x00000010,	//5bit目
			0x00000020,	//6bit目
			0x00000040,	//7bit目
			0x00000080,	//8bit目
			0x00000100,	//9bit目
			0x00000200,	//10bit目
			0x00000400,	//11bit目
			0x00000800,	//12bit目
			0x00001000,	//13bit目
			0x00002000,	//14bit目
			0x00004000,	//15bit目
			0x00008000,	//16bit目
			0x00010000,	//17bit目
			0x00020000,	//18bit目
			0x00040000,	//19bit目
			0x00080000,	//20bit目
			0x00100000,	//21bit目
			0x00200000,	//22bit目
			0x00400000,	//23bit目
			0x00800000,	//24bit目
			0x01000000,	//25bit目
			0x02000000,	//26bit目
			0x04000000,	//27bit目
			0x08000000,	//28bit目
			0x10000000,	//29bit目
			0x20000000,	//30bit目
			0x40000000,	//31bit目
			0x80000000	//32bit目
};


//------------------------------------------------------------------------
// プロトタイプ宣言
//------------------------------------------------------------------------

//構造体のメモリ確保(全ビットXで初期化)
BIT_TP *Alloc_Bit_TP(unsigned int);


//全ビットを0にセット
void All_Bit_Zero(BIT_TP *);

//全ビットを1にセット
void All_Bit_One(BIT_TP *);

//全ビットをXにセット
void All_Bit_X(BIT_TP *);


//指定ビット目を0にセット
void Set_NBit_Zero(BIT_TP *, unsigned int);

//指定ビット目を1にセット
void Set_NBit_One(BIT_TP *, unsigned int);

//指定ビット目をXにセット
void Set_NBit_X(BIT_TP *, unsigned int);


//指定ビット目の値をゲット(0, 1, X ?)
unsigned int  Get_NBit(BIT_TP *, unsigned int);

//Xバッファの指定ビット目の値をゲット(0, 1 ?)
unsigned int  Get_NBit_Xbuf(BIT_TP *, unsigned int);

#endif