//------------------------------------------------------------------------
//File name : queue.h
//Date : 2012/2/26
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------

//---------------------------------------------------------------------
// 構造体定義
//---------------------------------------------------------------------
//キュー構造体
typedef struct _queue_data{

	void	**queue;		// キュー
	int     front;			// フロント
	int     rear;			// リア
	int     size;			// キューのサイズ

}QUEUE;


//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
QUEUE	*init_queue (int);
void	enqueue		(QUEUE* ,void  *p);
void	*dequeue	(QUEUE*);
void	free_queue	(QUEUE*);
void	reset_queue	(QUEUE*);

