//------------------------------------------------------------------------
//フラグ初期化関数
//File name : reset_flag.h
//Date : 2011/04/28
//Designer : Yamazaki brothers
//Ver : 0.01
//------------------------------------------------------------------------
#include <stdlib.h>
#include <string.h>

//----------------------------------------------------------
// フラグ初期化構造体
//----------------------------------------------------------
typedef struct _reset_flag_{

	int	*flag;		//初期化対象ネットリストID保存
	int	n_flag;		//現在保持している初期化対象フラグ数
	int max;		//int *flagをmallocした量[最大格納数]

}RESET_F;

//------------------------------------------------------------------------
// プロトタイプ宣言
//------------------------------------------------------------------------

//構造体のメモリ確保
RESET_F *Alloc_Reset_Flag(int);

//構造体内容を初期化
void Reset_Reset_Flag(RESET_F *);

//初期化対象フラグをセット
void Set_Reset_Flag(RESET_F *, int);