//------------------------------------------------------------------------
//unsigned intでのビット単位テストパターン格納
//File name : bit_tp.c
//Date : 2010/5/26
//Designer : Yamazaki brothers
//Ver : 0.01
//------------------------------------------------------------------------

#include<stdio.h>
#include<stdlib.h>
#include"reset_flag.h"
#include"alloc.h"

//------------------------------------------------------------------------
// プロタイプ宣言
//------------------------------------------------------------------------

//------------------------------------------------------------------------
//  関数名 : Alloc_Reset_Flag
//  機  能 : ポインタ配列作成
//  戻り値 : ポインタ配列
//  引  数 : 外部入力数(横幅)
//------------------------------------------------------------------------
RESET_F *Alloc_Reset_Flag(int num){

	RESET_F *temp;

	//メモリ確保
	temp = (RESET_F *)malloc(sizeof(RESET_F));
	
	//メモリ確保と初期化
	temp->flag = INT_alloc(num);
	temp->n_flag = 0;
	temp->max = num;
	
	return temp;
}

//------------------------------------------------------------------------
//  関数名 : Reset_Reset_Flag
//  機  能 : 初期化対象フラグ数を初期化
//  戻り値 : なし
//  引  数 : ポインタ配列
//------------------------------------------------------------------------
void Reset_Reset_Flag(RESET_F *ptr){

	ptr->n_flag = 0;

}

//------------------------------------------------------------------------
//  関数名 : Set_Reset_Flag
//  機  能 : リセット対象フラグをセット
//  戻り値 : なし
//  引  数 : ポインタ配列
//------------------------------------------------------------------------
void Set_Reset_Flag(RESET_F *ptr, int target_flag){

	if(ptr->n_flag < ptr->max){
		//対象フラグセット
		ptr->flag[(ptr->n_flag)] = target_flag;
		
		//保持数インクリメント
		ptr->n_flag++;
	}
	else{
		printf("ERROR: reset_flag_orver\n");
		exit(-1);
	}
	
}//END