//------------------------------------------------------------------------
//File name : LSIM_only_cpi_xidnval.c
//Date : 2013/11/29
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<string.h>
#include	<stdlib.h>

#include	"../../Netlist/s_netlist.h"
#include	"../../option.h"
#include	"../../StandardHead.h"

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define DEBUG

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	TDF_LSIMpush			(S_NLIST*, unsigned int);
void	xid_lsim_cpi			(S_NLIST*, unsigned int);


//----------------------------------------------
//関数名：LSIM_only_cpi_xidnval
//機能　：【xid_nvalの値】制御ポイント挿入した付加回路部のみLSIM(FFCからDFFまでの間)
//引数　：なし
//戻り値：なし
//----------------------------------------------
void LSIM_only_cpi_xidnval(unsigned int ed_flag){

	int				nval_ffc;
	int				i;
	unsigned int	j;

	//================================================================
	// 全FFCのX抽出後値(xid_nval)をX抽出前に論理シミュレーション
	//================================================================
	for(i=0; i<n_ffc; i++){
		
		//--------------------------------------
		// 初期テスト集合のFFC設定値を取得
		//--------------------------------------
		nval_ffc = Get_NBit(ffc[i]->nval_t1, 0);

		//--------------------------------------
		// 初期テスト集合でFFC=1
		//--------------------------------------
		if(nval_ffc == 1){

			//xid_nvalのFFC=1に設定
			for(j=0; j<ffc[i]->xid_nval_t1->int_num; j++){
				ffc[i]->xid_nval_t1->x_buf[j] = 0xFFFFFFFF;		//オール1
				ffc[i]->xid_nval_t1->p_buf[j] = 0;				//オール0
			}

			//xid_nval値で制御ポイント部のみLSIM
			xid_lsim_cpi(ffc[i], ed_flag);
		}
		
		//--------------------------------------
		// 初期テスト集合でFFC=0
		//--------------------------------------
		else if(nval_ffc == 0){

			//xid_nvalのFFC=0に設定
			for(j=0; j<ffc[i]->xid_nval_t1->int_num; j++){
				ffc[i]->xid_nval_t1->x_buf[j] = 0;				//オール0
				ffc[i]->xid_nval_t1->p_buf[j] = 0xFFFFFFFF;		//オール1
			}
			
			//xid_nval値で制御ポイント部のみLSIM
			xid_lsim_cpi(ffc[i], ed_flag);
		}

		//--------------------------------------
		// その他の値
		//--------------------------------------
		else{
			printf("\nFFCの設定値がおかしいです！\n");
		}
	}

	//================================================================
	// 論理値確認
	//================================================================
#ifdef DEBUG
	printf("\n");
	for(i=0; i<n_tp; i++){
		printf("tp[%d]\n", i);
		for(j=0; j<n_snet; j++){
			printf("%s (%d %d)\n", s_nl[j].name, Get_NBit(s_nl[j].xid_nval_t1, i), Get_NBit(s_nl[j].xid_nval_t2, i));
		}
		printf("\n");
	}
	printf("\n");
#endif

}


//----------------------------------------------
//関数名：xid_lsim_cpi
//機能　：【遷移故障】制御ポイント挿入した付加回路部のみLSIM(FFCからDFFまでの間)
//引数　：ffc(FFC信号線)
//戻り値：なし
//※FFCとCPの値は再設置済み，2値・3値共通
//----------------------------------------------
void xid_lsim_cpi(S_NLIST *ffc, unsigned int ed_flag){

	int			k;
	unsigned int j;
	int			event_lev;					//レベル
	int			level_flag=0;				//event_lev更新時にbreakしないようにする
	S_NLIST		*temp_net;


	//=================================================
	// 1時刻目論理シミュレーション
	//=================================================
#ifdef DEBUG
	printf("\n//====================================\n");
	printf("// 1時刻目CPI部LSIM\n");
	printf("//====================================\n");
#endif

	//--------------------------------------------
	// FFCの出力信号線をレベルスタックにエンキュー
	//--------------------------------------------
	TDF_LSIMpush(ffc, ed_flag);
	
	event_lev = ffc->out[0]->level;

	
	//--------------------------------------------
	// 1時刻目論理シミュレーション
	//--------------------------------------------
	while(1){

		//------------------------------------------
		// レベライズスタックから信号線を取り出す
		//------------------------------------------
		temp_net = slev_temp[event_lev].net[slev_temp[event_lev].n_net-1];	//ケツから取り出す
		slev_temp[event_lev].n_net--;										//信号線保持数デクリメント
#ifdef DEBUG
		printf("%s (type:%d)\n", temp_net->name, temp_net->type);
#endif

		//------------------------------------------
		// 論理演算
		//------------------------------------------
		if(temp_net->type != DFF){
			
			//★xid_nval値を論理演算
			(*sfunc_t1_xid_lsim[temp_net->type])(temp_net);
			
			//出力信号線をエンキュー
			TDF_LSIMpush(temp_net, ed_flag);
		}
		
		//-------------------------------------------
		// event_levを更新(現event_levのスタック内信号線保持数が0になったとき)
		//-------------------------------------------
		if(slev_temp[event_lev].n_net == 0){

			//レベライズスタック内を探索(PI⇒PO側へ)
			for(k=event_lev+1; k<ffc->link_cpi[0]->in[0]->level+1; k++){	//対象FFの入力(PPO)までループ
				//保持信号線数≠0のレベルスタック発見
				if(slev_temp[k].n_net != 0){
					event_lev = k;		//event_lev更新
					level_flag++;		//break阻止
					break;
				}
			}

			//レベライズスタックの中身が全部空だった
			if(level_flag == 0){
				break;	//イベントドリブン終了
			}

			//次のevent_lev更新時に備えてlevel_flagを初期化
			level_flag = 0;

		}
	}
	

	//=================================================
	// 2時刻目論理シミュレーション
	//=================================================
#ifdef DEBUG
	printf("\n//====================================\n");
	printf("// 2時刻目CPI部LSIM\n");
	printf("//====================================\n");
#endif

	//--------------------------------------------
	// FFCの出力信号線をレベルスタックにエンキュー
	//--------------------------------------------
	TDF_LSIMpush(ffc, ed_flag+2);
	
	event_lev = ffc->out[0]->level;
	
	//--------------------------------------------
	// FFCに2時刻目PPI値を印加 (2時刻目FFCは0になるはず)
	//--------------------------------------------
	for(j=0; j<ffc->xid_nval_t2->int_num; j++){
		ffc->xid_nval_t2->x_buf[j] = ffc->in[0]->xid_nval_t1->x_buf[j];		//オール0
		ffc->xid_nval_t2->p_buf[j] = ffc->in[0]->xid_nval_t1->p_buf[j];		//オール1になるはず
	}

	//--------------------------------------------
	// 2時刻目論理シミュレーション
	//--------------------------------------------
	while(1){

		//------------------------------------------
		// レベライズスタックから信号線を取り出す
		//------------------------------------------
		temp_net = slev_temp[event_lev].net[slev_temp[event_lev].n_net-1];	//ケツから取り出す
		slev_temp[event_lev].n_net--;										//信号線保持数デクリメント
#ifdef DEBUG
		printf("%s (type:%d)\n", temp_net->name, temp_net->type);
#endif

		//------------------------------------------
		// 論理演算
		//------------------------------------------
		if(temp_net->type != DFF){
			
			//★xid_nval値を論理演算
			(*sfunc_t2_xid_lsim[temp_net->type])(temp_net);
			
			//出力信号線をエンキュー
			TDF_LSIMpush(temp_net, ed_flag+2);
		}

		//-------------------------------------------
		// event_levを更新(現event_levのスタック内信号線保持数が0になったとき)
		//-------------------------------------------
		if(slev_temp[event_lev].n_net == 0){

			//レベライズスタック内を探索(PI⇒PO側へ)
			for(k=event_lev+1; k<ffc->link_cpi[0]->in[0]->level+1; k++){	//対象FFの入力(PPO)までループ
				//保持信号線数≠0のレベルスタック発見
				if(slev_temp[k].n_net != 0){
					event_lev = k;		//event_lev更新
					level_flag++;		//break阻止
					break;
				}
			}

			//レベライズスタックの中身が全部空だった
			if(level_flag == 0){
				break;	//イベントドリブン終了
			}

			//次のevent_lev更新時に備えてlevel_flagを初期化
			level_flag = 0;

		}
	}

}
