//------------------------------------------------------------------------
//テストパターンファイル読み込み(.txt)
//File name : read_tp_txt.c
//Date : 2011/6/16
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../StandardHead.h"
#include	"../option.h"
#include	"../Lib/alloc.h"

//------------------------------------------------------------------------
// プロタイプ宣言
//------------------------------------------------------------------------
void	read_tp_txt_saf(FILE*, FILE*);
void	read_tp_txt_tdf(FILE*, FILE*);


//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

	//#define TP_DEBUG

//==========================
//| テストパターンファイル |
//|              (txt形式) |
//==========================
//|  001010011XX0101XXXXX0 |
//|  01X0111XX01000XX01XX0 |
//|  1111XX11101X111111XX0 |
//==========================
//1行に1テストパターンを記述


//==========================
//| PINファイル            |
//==========================
//|  a                     |
//|  b                     |
//|  c                     |
//==========================
//1行に1信号線名(PIかPPI)を記述


//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------
//---------------------------------------------------
//  関数名 : read_tp_txt
//  機  能 : テストパターンファイル読み込み(.txt)
//  戻り値 : なし
//  引  数 : tp(テストパターンファイルポインタ) pin(PINファイルポインタ)
//---------------------------------------------------
void read_tp_txt(FILE *tp, FILE *pin){

	char	temp[MAXN];

	//==========================================================================
	// テストパターン数カウント
	//==========================================================================
	while(fgets(temp,MAXN,tp)!=NULL)n_tp++;

	//ファイルポインタを先頭に戻す
	rewind(tp);


#ifdef TP_DEBUG
	printf("入力テストパターン数: %d\n", n_tp);
#endif
	
	//==========================================================================
	// テストパターン格納
	//==========================================================================
	if(opt.fmodel == SAF){
		read_tp_txt_saf(tp, pin);				//縮退故障の場合
		n_tp_int = pi_tp[0].tp->int_num;	//unsigned int配列数保存
	}
	else if(opt.fmodel == TDF){
		read_tp_txt_tdf(tp, pin);				//遷移故障の場合
		n_tp_int = pi_tp[0].tp->int_num;	//unsigned int配列数保存
	}


}//END

//---------------------------------------------------
//  関数名 : read_tp_txt_saf
//  機  能 : 縮退故障用：テストパターンファイル読み込み(.txt)
//  戻り値 : なし
//  引  数 : tp(テストパターンファイルポインタ) pin(PINファイルポインタ)
//---------------------------------------------------
void read_tp_txt_saf(FILE *tp, FILE *pin){

	int				i,j;
	char			get_temp;	//テストパターンを1文字ずつ一時保持
	unsigned int	nbit;		//格納先テストパターンビット
	char			str[MAXN];	//fgets用
	char			*net;		//信号線名
	
	//==========================================================================
	// メモリ確保
	//==========================================================================
	//外部入力(PI)テストパターン構造体
	pi_tp = (TPH*)malloc(n_pi * sizeof(TPH));
	
	//==========================================================================
	// 初期化
	//==========================================================================
	//テストパターン構造体
	for(i=0; i<n_pi; i++){
		pi_tp[i].tp = Alloc_Bit_TP(n_tp);	//テストパターン数分ビット確保
		pi_tp[i].flag = 0;
	}

	//正常値格納変数のメモリ確保
	for(i=0; i<n_net; i++)nl[i].nval = Alloc_Bit_TP(n_tp);
	
	//==========================================================================
	// PIN情報設定
	//==========================================================================
	//テストパターン構造体ID初期化
	j = 0;

	while(fgets(str,MAXN,pin)!=NULL){
		
		//改行削除
		net = strtok(str,"\n");
		if ( net[strlen(net)-1] == '\r' ){ //CR(復帰)を削除
			net[strlen(net)-1] = '\0';
		}
		//-------------------------------------
		// 対象信号線探索
		//-------------------------------------
		for(i=0; i<n_pi; i++){
			if(!strcmp(net,pi[i]->name)){
				
				//PIN情報設置
				pi_tp[j].nl_id = pi[i]->n;
				strcpy(pi_tp[j].pin_name, pi[i]->name);
				pi_tp[j].input = pi[i];

				//テストパターン構造体ID更新
				j++;
				break;
			}
		}
		//-------------------------------------
		// テスト対象とする信号線がない
		//-------------------------------------
		if(i==n_pi){
			fprintf(stderr,"Not found PIN : %s\n",str);
			exit(-1);
		}
	}
	
	//==========================================================================
	// テストパターン読み込み
	//==========================================================================
#ifdef TP_DEBUG
	printf("\n\n//------------------------\n");
	printf("// テストパターン格納DEBUG\n");
	printf("//------------------------\n");
#endif

	//全部格納したら終了
	for(i=0, nbit=0; (get_temp = fgetc(tp)) != EOF; i++){
		//-----------------//
		//   改行の場合    //
		//-----------------//
		if(get_temp == '\n'){
#ifdef TP_DEBUG
			printf("\n");
#endif
			i=-1;		//PI番号初期化
			nbit++;		//次のビット目へ
			continue;
		}

		//-----------------//
		//   0,1,Xの場合   //
		//-----------------//
		switch(get_temp){
			//----------------------------------------
			case '0':
#ifdef TP_DEBUG
				printf("0");
#endif
				Set_NBit_Zero(pi_tp[i].tp, nbit);
				break;
			//----------------------------------------
			case '1':
#ifdef TP_DEBUG
				printf("1");
#endif
				Set_NBit_One(pi_tp[i].tp, nbit);
				break;
			//----------------------------------------
			case 'X':
#ifdef TP_DEBUG
				printf("X");
#endif
				Set_NBit_X(pi_tp[i].tp, nbit);
				n_before_x++;	//テストパターン集合中の全X数更新
				break;
			//----------------------------------------
			case '\r':
				break;				
			//----------------------------------------
			default:
				printf("Read Test Pattern ERROR\n");
				exit(-1);
			//----------------------------------------
		}
	}

	//===================================================================================================================
	// ネットリスト構造体にテストパターンを格納
	//===================================================================================================================
	for(i=0; i<n_pi; i++){
		//テストパターンをNetlistの正常値(nval)に代入
		for(j=0; j<(int)pi[i]->nval->int_num; j++){
			pi_tp[i].input->nval->x_buf[j] = pi_tp[i].tp->x_buf[j];
			pi_tp[i].input->nval->p_buf[j] = pi_tp[i].tp->p_buf[j];
		}
	}

	//===================================================================================================================
	// DEBUG
	//===================================================================================================================
#ifdef TP_DEBUG
	printf("\n\n//------------------------\n");
	printf("// テストパターン格納DEBUG\n");
	printf("//------------------------\n");
	for(i=0; i<n_pi; i++){
		printf("PI[%d] name:%s nl_id:%d \n", i, pi_tp[i].pin_name, pi_tp[i].nl_id);
	}

	printf("\n\n");

	for(i=0; i<n_tp; i++){
		//PIのテストパターン表示
		for(j=0; j<n_pi; j++){
			//----------------------------------------
			if( (Get_NBit(pi_tp[j].tp,i)) == 0){
				printf("0");
			}
			//----------------------------------------
			else if( (Get_NBit(pi_tp[j].tp,i)) == 1){
				printf("1");
			}
			//----------------------------------------
			else if( (Get_NBit(pi_tp[j].tp,i)) == 3){
				printf("X");
			}
			//----------------------------------------
		}
		printf("\n");
	}
	
	printf("\n");
#endif

}//END


//---------------------------------------------------
//  関数名 : read_tp_txt_tdf
//  機  能 : 遷移故障用：テストパターンファイル読み込み(.txt)
//  戻り値 : なし
//  引  数 : tp(テストパターンファイルポインタ) pin(PINファイルポインタ)
//---------------------------------------------------
void read_tp_txt_tdf(FILE *tp, FILE *pin){
	
	int				i,j,k;
	int				count;
	char			get_temp;	//テストパターンを1文字ずつ一時保持
	unsigned int	nbit;		//格納先テストパターンビット
	char			str[MAXN];	//fgets用
	char			*net;		//信号線名
	
	//==========================================================================
	// メモリ確保
	//==========================================================================
	//外部入力(PI)テストパターン構造体
	pi_tp = (TPH*)malloc(n_spi * sizeof(TPH));

	//疑似外部入力(PPI)テストパターン構造体
	ppi_tp = (TPH*)malloc(n_ppi * sizeof(TPH));
	
	//信号線テーブル
	pin_tbl = (TPH**)malloc((n_spi+n_ppi) * sizeof(TPH) );

	//==========================================================================
	// 初期化
	//==========================================================================
	//(PI)外部入力テストパターン構造体
	for(i=0; i<n_spi; i++){
		pi_tp[i].tp = Alloc_Bit_TP(n_tp);	//テストパターン数分ビット確保
		pi_tp[i].flag = 0;
	}

	//(PPI)疑似外部入力テストパターン構造体
	for(i=0; i<n_ppi; i++){
		ppi_tp[i].tp = Alloc_Bit_TP(n_tp);	//テストパターン数分ビット確保
		ppi_tp[i].flag = 0;
	}

	//正常値格納変数のメモリ確保
	for(i=0; i<n_snet; i++){
		s_nl[i].nval_t1 = Alloc_Bit_TP(n_tp);
		s_nl[i].nval_t2 = Alloc_Bit_TP(n_tp);
	}

	//==========================================================================
	// PIN情報設定
	//==========================================================================
	//テストパターン構造体ID初期化
	j = 0;			//PIカウンタ
	k = 0;			//PPIカウンタ
	count = -1;		//信号線テーブルカウンタ

	while(fgets(str,MAXN,pin)!=NULL){

		//改行削除
		net = strtok(str,"\n");

		//信号線テーブルカウンタ更新
		count++;

		//-------------------------------------
		// 対象信号線探索
		//-------------------------------------
		//PIを探索
		for(i=0; i<n_spi; i++){
			if(!strcmp(net,spi[i]->name)){
				
				//PIN情報設置
				pi_tp[j].nl_id = spi[i]->n;
				strcpy(pi_tp[j].pin_name, spi[i]->name);
				pi_tp[j].sinput = spi[i];

				//テストパターン順格納
				pin_tbl[count] = &pi_tp[j];

				//テストパターン構造体ID更新
				j++;

				break;
			}
		}
		//PPIを探索
		if(i==n_spi){
			for(i=0; i<n_ppi; i++){
				if(!strcmp(net,ppi[i]->name)){
				
					//PIN情報設置
					ppi_tp[k].nl_id = ppi[i]->n;
					strcpy(ppi_tp[k].pin_name, ppi[i]->name);
					ppi_tp[k].sinput = ppi[i];
					
					//テストパターン順格納
					pin_tbl[count] = &ppi_tp[k];

					//テストパターン構造体ID更新
					k++;

					break;
				}
			}

			// テスト対象とする信号線がない
			if(i==n_ppi){
				fprintf(stderr,"Not found PIN : %s\n",str);
				exit(-1);
			}
		}
	}
	
	//==========================================================================
	// テストパターン読み込み
	//==========================================================================
#ifdef TP_DEBUG
	printf("\n\n//------------------------\n");
	printf("// テストパターン格納DEBUG\n");
	printf("//------------------------\n");
#endif

	//初期化
	nbit = 0;	//格納ビット目初期化(nbit: 0〜n_tp)
	i = 0;		//テストパターンビット目初期化(0〜n_spi)

	//テストパターン格納開始
	while((get_temp = fgetc(tp)) != EOF){

		switch(get_temp){
			//----------------------------------------
			case '0':
#ifdef TP_DEBUG
				printf("0");
#endif
				Set_NBit_Zero(pin_tbl[i]->tp, nbit);
				break;
			//----------------------------------------
			case '1':
#ifdef TP_DEBUG
				printf("1");
#endif
				Set_NBit_One(pin_tbl[i]->tp, nbit);
				break;
			//----------------------------------------
			case 'X':
#ifdef TP_DEBUG
				printf("X");
#endif
				Set_NBit_X(pin_tbl[i]->tp, nbit);
				n_before_x++;	//テストパターン集合中の全X数更新
				break;
				//----------------------------------------
				case '\n':
#ifdef TP_DEBUG
				printf("\n");
#endif
				i = -1;		//初期化
				nbit++;		//次のパターンへ
				break;
			//----------------------------------------
			default:
				printf("Read Test Pattern ERROR\n");
				exit(-1);
			//----------------------------------------
		}
		i++;
	}

	//===================================================================================================================
	// ネットリスト構造体にテストパターンを格納
	//===================================================================================================================
	//テストパターンをNetlistの正常値(nval)に代入
	//(PI)外部入力テストパターン構造体
	for(i=0; i<n_spi; i++){
		for(j=0; j<(int)spi[i]->nval_t1->int_num; j++){
			//1次刻目PIに印加
			pi_tp[i].sinput->nval_t1->x_buf[j] = pi_tp[i].tp->x_buf[j];
			pi_tp[i].sinput->nval_t1->p_buf[j] = pi_tp[i].tp->p_buf[j];

			//2時刻目PIに印加(ブロードサイド方式のため)
			pi_tp[i].sinput->nval_t2->x_buf[j] = pi_tp[i].tp->x_buf[j];
			pi_tp[i].sinput->nval_t2->p_buf[j] = pi_tp[i].tp->p_buf[j];
		}
	}

	//(PPI)疑似外部入力テストパターン構造体
	for(i=0; i<n_ppi; i++){
		for(j=0; j<(int)ppi[i]->nval_t1->int_num; j++){
			ppi_tp[i].sinput->nval_t1->x_buf[j] = ppi_tp[i].tp->x_buf[j];
			ppi_tp[i].sinput->nval_t1->p_buf[j] = ppi_tp[i].tp->p_buf[j];
		}
	}


	//===================================================================================================================
	// DEBUG
	//===================================================================================================================
#ifdef TP_DEBUG
	printf("\n\n//------------------------\n");
	printf("// テストパターン格納DEBUG\n");
	printf("//------------------------\n");
	for(i=0; i<(n_spi+n_ppi); i++){
		if(pin_tbl[i]->sinput->type == IN){
			printf("PI");
		}
		else if(pin_tbl[i]->sinput->type == DFF){
			printf("PPI");
		}
		printf("[%d] name:%s nl_id:%d \n", i, pin_tbl[i]->sinput->name, pin_tbl[i]->sinput->n);
	}

	printf("\n\n");


	for(i=0; i<n_tp; i++){

		for(j=0; j<(n_spi+n_ppi); j++){
			if( (Get_NBit(pin_tbl[j]->sinput->nval_t1,i)) == 0){
				printf("0");
			}
			else if( (Get_NBit(pin_tbl[j]->sinput->nval_t1,i)) == 1){
				printf("1");
			}
			else if( (Get_NBit(pin_tbl[j]->sinput->nval_t1,i)) == 3){
				printf("X");
			}
		}
		printf("\n");
	}
	
	printf("\n");
#endif


}//END