//------------------------------------------------------------------------
//File name : search_fstem_combinational.c
//Date : 2011/12/31
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../Lib/alloc.h"
#include	"../Netlist/netlist.h"
#include	"../StandardHead.h"
#include	"../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define DEBUG

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : search_fstem_combinational
//  機  能 : FOUT-STEM解析とポインタ接続[組合せ回路用]
//  戻り値 : なし
//  引  数 : なし
//----------------------------------------------
void	search_fstem_combinational(){

	int		i,j;
	int		count=0;
	
	//============================================================
	// FOUT_STEM数計算
	//============================================================
	for(i=0;i<n_net;i++){
		if(nl[i].type == FOUT){
			if(nl[i].in[0]->f_stem == NO){
				nl[i].in[0]->f_stem = YES;		//FOUT_STEM
				n_fstem++;						//回路中のFOUT_STEM数更新
			}
		}
	}

	//============================================================
	// FOUT_STEMポインタ作成
	//============================================================
	//メモリ確保
	fstem = PNL_alloc(n_fstem);


	//レベル降順でポインタ接続
	for(i=max_level; i>=0; i--){
		if(count == n_fstem){
			break;
		}
		else{
			for(j=0; j<nml_lev[i].n_net; j++){
				if(nml_lev[i].net[j]->f_stem == YES){	//FOUT-STEM
					fstem[count] = nml_lev[i].net[j];	//アドレス代入
					count++;							//FOUT-STEM番目の更新
				}
			}
		}
	}

#ifdef DEBUG
	for(i=0; i<n_fstem; i++){
		printf("stem[%d]: %s\n", i, fstem[i]->name);
	}
#endif

}//END