//------------------------------------------------------------------------
//File name : search_fstem_sequential.c
//Date : 2011/12/31
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../Lib/alloc.h"
#include	"../Netlist/s_netlist.h"
#include	"../StandardHead.h"
#include	"../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define DEBUG

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : search_fstem_sequential
//  機  能 : FOUT-STEM解析とポインタ接続[順序回路用]
//  戻り値 : なし
//  引  数 : なし
//----------------------------------------------
void	search_fstem_sequential(){

	int		i,j;
	int		count=0;
	
	//============================================================
	// FOUT_STEM数計算
	//============================================================
	for(i=0;i<n_snet;i++){
		if(s_nl[i].type == FOUT){
			if(s_nl[i].in[0]->f_stem == NO){
				s_nl[i].in[0]->f_stem = YES;	//FOUT_STEM
				n_sfstem++;						//回路中のFOUT_STEM数更新
			}
		}
	}

	//============================================================
	// FOUT_STEMポインタ作成
	//============================================================
	//メモリ確保
	sfstem = SPNL_alloc(n_sfstem);


	//レベル降順でポインタ接続
	for(i=max_level; i>=0; i--){
		if(count == n_sfstem){
			break;
		}
		else{
			for(j=0; j<nml_slev[i].n_net; j++){
				if(nml_slev[i].net[j]->f_stem == YES){	//FOUT-STEM
					sfstem[count] = nml_slev[i].net[j];	//アドレス代入
					count++;							//FOUT-STEM番目の更新
				}
			}
		}
	}

#ifdef DEBUG
	printf("\n//--------------------------------\n");
	printf("// DEBUG : STEM解析\n");
	printf("//--------------------------------\n");
	for(i=0; i<n_sfstem; i++){
		printf("%s\n", sfstem[i]->name);
	}
#endif

}