//------------------------------------------------------------------------
//File name : count_cpi_xbit_rate.c
//Date : 2013/11/27
//Designer : H.Yamazaki
//Ver : 0.01
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<time.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

#define	DEBUG

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：count_cpi_xbit_rate
//機能　：CPI_XID時のX抽出率の計算
//引数　：なし
//戻り値：なし
//--------------------------------------------------------------------
void count_cpi_xbit_rate(){

	int			i,j;

	//=========================================================
	// 初期化
	//=========================================================
	n_ori_x = 0;	//PI+PPIに含まれるX数(FFCは排除)
	n_cpi_x = 0;	//PI+CPに含まれるX数(FFCは排除)
	n_pi_cp_x = 0;	//PI+PPI+CPに含まれるX数(FFCは排除)

	//=========================================================
	// オリジナルPI,PPI部の計算
	//=========================================================
	for(i=0; i<n_tp; i++){
				
		//オリジナルPIのX数
		for(j=0; j<n_ori_pi; j++){
			if(Get_NBit(ori_pi[j]->xid_nval_t1, i)==3){
				n_ori_x++;
				n_cpi_x++;
				n_pi_cp_x++;
			}
		}
				
		//オリジナルPPIのX数
		for(j=0; j<n_ori_dff; j++){
			if(Get_NBit(ori_dff[j]->xid_nval_t1, i)==3){
				n_ori_x++;
				n_cpi_x++;
			}
		}
	}

	//=========================================================
	// CP部の計算(FFC=1の箇所のみ)
	//=========================================================
	for(i=0; i<n_tp; i++){
		
		//FFC=1の信号線なら計算
		for(j=0; j<n_ffc; j++){
			if(Get_NBit(ffc[j]->nval_t1, i) == 1){

				//FFCに含まれるX数計算
				/*
				if(Get_NBit(ffc[j]->xid_nval_t1, i) == 3){
					n_cpi_x++;
				}
				*/
				
				//CPに含まれるX数計算
				if(Get_NBit(ffc[j]->link_cpi[0]->link_cpi[0]->xid_nval_t1, i) == 3){
					n_cpi_x++;
					n_pi_cp_x++;
				}
			}
		}
	}
		
}