//------------------------------------------------------------------------
//File name : sort_priority_ppo
//Date : 2013/11/18
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<string.h>
#include	<stdlib.h>

#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../StandardHead.h"

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
//#pragma warning ( disable : 4996 )

	//#define DEBUG
//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//----------------------------------------------
//関数名：sort_priority_ppo
//機能　：優先パスフラグのある順にPPOをソート
//引数　：priority(優先フラグ値)
//戻り値：なし
//※コーン内入力数順のソートは完了済み
//----------------------------------------------
void sort_priority_ppo(unsigned int priority){

	int					i,j;
	XID_PROPA_PO**		temp;


#ifdef DEBUG
	printf("\n\n//=============================================\n");
	printf("// DEBUG: 優先パスPPOソート\n");
	printf("//=============================================\n");
	printf("【ソート前PPO】\n");
	for(i=0; i<n_ppo; i++)printf("%s\n",ppo[sort_propa_po[i]->po_id]->name);
#endif

	//===========================================
	// メモリ確保
	//===========================================
	temp = (XID_PROPA_PO**)malloc(sizeof(XID_PROPA_PO*) * n_ppo);	//PPO数分メモリ確保

	
	//===========================================
	// tempに優先パスフラグのある順にPPOをソート
	//===========================================
	//--------------------------------
	// 優先パスフラグ有りのPPOを代入
	//--------------------------------
	j=0;
	for(i=0; i<n_ppo; i++){
		if(ppo[sort_propa_po[i]->po_id]->pri_path == priority){
			temp[j] = sort_propa_po[i];
			j++;
		}
	}
	
	//--------------------------------
	// 残りを代入
	//--------------------------------
	for(i=0; i<n_ppo; i++){
		if(ppo[sort_propa_po[i]->po_id]->pri_path != priority){
			temp[j] = sort_propa_po[i];
			j++;
		}
	}


	//===========================================
	// sort_propa_poにソート結果を戻す
	//===========================================
	for(i=0; i<n_ppo; i++)sort_propa_po[i] = temp[i];


	
#ifdef DEBUG
	printf("\n【ソート後PPO】\n");
	for(i=0; i<n_ppo; i++)printf("%s\n",ppo[sort_propa_po[i]->po_id]->name);
#endif

	//===========================================
	// メモリ解放
	//===========================================
	free(temp);
}