//------------------------------------------------------------------------
//File name : TDF_3v_ED_PPSFP_Ndrop.c
//Date : 2013/9/16
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../../Netlist/s_netlist.h"
#include	"../../../Lib/bit_tp.h"
#include	"../../../Lib/bit_int.h"
#include	"../../../StandardHead.h"
#include	"../../../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	TDF_EDpush				(S_NLIST*,unsigned int);
void	TDF_FOUT_3v_CPT_Ndrop	(int, S_NLIST*, int, unsigned int*, S_NLIST*);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define ED_DEBUG

//---------------------------------------------------------------------
// 静的変数
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : TDF_3v_ED_PPSFP_Ndrop
//  機  能 : STEMからの3値遷移故障PPSFPイベントドリブン
//  戻り値 : なし
//  引  数 : ffr_id(ステムのFFR番号), stem_net(ステム信号線), ed_flag(計算済みフラグ値), ui_num(unsigned int番目)
//----------------------------------------------
void	TDF_3v_ED_PPSFP_Ndrop(int ffr_id, S_NLIST* stem_net, unsigned int ed_flag, int ui_num){
	
	int				i;
	int				level_flag=0;		//event_lev更新時にbreakしないようにする
	int				event_lev;			//イベント計算するレベル(※計算しながら更新)
	S_NLIST			*temp_net;			//レベライズスタックから取り出した信号線を一時的に格納
	unsigned int	det_tp_list=0;		//POまで故障伝搬したTPリスト【0:未伝搬 1:伝搬(=故障検出)】	
	
	
	//=========================================================
	// FOUTステム信号線の次イベント(代表信号線)をレベライズスタックへプッシュ
	//=========================================================
	TDF_EDpush(stem_net, ed_flag);


	//=========================================================
	// イベントドリブン開始レベル決定
	//=========================================================
	event_lev = stem_net->out[0]->level;

	for(i=1; i<stem_net->n_out; i++){
		if(event_lev > stem_net->out[i]->level){
			event_lev = stem_net->out[i]->level;	//低いレベルがあったら更新
		}
	}

	//=========================================================
	// イベントドリブン実行
	//=========================================================
	while(event_lev != (max_level+1) ){

		//-------------------------------------------
		// レベライズスタックから信号線を取り出す
		//-------------------------------------------
		temp_net = slev_temp[event_lev].net[slev_temp[event_lev].n_net-1];	//ケツから取り出す
		
		//-------------------------------------------
		// 計算済みフラグを代入
		//-------------------------------------------
		temp_net->flag = ed_flag;

		//-------------------------------------------
		// temp_netの故障値計算
		//-------------------------------------------
		(*sfunc_ed_ppsfp[temp_net->type])(temp_net, ui_num, ed_flag);
		
		//-------------------------------------------
		// temp_netの正常値==故障値(故障値消滅⇒出力代表信号線はプッシュしない)
		//-------------------------------------------
		if(temp_net->nval_t2->x_buf[ui_num]==temp_net->x_fault && temp_net->nval_t2->p_buf[ui_num]==temp_net->p_fault){
			slev_temp[event_lev].n_net--;	//現在レベルのレベライズスタックの保持信号線数をデクリメント
		}

		//-------------------------------------------
		// temp_netの正常値≠故障値(故障伝搬)
		//-------------------------------------------
		else{
			//--------------------------------------------------------------------
			//temp_netが疑似外部出力(PPO)の場合CPT
			//--------------------------------------------------------------------
			if(temp_net->ppo_flag == YES){
				TDF_FOUT_3v_CPT_Ndrop(ffr_id, stem_net, ui_num, &det_tp_list, temp_net);
				slev_temp[event_lev].n_net--;	//現在レベルのレベライズスタックの保持信号線数をデクリメント

				//------------------------------------------------------
				//★det_tp_listがオール1になった(32bit分すべて故障検出)
				//------------------------------------------------------
				if(det_tp_list == 0xFFFFFFFF){

					//レベライズスタック内を初期化
					for(i=event_lev; i<max_level+1; i++){
						if(slev_temp[i].n_net != 0){
							slev_temp[i].n_net = 0;
						}
					}
					
					//一応レベルフラグを0にしとく
					level_flag = 0;
					
					break;	//イベントドリブン終了
				}
			}
			
			//--------------------------------------------------------------------
			//内部信号線の場合は出力信号線をレベライズスタックへプッシュ
			//--------------------------------------------------------------------
			else{
				TDF_EDpush(temp_net, ed_flag);		//temp_netの出力をプッシュ
				slev_temp[event_lev].n_net--;		//現在レベルのレベライズスタックの保持信号線数をデクリメント
			}
		}
				
		//-------------------------------------------
		// event_levを更新(現event_levのスタック内信号線保持数が0になったとき)
		//-------------------------------------------
		if(slev_temp[event_lev].n_net == 0){

			//レベライズスタック内を探索
			for(i=event_lev+1; i<=max_level; i++){
				//保持信号線数≠0のレベルスタック発見
				if(slev_temp[i].n_net != 0){
					event_lev = i;		//event_lev更新
					level_flag++;		//break阻止
					break;
				}
			}

			//レベライズスタックの中身が全部空だった
			if(level_flag == 0){
				break;	//イベントドリブン終了
			}

			//次のevent_lev更新時に備えてlevel_flagを初期化
			level_flag = 0;

		}

	}//while


	//*******************************************
	// バグチェック //
	for(i=0; i<=max_level; i++){
		//保持信号線数≠0のレベルスタック発見
		if(slev_temp[i].n_net != 0){
			printf("\n\n//-------------------------------\n");
			printf("// ERROR：レベルスタック保持信号線数≠0\n");
			printf("//-------------------------------\n");
			printf("STEM:%s [%d]  ed_flag:%u ui_num:%d\n", stem_net->name, ffr_id, ed_flag, ui_num);
			printf("レベル:%d 個数:%d\n", i, slev_temp[i].n_net);
			exit(-1);
		}
	}
	//********************************************

}