//------------------------------------------------------------------------
//File name : SAF_3v_XID_SPPFP_FSIM.c
//Date : 2012/8/18
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../../Netlist/netlist.h"
#include	"../../../Lib/bit_int.h"
#include	"../../../StandardHead.h"
#include	"../../../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
void	SAF_3v_XID_SPPFP_LSIM	(int);
int		SAF_3v_XID_SPPFP		(int, XID_LIST**, int, unsigned int);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------

//------------------
//    one_tp_nval  |
//-----------------|
// 0 |     0       | 
// 1 |     1       |
// X |     3       |
// -----------------

//#define	SPPFP_DEBUG

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : SAF_3v_XID_SPPFP_FSIM
//  機  能 : X抽出後テストパターンで3値故障シミュレーション
//  戻り値 : n_det_fault(検出故障数)
//  引  数 : tp_id(故障SIMの対象となるテストパターン), ed_flag(イベントドリブンフラグ), t_fault(故障SIMの対象とする故障リスト)
//----------------------------------------------
int	SAF_3v_XID_SPPFP_FSIM(int tp_id,  unsigned int *ed_flag, XID_LIST** t_fault){

	int			i;
	int			count=0;				//t_fault内に何個対象故障を入れたかのカウンタ	
	int			n_det_fault=0;			//検出故障数(1故障1回カウント)
#ifdef SPPFP_DEBUG
	int			j;
#endif

	//=========================================================
	// DEBUG:テストパターン表示
	//=========================================================
#ifdef SPPFP_DEBUG
	printf("\nX抽出後テストパターン[%d]\n", tp_id);
	for(i=0; i<n_pi; i++){
		//----------------------------------
		//3値の場合{0,1,X}
		//----------------------------------
		j = Get_NBit(pi[i]->xid_nval, tp_id);

		if(j==0){
			printf("0");
		}
		else if(j==1){
			printf("1");
		}
		else if(j==3){
			printf("X");
		}
	}
	printf("\n");
#endif
	
	//=========================================================
	// X抽出後テストパターンの3値SPPFP
	//=========================================================
	for(i=0; i<n_net; i++){

		//--------------------------------------------------
		// 32個SPPFPの対象となる故障を集める
		//--------------------------------------------------
		//■0縮退故障
		if(nl[i].test_sf0==YES && nl[i].det_sf0>=1 && nl[i].xid_det_sf0==NO){	//代表故障 && 1回以上検出してる && X抽出後で未検出
			
			//対象テストパターンの初期テストパターンで検出可能
			if(Get_NBit_INT(fdic_sa0[tp_id], i) == YES){

				//対象テスパターンのX抽出後テストパターンでは未検出
				if(Get_NBit_INT(xid_fdic_sa0[tp_id], i) == NO){

					//対象テストパターンの対象信号線(nl[i])がXでない(故障値設定が可能)
					if(Get_NBit(nl[i].xid_nval, tp_id) != 3){
#ifdef SPPFP_DEBUG
						printf("%d個目 : %s  SF0\n", count, nl[i].name);
#endif
						//対象故障リストへ追加
						t_fault[count]->net			= &nl[i];	//信号線名
						t_fault[count]->fault_type	= SAF0;		//故障タイプ(0縮退故障)

						//対象故障リスト内の故障数更新
						count++;
					}
				}
			}
		}

		//■1縮退故障
		if(nl[i].test_sf1==YES && nl[i].det_sf1>=1 && nl[i].xid_det_sf1==NO){	//代表故障 && 1回以上検出してる && X抽出後で未検出
		
			//対象テストパターンの初期テストパターンで検出可能
			if(Get_NBit_INT(fdic_sa1[tp_id], i) == YES){

				//対象テスパターンのX抽出後テストパターンでは未検出
				if(Get_NBit_INT(xid_fdic_sa1[tp_id], i) == NO){

					//対象テストパターンの対象信号線(nl[i])がXでない(故障値設定が可能)
					if(Get_NBit(nl[i].xid_nval, tp_id) != 3){
#ifdef SPPFP_DEBUG
						printf("%d個目 : %s  SF1\n", count, nl[i].name);
#endif
						//対象故障リストへ追加
						t_fault[count]->net			= &nl[i];	//信号線名
						t_fault[count]->fault_type	= SAF1;		//故障タイプ(1縮退故障)

						//対象故障リスト内の故障数更新
						count++;
					}
				}
			}
		}

		//--------------------------------------------------
		// 32故障が集まったらSPPFP
		//--------------------------------------------------
		if(count == 31){
			//故障シミュレーション
			n_det_fault += SAF_3v_XID_SPPFP(tp_id, t_fault, count, *ed_flag);	//※故障辞書変数が違うためSAF_3v_SPPFPとは関数(ほとんど一緒だが・・・)

			//対象故障リスト内の故障数カウンタ初期化
			count = 0;

			//EDフラグ更新
			*ed_flag+=2;
		}

	}

	//=========================================================
	// 3値SPPFP (故障が32未満でループ抜けた場合実行)
	//=========================================================
	if(count > 0){
		//故障シミュレーション
		n_det_fault += SAF_3v_XID_SPPFP(tp_id, t_fault, count, *ed_flag);		//※故障辞書変数が違うためSAF_3v_SPPFPとは別関数(ほとんど一緒だが・・・)

		//EDフラグ更新
		*ed_flag+=2;
	}

	return n_det_fault;

}