//------------------------------------------------------------------------
//File name : file_output_time2_tp.c
//Date : 2013/12/19
//Designer : H.Yamazaki
//Ver : 0.01
//
//memo:
//------------------------------------------------------------------------
#include	<stdio.h>
#include	<stdlib.h>
#include	<string.h>
#include	<time.h>

#include	"../StandardHead.h"
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../option.h"
#include	"../XID/Xidentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
#define _CRT_SECURE_NO_DEPRECATE
#pragma warning ( disable : 4996 )

#define	DEBUG

//-----------------
//    X-buf   P-buf|
//-----------------|
// 0 |   0  |  1   | 
// 1 |   1  |  0   |
// X |   1  |  1   |
// -----------------

//----------------------------------------------------------------------
// 静的変数
//----------------------------------------------------------------------

//--------------------------------------------------------------------
//関数名：file_output_time2_tp
//機能　：初期テスト集合のPIと2時刻目PPIをファイル出力
//引数　：fp(出力用ファイルポインタ)
//戻り値：なし
//--------------------------------------------------------------------
void file_output_time2_tp(FILE* fp, char** file_names){

	int			i,j;
	FILE		*pin;
	char		str[1000];
	
	//==============================================================
	// PINファイルをファイルオープン
	//==============================================================
	strcpy(str, "pin_");
	strcat(str, file_names[F_T2_TP]);
	pin = fopen(str, "w");

	//==============================================================
	// TDF_XIDかTDF_FSIMの場合
	//==============================================================
	if(opt.fmodel==TDF && (opt.xid==YES || opt.fsim==YES) ){

		//---------------------------------------------------
		// PINファイルをファイル出力
		//---------------------------------------------------
		//PI
		for(i=0; i<n_spi; i++){
			fprintf(pin, "%s\n", spi[i]->name);
		}

		//PPI
		for(i=0; i<n_ppi; i++){
			fprintf(pin, "%s\n", ppi[i]->name);
		}
		
		//---------------------------------------------------
		// 初期テスト集合の論理値をファイル出力
		//---------------------------------------------------
		for(j=0; j<n_tp; j++){
			//PI
			for(i=0; i<n_spi; i++){
				fprintf(fp, "%d", Get_NBit_Xbuf(spi[i]->nval_t1, j));
			}

			//PPI
			for(i=0; i<n_ppi; i++){
				fprintf(fp, "%d", Get_NBit_Xbuf(ppi[i]->nval_t2, j));
			}			
			fprintf(fp, "\n");
		}
	}


	//==============================================================
	// CPI_XIDの場合
	//==============================================================
	else if(opt.cpi_xid == YES){
		
		//---------------------------------------------------
		// PINファイルをファイル出力
		//---------------------------------------------------
		//PI
		for(i=0; i<n_ori_pi; i++){
			fprintf(pin, "%s\n", ori_pi[i]->name);
		}

		//PPI
		for(i=n_ori_dff-1; i>=0; i--){
			fprintf(pin, "%s\n", ori_dff[i]->name);
		}
		
		//---------------------------------------------------
		// 初期テスト集合の論理値をファイル出力
		//---------------------------------------------------
		for(j=0; j<n_tp; j++){
			//PI
			for(i=0; i<n_ori_pi; i++){
				fprintf(fp, "%d", Get_NBit_Xbuf(ori_pi[i]->nval_t1, j));
			}

			//PPI
			for(i=n_ori_dff-1; i>=0; i--){
				fprintf(fp, "%d", Get_NBit_Xbuf(ori_dff[i]->nval_t2, j));
			}
			fprintf(fp, "\n");
		}
	}

	
	//==============================================================
	// PINファイルのファイルクローズ
	//==============================================================
	fclose(pin);
}