//------------------------------------------------------------------------
//File name : file_output_lsim.c
//Date : 2013/10/7
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../Netlist/netlist.h"
#include	"../Netlist/s_netlist.h"
#include	"../Lib/bit_int.h"
#include	"../Lib/bit_tp.h"
#include	"../StandardHead.h"
#include	"../option.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	#define	DEBUG

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : file_output_lsim
//  機  能 : 全パターン全信号線の論理値ファイル出力
//  戻り値 : なし
//  引  数 : ファイルポインタ
//----------------------------------------------
void	file_output_lsim(FILE* fp){

	int		i,j;
	int		val;

	//================================================
	// 縮退故障の場合(故障フラグYESのやつのみ出力)
	//================================================
	if(opt.fmodel == SAF){

		//--------------------------------------------
		// 2値の場合
		//--------------------------------------------
		if(n_before_x == 0){
			for(i=0; i<n_tp; i++){
				fprintf(fp, "tp%d\n", i);
				for(j=0; j<n_net; j++){
					val = Get_NBit_Xbuf(nl[j].nval, i);
					if(val == 0){
						fprintf(fp, "%s 0\n", nl[j].name);
					}
					else if(val == 1){
						fprintf(fp, "%s 1\n", nl[j].name);
					}
				}
				fprintf(fp, "\n");
			}
		}
		//--------------------------------------------
		// 3値の場合
		//--------------------------------------------
		else{
			for(i=0; i<n_tp; i++){
				fprintf(fp, "tp%d\n", i);
				for(j=0; j<n_net; j++){
					val = Get_NBit(nl[j].nval, i);
					if(val == 0){
						fprintf(fp, "%s 0\n", nl[j].name);
					}
					else if(val == 1){
						fprintf(fp, "%s 1\n", nl[j].name);
					}
					else if(val == 3){
						fprintf(fp, "%s X\n", nl[j].name);
					}
				}
				fprintf(fp, "\n");
			}
		}

	}
	
	//================================================
	// 遷移故障の場合
	//================================================
	else if(opt.fmodel == TDF){
		
		//--------------------------------------------
		// 2値の場合
		//--------------------------------------------
		if(n_before_x == 0){
			for(i=0; i<n_tp; i++){
				fprintf(fp, "tp%d\n", i);
				for(j=0; j<n_snet; j++){
					//--------------------------------------
					// 1時刻目
					//--------------------------------------
					val = Get_NBit_Xbuf(s_nl[j].nval_t1, i);
					if(val == 0){
						fprintf(fp, "%s 0 ", s_nl[j].name);
					}
					else if(val == 1){
						fprintf(fp, "%s 1 ", s_nl[j].name);
					}
					
					//--------------------------------------
					// 2時刻目
					//--------------------------------------
					val = Get_NBit_Xbuf(s_nl[j].nval_t2, i);
					if(val == 0){
						fprintf(fp, "0\n", s_nl[j].name);
					}
					else if(val == 1){
						fprintf(fp, "1\n", s_nl[j].name);
					}
				}
				fprintf(fp, "\n");
			}
		}
		//--------------------------------------------
		// 3値の場合
		//--------------------------------------------
		else{
			for(i=0; i<n_tp; i++){
				fprintf(fp, "tp%d\n", i);
				for(j=0; j<n_snet; j++){
					//--------------------------------------
					// 1時刻目
					//--------------------------------------
					val = Get_NBit(s_nl[j].nval_t1, i);
					if(val == 0){
						fprintf(fp, "%s 0 ", s_nl[j].name);
					}
					else if(val == 1){
						fprintf(fp, "%s 1 ", s_nl[j].name);
					}
					else if(val == 3){
						fprintf(fp, "%s X ", s_nl[j].name);
					}
					
					//--------------------------------------
					// 2時刻目
					//--------------------------------------
					val = Get_NBit(s_nl[j].nval_t2, i);
					if(val == 0){
						fprintf(fp, "0\n", s_nl[j].name);
					}
					else if(val == 1){
						fprintf(fp, "1\n", s_nl[j].name);
					}
					else if(val == 3){
						fprintf(fp, "X\n", s_nl[j].name);
					}
				}
				fprintf(fp, "\n");
			}
		}


	}

	//ファイルクローズ
	//fclose(fp);
}