//------------------------------------------------------------------------
//File name : SAF_3v_XID_SPPFP_LSIM.c
//Date : 2012/8/18
//Designer : H.Yamazaki
//Ver : 0.01
//------------------------------------------------------------------------
#include	<stdio.h>
#include    <stdlib.h>
#include	"../../../Netlist/netlist.h"
#include	"../../../Lib/bit_int.h"
#include	"../../../StandardHead.h"
#include	"../../../option.h"
#include	"../../XIdentification.h"

//---------------------------------------------------------------------
// プロトタイプ宣言
//---------------------------------------------------------------------
static void sppfp_lsim_3v_xid_fout	(NLIST*);
static void sppfp_lsim_3v_xid_buf	(NLIST*);
static void sppfp_lsim_3v_xid_inv	(NLIST*);
static void sppfp_lsim_3v_xid_and	(NLIST*);
static void sppfp_lsim_3v_xid_nand	(NLIST*);
static void sppfp_lsim_3v_xid_or	(NLIST*);
static void sppfp_lsim_3v_xid_nor	(NLIST*);
static void sppfp_lsim_3v_xid_exor	(NLIST*);
static void sppfp_lsim_3v_xid_exnor	(NLIST*);

//---------------------------------------------------------------------
// 定義
//---------------------------------------------------------------------
	//#define		LSIM_DEBUG

//------------------
//    one_tp_nval  |
//-----------------|
// 0 |     0       | 
// 1 |     1       |
// X |     3       |
// -----------------

//------------------------------------------------------------------------
//  外部関数
//------------------------------------------------------------------------
//----------------------------------------------
//  関数名 : SAF_3v_XID_SPPFP_LSIM
//  機  能 : X抽出後テストパターンで3値論理シミュレーション(X抽出専用)
//  戻り値 : なし
//  引  数 : tp_id(SPPFPの対象となるTP番号)
//  【未使用関数】
//----------------------------------------------
void	SAF_3v_XID_SPPFP_LSIM(int tp_id){

	int i,j;


	//================================================
	// 関数ポインタ設定
	//================================================
	static void(*func[20])(NLIST*);
	func[FOUT]	= sppfp_lsim_3v_xid_fout;
	func[BUF]	= sppfp_lsim_3v_xid_buf;
	func[INV]	= sppfp_lsim_3v_xid_inv;
	func[AND]	= sppfp_lsim_3v_xid_and;
	func[NAND]	= sppfp_lsim_3v_xid_nand;
	func[OR]	= sppfp_lsim_3v_xid_or;
	func[NOR]	= sppfp_lsim_3v_xid_nor;
	func[EXOR]	= sppfp_lsim_3v_xid_exor;
	func[EXNOR]	= sppfp_lsim_3v_xid_exnor;
	
	
	//================================================
	// X抽出後のテストパターンを印加
	//================================================
	for(i=0; i<n_pi; i++){

		//----------------------------------------
		//対象TPの対象PIがドントケアじゃない場合場合
		//----------------------------------------
		if(Get_NBit(pi[i]->xid_nval, tp_id) != 3){
			pi[i]->one_tp_nval = (int)Get_NBit(pi[i]->nval, tp_id);		//対象TPの対象PIの正常値{0 or 1}を直接代入
		}
		
		//----------------------------------------
		//ドントケアの場合
		//----------------------------------------
		else{
			pi[i]->one_tp_nval = 3;	//ドントケア:3 を代入
		}
	}

	
	//================================================
	// 論理シミュレーション
	//================================================
	fprintf(stderr,"\n SAF_3v_XID_SPPFP_LSIM\n");
	fprintf(stderr,"|----+----|----+----|----+----|----+----|----+----|\n");

	for(i=1; i<max_level+1; i++){
		// Progress Bar
		if(((int)i % (int)(((max_level)*2/100)+1)) == 0)fprintf(stderr,"*");

		//論理SIM
		for(j=0; j<nml_lev[i].n_net; j++){
			(*func[nml_lev[i].net[j]->type])(nml_lev[i].net[j]);
		}
	}

	

}//END
//*************************************************************************************************

//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_fout
//  機  能 : FOUT論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
//----------------------------------------------
static void sppfp_lsim_3v_xid_fout(NLIST *net){
	
	//stemの正常値をそのまま代入
	net->one_tp_nval = net->in[0]->one_tp_nval;
}

//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_buf
//  機  能 : BUF論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
//----------------------------------------------
static void sppfp_lsim_3v_xid_buf(NLIST *net){
	
	//入力[0]の正常値をそのまま代入
	net->one_tp_nval= net->in[0]->one_tp_nval;
}

//----------------net->one_tp_nval------------------------------
//  関数名 : sppfp_lsim_3v_xid_inv
//  機  能 : INV論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
//----------------------------------------------
static void sppfp_lsim_3v_xid_inv(NLIST *net){
	
	//----------------------------------
	// 入力[0]の正常値0
	//----------------------------------
	if(net->in[0]->one_tp_nval == 0){
		net->one_tp_nval = 1;	//反転値1を代入
	}
	//----------------------------------
	// 入力[0]の正常値1
	//----------------------------------
	else if(net->one_tp_nval == 1){
		net->one_tp_nval = 0;	//反転値0を代入
	}
	//----------------------------------
	// 入力[0]の正常値X
	//----------------------------------
	else if(net->one_tp_nval == 3){
		net->one_tp_nval = 3;	//ドントケアのまま
	}
}

//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_and
//  機  能 : AND論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
//----------------------------------------------
static void sppfp_lsim_3v_xid_and(NLIST *net){
	
	int		i;
	
	//===========================================
	//初期値代入 (in[0]の値)
	//===========================================
	net->one_tp_nval = net->in[0]->one_tp_nval;
	
	//===========================================
	//in[0]が制御値(0)以外の場合計算
	//===========================================
	if(net->one_tp_nval != 0){
		//入力線数分演算
		for(i=1; i<net->n_in; i++){
			//----------------------------------------
			// 現在値と入力値が1とXの組合せ
			//----------------------------------------
			if( (net->one_tp_nval+net->in[i]->one_tp_nval) == 4 ){	//非制御値(1)とドントケア(3)
				net->one_tp_nval |= net->in[i]->one_tp_nval;		//例外処理
			}
			//----------------------------------------
			// その他の組合せ
			//----------------------------------------
			else{
				net->one_tp_nval &= net->in[i]->one_tp_nval;		//通常演算
			}
		}
	}
}

//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_nand
//  機  能 : NAND論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
//----------------------------------------------
static void sppfp_lsim_3v_xid_nand(NLIST *net){

	int		i;
	
	//===========================================
	//初期値代入 (in[0]の値)
	//===========================================
	net->one_tp_nval = net->in[0]->one_tp_nval;
	
	//===========================================
	//in[0]が制御値(0)以外の場合計算
	//===========================================
	if(net->one_tp_nval != 0){
		//入力線数分演算
		for(i=1; i<net->n_in; i++){
			//----------------------------------------
			// 現在値と入力値が1とXの組合せ
			//----------------------------------------
			if( (net->one_tp_nval+net->in[i]->one_tp_nval) == 4 ){	//非制御値(1)とドントケア(3)
				net->one_tp_nval |= net->in[i]->one_tp_nval;		//例外処理
			}
			//----------------------------------------
			// その他の組合せ
			//----------------------------------------
			else{
				net->one_tp_nval &= net->in[i]->one_tp_nval;		//通常演算
			}
		}
	}

	//===========================================
	//反転値計算
	//===========================================
	//------------------------------------
	//正常値0の場合
	//------------------------------------
	if(net->one_tp_nval == 0){
		net->one_tp_nval = 1;
	}
	//------------------------------------
	//正常値1の場合
	//------------------------------------
	else if(net->one_tp_nval == 1){
		net->one_tp_nval = 0;
	}
	//------------------------------------
	//正常値Xの場合
	//------------------------------------
	else if(net->one_tp_nval == 3){
		//ドントケアのまま
	}
	//------------------------------------
	//その他の場合
	//------------------------------------
	else{
		printf("\n//=============================\n");
		printf("// ERROR: SAF_3v_XID_SPPFP_LSIM\n");
		printf("//=============================\n");
		printf("正常値演算で0,1,3以外の謎値が入ってる!!\n");
		exit(-1);
	}

}

//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_or
//  機  能 : OR論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
//----------------------------------------------
static void sppfp_lsim_3v_xid_or(NLIST *net){

	int		i;
	
	//===========================================
	//初期値代入 (in[0]の値)
	//===========================================
	net->one_tp_nval = net->in[0]->one_tp_nval;
	
	//===========================================
	//in[0]が制御値(1)以外の場合計算
	//===========================================
	if(net->one_tp_nval != 1){
		//入力線数分演算
		for(i=1; i<net->n_in; i++){
			//----------------------------------------
			// 現在値と入力値が1とXの組合せ
			//----------------------------------------
			if( (net->one_tp_nval+net->in[i]->one_tp_nval) == 4 ){	//制御値(1)とドントケア(3)
				net->one_tp_nval &= net->in[i]->one_tp_nval;		//例外処理
			}
			//----------------------------------------
			// その他の組合せ
			//----------------------------------------
			else{
				net->one_tp_nval |= net->in[i]->one_tp_nval;		//通常演算
			}
		}
	}
}

//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_nor
//  機  能 : NOR論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
//----------------------------------------------
static void sppfp_lsim_3v_xid_nor(NLIST *net){

	int		i;
	
	//===========================================
	//初期値代入 (in[0]の値)
	//===========================================
	net->one_tp_nval = net->in[0]->one_tp_nval;
	
	//===========================================
	//in[0]が制御値(1)以外の場合計算
	//===========================================
	if(net->one_tp_nval != 1){
		//入力線数分演算
		for(i=1; i<net->n_in; i++){
			//----------------------------------------
			// 現在値と入力値が1とXの組合せ
			//----------------------------------------
			if( (net->one_tp_nval+net->in[i]->one_tp_nval) == 4 ){	//制御値(1)とドントケア(3)
				net->one_tp_nval &= net->in[i]->one_tp_nval;		//例外処理
			}
			//----------------------------------------
			// その他の組合せ
			//----------------------------------------
			else{
				net->one_tp_nval |= net->in[i]->one_tp_nval;		//通常演算
			}
		}
	}

	//===========================================
	//反転値計算
	//===========================================
	//------------------------------------
	//正常値0の場合
	//------------------------------------
	if(net->one_tp_nval == 0){
		net->one_tp_nval = 1;
	}
	//------------------------------------
	//正常値1の場合
	//------------------------------------
	else if(net->one_tp_nval == 1){
		net->one_tp_nval = 0;
	}
	//------------------------------------
	//正常値Xの場合
	//------------------------------------
	else if(net->one_tp_nval == 3){
		//ドントケアのまま
	}
	//------------------------------------
	//その他の場合
	//------------------------------------
	else{
		printf("\n//=============================\n");
		printf("// ERROR: SAF_3v_XID_SPPFP_LSIM\n");
		printf("//=============================\n");
		printf("正常値演算で0,1,3以外の謎値が入ってる!!\n");
		exit(-1);
	}
}


//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_exor
//  機  能 : EXOR論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
// ※2入力EXORのみ対応！
//----------------------------------------------
static void sppfp_lsim_3v_xid_exor(NLIST *net){
	
	//-----------------------------------------
	// X^X と 1^X の演算のみ例外処理
	//-----------------------------------------
	if( (net->in[0]->one_tp_nval+net->in[1]->one_tp_nval) >= 4){
		net->one_tp_nval = 3;	//例外演算：出力値はドントケア
	}
	//-----------------------------------------
	// その他は通常演算
	//-----------------------------------------
	else{
		net->one_tp_nval = net->in[0]->one_tp_nval ^ net->in[1]->one_tp_nval;
	}


}//END


//----------------------------------------------
//  関数名 : sppfp_lsim_3v_xid_exnor
//  機  能 : EXNOR論理演算(組合せ回路)
//  戻り値 : 演算対象信号線
//  引  数 : なし
// ※2入力EXNORのみ対応！
//----------------------------------------------
static void sppfp_lsim_3v_xid_exnor(NLIST *net){
	
	//-----------------------------------------
	// X^X と 1^X の演算のみ例外処理
	//-----------------------------------------
	if( (net->in[0]->one_tp_nval+net->in[1]->one_tp_nval) >= 4){
		net->one_tp_nval = 3;	//例外演算：出力値はドントケア
	}
	//-----------------------------------------
	// その他は通常演算
	//-----------------------------------------
	else{
		net->one_tp_nval = net->in[0]->one_tp_nval ^ net->in[1]->one_tp_nval;
	}

	//===========================================
	//反転値計算
	//===========================================
	//------------------------------------
	//正常値0の場合
	//------------------------------------
	if(net->one_tp_nval == 0){
		net->one_tp_nval = 1;
	}
	//------------------------------------
	//正常値1の場合
	//------------------------------------
	else if(net->one_tp_nval == 1){
		net->one_tp_nval = 0;
	}
	//------------------------------------
	//正常値Xの場合
	//------------------------------------
	else if(net->one_tp_nval == 3){
		//ドントケアのまま
	}
	//------------------------------------
	//その他の場合
	//------------------------------------
	else{
		printf("\n//=============================\n");
		printf("// ERROR: SAF_3v_XID_SPPFP_LSIM\n");
		printf("//=============================\n");
		printf("正常値演算で0,1,3以外の謎値が入ってる!!\n");
		exit(-1);
	}

}//END